<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Faculty;
class FacultySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        /*Faculty::factory()
        ->count(100)
        ->create();*/

        $faculties =[
            [
                'fac_id'=> '01999',
                'fac_name_th'=> ' คณะสังคมศาสตร์และศึกษาศาสตร์'
              ],
              [
                'fac_id'=> '01625',
                'fac_name_th'=> ' สำนักงานวิทยาเขตจันทบุรี'
              ],
              [
                'fac_id'=> '01914',
                'fac_name_th'=> 'วิทยาลัยการจัดการและพัฒนาท้องถิ่น'
              ],
              [
                'fac_id'=> '01883',
                'fac_name_th'=> 'วิทยาลัยสัตวแพทยศาสตร์อัครราชกุมารี'
              ],
              [
                'fac_id'=> '01565',
                'fac_name_th'=> 'Chinese Business School'
              ],
              [
                'fac_id'=> '01590',
                'fac_name_th'=> 'Chinese Language and Culture'
              ],
              [
                'fac_id'=> '09032',
                'fac_name_th'=> 'College of Agricultural Innovation and Food'
              ],
              [
                'fac_id'=> '09034',
                'fac_name_th'=> 'COLLEGE OF LIBERAL ARTS'
              ],
              [
                'fac_id'=> '01738',
                'fac_name_th'=> 'College of Logistics and Supply Chain'
              ],
              [
                'fac_id'=> '02144',
                'fac_name_th'=> 'College of Materials Innovation and Technology'
              ],
              [
                'fac_id'=> '01595',
                'fac_name_th'=> 'Digital Art'
              ],
              [
                'fac_id'=> '00757',
                'fac_name_th'=> 'DPU International College'
              ],
              [
                'fac_id'=> '01706',
                'fac_name_th'=> 'Educational Research Development and Demonstration Institute'
              ],
              [
                'fac_id'=> '02138',
                'fac_name_th'=> 'Faculty of Fine and Applied Art'
              ],
              [
                'fac_id'=> '01207',
                'fac_name_th'=> 'Faculty of Political Science'
              ],
              [
                'fac_id'=> '01592',
                'fac_name_th'=> 'GRADUATE COLLEGE OF MANAGEMENT'
              ],
              [
                'fac_id'=> '01594',
                'fac_name_th'=> 'Information Science Institute Of Sripatum University'
              ],
              [
                'fac_id'=> '09036',
                'fac_name_th'=> 'Institute of Diplomacy and International Studies'
              ],
              [
                'fac_id'=> '09035',
                'fac_name_th'=> 'Institute of Public Administration and Public Policy'
              ],
              [
                'fac_id'=> '02145',
                'fac_name_th'=> "King Mongkut's Institute of Technology Ladkrabang Business School (KBS)"
              ],
              [
                'fac_id'=> '00893',
                'fac_name_th'=> 'Office of International Program'
              ],
              [
                'fac_id'=> '01766',
                'fac_name_th'=> 'Research and Innovation office'
              ],
              [
                'fac_id'=> '02142',
                'fac_name_th'=> 'School of Architecture, Art, and Design'
              ],
              [
                'fac_id'=> '01880',
                'fac_name_th'=> 'กลุ่มสาขาวิชาการบริการ'
              ],
              [
                'fac_id'=> '01876',
                'fac_name_th'=> 'กลุ่มสาขาวิชาเทคโนโลยีสารสนเทศและการสื่อสาร'
              ],
              [
                'fac_id'=> '01874',
                'fac_name_th'=> 'กลุ่มสาขาวิชาธุรกิจและการบริหาร'
              ],
              [
                'fac_id'=> '01812',
                'fac_name_th'=> 'กลุ่มสาขาวิชานิติศาสตร์'
              ],
              [
                'fac_id'=> '01873',
                'fac_name_th'=> 'กลุ่มสาขาวิชานิเทศศาสตร์และสารสนเทศ'
              ],
              [
                'fac_id'=> '01807',
                'fac_name_th'=> 'กลุ่มสาขาวิชาบริหารธุรกิจและการบัญชี'
              ],
              [
                'fac_id'=> '01871',
                'fac_name_th'=> 'กลุ่มสาขาวิชาภาษา'
              ],
              [
                'fac_id'=> '01808',
                'fac_name_th'=> 'กลุ่มสาขาวิชาวิทยาศาสตร์ เทคโนโลยี และวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '01877',
                'fac_name_th'=> 'กลุ่มสาขาวิชาวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '01809',
                'fac_name_th'=> 'กลุ่มสาขาวิชาศิลปกรรมศาสตร์'
              ],
              [
                'fac_id'=> '01870',
                'fac_name_th'=> 'กลุ่มสาขาวิชาศิลปะ'
              ],
              [
                'fac_id'=> '01811',
                'fac_name_th'=> 'กลุ่มสาขาวิชาศึกษาศาสตร์'
              ],
              [
                'fac_id'=> '01872',
                'fac_name_th'=> 'กลุ่มสาขาวิชาสังคมศาสตร์และพฤติกรรมศาสตร์'
              ],
              [
                'fac_id'=> '01810',
                'fac_name_th'=> 'กลุ่มสาขาวิชาสังคมศาสตร์และมนุษยศาสตร์'
              ],
              [
                'fac_id'=> '00281',
                'fac_name_th'=> 'กองกลาง'
              ],
              [
                'fac_id'=> '00480',
                'fac_name_th'=> 'กองการกีฬา'
              ],
              [
                'fac_id'=> '00481',
                'fac_name_th'=> 'กองการเงิน'
              ],
              [
                'fac_id'=> '00282',
                'fac_name_th'=> 'กองการเจ้าหน้าที่'
              ],
              [
                'fac_id'=> '01414',
                'fac_name_th'=> 'กองกิจกรรมนักศึกษา'
              ],
              [
                'fac_id'=> '00482',
                'fac_name_th'=> 'กองกิจกรรมและสวัสดิการนักศึกษา'
              ],
              [
                'fac_id'=> '00327',
                'fac_name_th'=> 'กองกิจการนักศึกษา'
              ],
              [
                'fac_id'=> '00283',
                'fac_name_th'=> 'กองกิจการนิสิต'
              ],
              [
                'fac_id'=> '00328',
                'fac_name_th'=> 'กองคลัง'
              ],
              [
                'fac_id'=> '00284',
                'fac_name_th'=> 'กองคลังและพัสดุ'
              ],
              [
                'fac_id'=> '00329',
                'fac_name_th'=> 'กองงานพัสดุ'
              ],
              [
                'fac_id'=> '00330',
                'fac_name_th'=> 'กองงานยานพาหนะ'
              ],
              [
                'fac_id'=> '01071',
                'fac_name_th'=> 'กองงานศูนย์รังสิต'
              ],
              [
                'fac_id'=> '00331',
                'fac_name_th'=> 'กองงานอาคารสถานที่'
              ],
              [
                'fac_id'=> '01410',
                'fac_name_th'=> 'กองจัดการธุรกิจ'
              ],
              [
                'fac_id'=> '01434',
                'fac_name_th'=> 'กองทรัพยากรบุคคล'
              ],
              [
                'fac_id'=> '00285',
                'fac_name_th'=> 'กองทะเบียนและประมวลผล'
              ],
              [
                'fac_id'=> '00818',
                'fac_name_th'=> 'กองนโยบายและแผน'
              ],
              [
                'fac_id'=> '00483',
                'fac_name_th'=> 'กองนิติการ'
              ],
              [
                'fac_id'=> '01412',
                'fac_name_th'=> 'กองแนะแนวและศึษย์เก่าสัมพันธ์'
              ],
              [
                'fac_id'=> '00286',
                'fac_name_th'=> 'กองบริการการศึกษา'
              ],
              [
                'fac_id'=> '00484',
                'fac_name_th'=> 'กองบริการคำสอนและสิ่งพิมพ์'
              ],
              [
                'fac_id'=> '00485',
                'fac_name_th'=> 'กองบริการแนะแนวและจัดหางาน'
              ],
              [
                'fac_id'=> '00831',
                'fac_name_th'=> 'กองบริการและเทคโนโลยี'
              ],
              [
                'fac_id'=> '01444',
                'fac_name_th'=> 'กองบริการวิทยาเขตจันทบุรี'
              ],
              [
                'fac_id'=> '01408',
                'fac_name_th'=> 'กองบริการสิ่งพิมพ์'
              ],
              [
                'fac_id'=> '00368',
                'fac_name_th'=> 'กองบริหารกลาง'
              ],
              [
                'fac_id'=> '01432',
                'fac_name_th'=> 'กองบริหารการศึกษา'
              ],
              [
                'fac_id'=> '01433',
                'fac_name_th'=> 'กองบริหารงานทั่วไป'
              ],
              [
                'fac_id'=> '00817',
                'fac_name_th'=> 'กองบริหารงานบุคคล'
              ],
              [
                'fac_id'=> '01100',
                'fac_name_th'=> 'กองบริหารงานวิจัย'
              ],
              [
                'fac_id'=> '00819',
                'fac_name_th'=> 'กองบริหารแผนและการคลัง'
              ],
              [
                'fac_id'=> '00597',
                'fac_name_th'=> 'กองบริหารวิทยาเขตสระแก้ว'
              ],
              [
                'fac_id'=> '00598',
                'fac_name_th'=> 'กองบริหารวิทยาเขตสารสนเทศจันทบุรี'
              ],
              [
                'fac_id'=> '00486',
                'fac_name_th'=> 'กองบัญชีและงบประมาณ'
              ],
              [
                'fac_id'=> '01458',
                'fac_name_th'=> 'กองบุคลากร'
              ],
              [
                'fac_id'=> '01400',
                'fac_name_th'=> 'กองประกันคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00487',
                'fac_name_th'=> 'กองประชาสัมพันธ์'
              ],
              [
                'fac_id'=> '00289',
                'fac_name_th'=> 'กองแผนงาน'
              ],
              [
                'fac_id'=> '01457',
                'fac_name_th'=> 'กองแผนและพัฒนา'
              ],
              [
                'fac_id'=> '01192',
                'fac_name_th'=> 'กองพัฒนาคุณภาพ'
              ],
              [
                'fac_id'=> '00408',
                'fac_name_th'=> 'กองพัฒนานโยบายและแผน'
              ],
              [
                'fac_id'=> '00488',
                'fac_name_th'=> 'กองพัฒนานักศึกษา'
              ],
              [
                'fac_id'=> '00332',
                'fac_name_th'=> 'กองพัสดุ'
              ],
              [
                'fac_id'=> '00489',
                'fac_name_th'=> 'กองพัสดุและจัดการทรัพย์สิน'
              ],
              [
                'fac_id'=> '00333',
                'fac_name_th'=> 'กองยานพาหนะ'
              ],
              [
                'fac_id'=> '00490',
                'fac_name_th'=> 'กองวิเคราะห์และพัฒนา'
              ],
              [
                'fac_id'=> '00820',
                'fac_name_th'=> 'กองวิจัยและพัฒนา'
              ],
              [
                'fac_id'=> '00491',
                'fac_name_th'=> 'กองวิชาการ'
              ],
              [
                'fac_id'=> '00821',
                'fac_name_th'=> 'กองวิทยบริการและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00492',
                'fac_name_th'=> 'กองวิเทศสัมพันธ์'
              ],
              [
                'fac_id'=> '01106',
                'fac_name_th'=> 'กองวิเทศสัมพันธ์และการประกันคุณภาพ'
              ],
              [
                'fac_id'=> '00963',
                'fac_name_th'=> 'กองศิลปวัฒนธรรม'
              ],
              [
                'fac_id'=> '00493',
                'fac_name_th'=> 'กองศิษย์เก่าและหอการค้าสัมพันธ์'
              ],
              [
                'fac_id'=> '00494',
                'fac_name_th'=> 'กองส่งเสริมการรับนักศึกษา'
              ],
              [
                'fac_id'=> '00495',
                'fac_name_th'=> 'กองส่งเสริมการศึกษา'
              ],
              [
                'fac_id'=> '01406',
                'fac_name_th'=> 'กองส่งเสริมงานวิจัย'
              ],
              [
                'fac_id'=> '00287',
                'fac_name_th'=> 'กองส่งเสริมและพัฒนางานวิจัย'
              ],
              [
                'fac_id'=> '00822',
                'fac_name_th'=> 'กองส่งเสริมวิชาการและงานทะเบียน'
              ],
              [
                'fac_id'=> '00496',
                'fac_name_th'=> 'กองส่งเสริมศิลปวัฒนธรรมไทย'
              ],
              [
                'fac_id'=> '01418',
                'fac_name_th'=> 'กองส่งเสริมศิลปะและวัฒนธรรม'
              ],
              [
                'fac_id'=> '00954',
                'fac_name_th'=> 'กองสวัสดิการ'
              ],
              [
                'fac_id'=> '01416',
                'fac_name_th'=> 'กองสวัสดิการนักศึกษา'
              ],
              [
                'fac_id'=> '00497',
                'fac_name_th'=> 'กองสารสนเทศ'
              ],
              [
                'fac_id'=> '01107',
                'fac_name_th'=> 'กองออกแบบและพัฒนาอาคารสถานที่'
              ],
              [
                'fac_id'=> '00288',
                'fac_name_th'=> 'กองอาคารสถานที่'
              ],
              [
                'fac_id'=> '00397',
                'fac_name_th'=> 'การเจ้าหน้าที่'
              ],
              [
                'fac_id'=> '00250',
                'fac_name_th'=> 'เกษตรศาสตร์ทรัพยากรธรรมชาติและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00001',
                'fac_name_th'=> 'คณะกายภาพบำบัด'
              ],
              [
                'fac_id'=> '00267',
                'fac_name_th'=> 'คณะกายภาพบำบัดและวิทยาศาสตร์การเคลื่อนไหวประยุกต์'
              ],
              [
                'fac_id'=> '01930',
                'fac_name_th'=> 'คณะกายภาพบำบัดและเวชศาสตร์การกีฬา'
              ],
              [
                'fac_id'=> '01162',
                'fac_name_th'=> 'คณะการจัดการ'
              ],
              [
                'fac_id'=> '01695',
                'fac_name_th'=> 'คณะการจัดการการท่องเที่ยว'
              ],
              [
                'fac_id'=> '02166',
                'fac_name_th'=> 'คณะการจัดการการศึกษาเชิงสร้างสรรค์'
              ],
              [
                'fac_id'=> '00002',
                'fac_name_th'=> 'คณะการจัดการธุรกิจความเสี่ยงและอุตสาหกรรมบริการ'
              ],
              [
                'fac_id'=> '01988',
                'fac_name_th'=> 'คณะการจัดการธุรกิจและการเงิน'
              ],
              [
                'fac_id'=> '01718',
                'fac_name_th'=> 'คณะการจัดการธุรกิจอาหาร'
              ],
              [
                'fac_id'=> '01855',
                'fac_name_th'=> 'คณะการจัดการโรงแรมและการท่องเที่ยว'
              ],
              [
                'fac_id'=> '01002',
                'fac_name_th'=> 'คณะการจัดการและการท่องเที่ยว'
              ],
              [
                'fac_id'=> '00751',
                'fac_name_th'=> 'คณะการจัดการและการบัญชี'
              ],
              [
                'fac_id'=> '01924',
                'fac_name_th'=> 'คณะการจัดการโลจิสติกส์และการคมนาคมขนส่ง'
              ],
              [
                'fac_id'=> '00203',
                'fac_name_th'=> 'คณะการจัดการสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00290',
                'fac_name_th'=> 'คณะการท่องเที่ยวและการโรงแรม'
              ],
              [
                'fac_id'=> '01832',
                'fac_name_th'=> 'คณะการท่องเที่ยวและอุตสาหกรรมบริการ'
              ],
              [
                'fac_id'=> '01124',
                'fac_name_th'=> 'คณะการบริการและการท่องเที่ยว'
              ],
              [
                'fac_id'=> '01794',
                'fac_name_th'=> 'คณะการบริหารและจัดการ'
              ],
              [
                'fac_id'=> '00761',
                'fac_name_th'=> 'คณะการบัญชี'
              ],
              [
                'fac_id'=> '00197',
                'fac_name_th'=> 'คณะการบัญชีและการจัดการ'
              ],
              [
                'fac_id'=> '01617',
                'fac_name_th'=> 'คณะการบิน'
              ],
              [
                'fac_id'=> '00273',
                'fac_name_th'=> 'คณะการแพทย์แผนจีน'
              ],
              [
                'fac_id'=> '00004',
                'fac_name_th'=> 'คณะการแพทย์แผนตะวันออก'
              ],
              [
                'fac_id'=> '01606',
                'fac_name_th'=> 'คณะการแพทย์แผนไทย'
              ],
              [
                'fac_id'=> '01003',
                'fac_name_th'=> 'คณะการแพทย์แผนไทยอภัยภูเบศร'
              ],
              [
                'fac_id'=> '01986',
                'fac_name_th'=> 'คณะการศึกษาปฐมวัย'
              ],
              [
                'fac_id'=> '01693',
                'fac_name_th'=> 'คณะการสร้างเจ้าของธุรกิจและการบริหารกิจการ'
              ],
              [
                'fac_id'=> '01992',
                'fac_name_th'=> 'คณะการสื่อสารดิจิทัล'
              ],
              [
                'fac_id'=> '00795',
                'fac_name_th'=> 'คณะการสื่อสารมวลชน'
              ],
              [
                'fac_id'=> '00514',
                'fac_name_th'=> 'คณะเกษตร'
              ],
              [
                'fac_id'=> '00521',
                'fac_name_th'=> 'คณะเกษตร กำแพงแสน'
              ],
              [
                'fac_id'=> '01754',
                'fac_name_th'=> 'คณะเกษตรเเละอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '00952',
                'fac_name_th'=> 'คณะเกษตรและชีวภาพ'
              ],
              [
                'fac_id'=> '01689',
                'fac_name_th'=> 'คณะเกษตรและเทคโนโลยี'
              ],
              [
                'fac_id'=> '00005',
                'fac_name_th'=> 'คณะเกษตรและเทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '00006',
                'fac_name_th'=> 'คณะเกษตรศาสตร์'
              ],
              [
                'fac_id'=> '00007',
                'fac_name_th'=> 'คณะเกษตรศาสตร์ ทรัพยากร'
              ],
              [
                'fac_id'=> '01043',
                'fac_name_th'=> 'คณะเกษตรศาสตร์ทรัพยากรธรรมชาติและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00008',
                'fac_name_th'=> 'คณะเกษตรศาสตร์บางพระ'
              ],
              [
                'fac_id'=> '00009',
                'fac_name_th'=> 'คณะเกษตรศาสตร์และทรัพยากรธรรมชาติ'
              ],
              [
                'fac_id'=> '00824',
                'fac_name_th'=> 'คณะเกษตรศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00010',
                'fac_name_th'=> 'คณะเกษตรศาสตร์และสิ่งแว้ดล้อม'
              ],
              [
                'fac_id'=> '01878',
                'fac_name_th'=> 'คณะคริสตศาสนศาสตร์'
              ],
              [
                'fac_id'=> '00011',
                'fac_name_th'=> 'คณะครุศาสตร์'
              ],
              [
                'fac_id'=> '00924',
                'fac_name_th'=> 'คณะครุศาสตร์เทคโนโลยี'
              ],
              [
                'fac_id'=> '00013',
                'fac_name_th'=> 'คณะครุศาสตร์อุตสาหกรรม'
              ],
              [
                'fac_id'=> '00917',
                'fac_name_th'=> 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี'
              ],
              [
                'fac_id'=> '00014',
                'fac_name_th'=> 'คณะคหกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00015',
                'fac_name_th'=> 'คณะคอมพิวเตอร์และเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00253',
                'fac_name_th'=> 'คณะเครื่องกล'
              ],
              [
                'fac_id'=> '00016',
                'fac_name_th'=> 'คณะโครงการจัดตั้งสำนักวิชาเภสัชศาสตร์'
              ],
              [
                'fac_id'=> '00017',
                'fac_name_th'=> 'คณะจิตรกรรม ประติมากรรม และภาพพิมพ์'
              ],
              [
                'fac_id'=> '00018',
                'fac_name_th'=> 'คณะจิตวิทยา'
              ],
              [
                'fac_id'=> '00849',
                'fac_name_th'=> 'คณะดนตรี'
              ],
              [
                'fac_id'=> '01707',
                'fac_name_th'=> 'คณะดนตรีและการแสดง'
              ],
              [
                'fac_id'=> '01022',
                'fac_name_th'=> 'คณะดิจิทัลมีเดีย'
              ],
              [
                'fac_id'=> '01763',
                'fac_name_th'=> 'คณะดิจิทัลมีเดียและศิลปะภาพยนตร์'
              ],
              [
                'fac_id'=> '00019',
                'fac_name_th'=> 'คณะดุริยางคศาสตร์'
              ],
              [
                'fac_id'=> '00021',
                'fac_name_th'=> 'คณะทรัพยากรชีวภาพและเทคโนโลยี'
              ],
              [
                'fac_id'=> '00189',
                'fac_name_th'=> 'คณะทรัพยากรชีวภาพและเทคโนโลยี ร่วมกับคณะเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00020',
                'fac_name_th'=> 'คณะทรัพยากรธรรมชาติ'
              ],
              [
                'fac_id'=> '00241',
                'fac_name_th'=> 'คณะทรัพยากรธรรมชาติและอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '00240',
                'fac_name_th'=> 'คณะทรัพยากรและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00022',
                'fac_name_th'=> 'คณะทรัพยากรสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00023',
                'fac_name_th'=> 'คณะทันตแพทยศาสตร์'
              ],
              [
                'fac_id'=> '00479',
                'fac_name_th'=> 'คณะทัศนแพทยศาสตร์'
              ],
              [
                'fac_id'=> '01720',
                'fac_name_th'=> 'คณะทัศนมาตรศาสตร์'
              ],
              [
                'fac_id'=> '00995',
                'fac_name_th'=> 'คณะทัศนศาสตร์'
              ],
              [
                'fac_id'=> '00024',
                'fac_name_th'=> 'คณะเทคนิคการแพทย์'
              ],
              [
                'fac_id'=> '00233',
                'fac_name_th'=> 'คณะเทคนิคการสัตวแพทย์'
              ],
              [
                'fac_id'=> '00025',
                'fac_name_th'=> 'คณะเทคโนโลยี'
              ],
              [
                'fac_id'=> '00026',
                'fac_name_th'=> 'คณะเทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '00272',
                'fac_name_th'=> 'คณะเทคโนโลยีการเกษตรและเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '01047',
                'fac_name_th'=> 'คณะเทคโนโลยีการเกษตรและอาหาร'
              ],
              [
                'fac_id'=> '00476',
                'fac_name_th'=> 'คณะเทคโนโลยีการเกษตรและอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '00825',
                'fac_name_th'=> 'คณะเทคโนโลยีการจัดการ'
              ],
              [
                'fac_id'=> '00636',
                'fac_name_th'=> 'คณะเทคโนโลยีการประมงและทรัพยากรทางน้ำ'
              ],
              [
                'fac_id'=> '00254',
                'fac_name_th'=> 'คณะเทคโนโลยีการผลิต'
              ],
              [
                'fac_id'=> '00217',
                'fac_name_th'=> 'คณะเทคโนโลยีการสื่อสารมวลชน'
              ],
              [
                'fac_id'=> '00830',
                'fac_name_th'=> 'คณะเทคโนโลยีคหกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00028',
                'fac_name_th'=> 'คณะเทคโนโลยีชีวภาพ'
              ],
              [
                'fac_id'=> '02032',
                'fac_name_th'=> 'คณะเทคโนโลยีดิจิทัล'
              ],
              [
                'fac_id'=> '00896',
                'fac_name_th'=> 'คณะเทคโนโลยีทางการศึกษา'
              ],
              [
                'fac_id'=> '00276',
                'fac_name_th'=> 'คณะเทคโนโลยีทางทะเล'
              ],
              [
                'fac_id'=> '00029',
                'fac_name_th'=> 'คณะเทคโนโลยีและการจัดการ'
              ],
              [
                'fac_id'=> '00030',
                'fac_name_th'=> 'คณะเทคโนโลยีและการจัดการอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00683',
                'fac_name_th'=> 'คณะเทคโนโลยีและการพัฒนาชุมชน'
              ],
              [
                'fac_id'=> '01651',
                'fac_name_th'=> 'คณะเทคโนโลยีและนวัตกรรม'
              ],
              [
                'fac_id'=> '01165',
                'fac_name_th'=> 'คณะเทคโนโลยีและนวัตกรรมผลิตภัณฑ์การเกษตร'
              ],
              [
                'fac_id'=> '00888',
                'fac_name_th'=> 'คณะเทคโนโลยีและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00827',
                'fac_name_th'=> 'คณะเทคโนโลยีสังคม'
              ],
              [
                'fac_id'=> '00031',
                'fac_name_th'=> 'คณะเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '80005',
                'fac_name_th'=> 'คณะเทคโนโลยีสารสนเทศ วิทยาเขตชลบุรี'
              ],
              [
                'fac_id'=> '00196',
                'fac_name_th'=> 'คณะเทคโนโลยีสารสนเทศและการสื่อสาร'
              ],
              [
                'fac_id'=> '01819',
                'fac_name_th'=> 'คณะเทคโนโลยีสารสนเทศและนวัตกรรม'
              ],
              [
                'fac_id'=> '00032',
                'fac_name_th'=> 'คณะเทคโนโลยีสื่อสารมวลชน'
              ],
              [
                'fac_id'=> '00027',
                'fac_name_th'=> 'คณะเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00033',
                'fac_name_th'=> 'คณะเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '01128',
                'fac_name_th'=> 'คณะเทคโนโลยีอุตสาหกรรมการเกษตร'
              ],
              [
                'fac_id'=> '00826',
                'fac_name_th'=> 'คณะเทคโนโลยีอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '01080',
                'fac_name_th'=> 'คณะเทคโนโลยีอุตสาหกรรมและอัญมณีศาสตร์'
              ],
              [
                'fac_id'=> '00034',
                'fac_name_th'=> 'คณะธุรกิจการเกษตร'
              ],
              [
                'fac_id'=> '01261',
                'fac_name_th'=> 'คณะธุรกิจการบริการ'
              ],
              [
                'fac_id'=> '00035',
                'fac_name_th'=> 'คณะธุรกิจและเทคโนโลยี'
              ],
              [
                'fac_id'=> '01687',
                'fac_name_th'=> 'คณะนวัตกรรมการจัดการเกษตร'
              ],
              [
                'fac_id'=> '00036',
                'fac_name_th'=> 'คณะนาฏศิลปและดุริยางค์'
              ],
              [
                'fac_id'=> '01091',
                'fac_name_th'=> 'คณะนิติรัฐศาสตร์'
              ],
              [
                'fac_id'=> '00037',
                'fac_name_th'=> 'คณะนิติศาสตร์'
              ],
              [
                'fac_id'=> '80001',
                'fac_name_th'=> 'คณะนิติศาสตร์ วิทยาเขตชลบุรี'
              ],
              [
                'fac_id'=> '01994',
                'fac_name_th'=> 'คณะนิติศาสตร์และการปกครอง'
              ],
              [
                'fac_id'=> '00868',
                'fac_name_th'=> 'คณะนิติศาสตร์และรัฐประศาสนศาสตร์'
              ],
              [
                'fac_id'=> '00808',
                'fac_name_th'=> 'คณะนิติศาสตร์และรัฐศาสตร์'
              ],
              [
                'fac_id'=> '00038',
                'fac_name_th'=> 'คณะนิเทศศาสตร์'
              ],
              [
                'fac_id'=> '80002',
                'fac_name_th'=> 'คณะนิเทศศาสตร์ วิทยาเขตชลบุรี'
              ],
              [
                'fac_id'=> '01839',
                'fac_name_th'=> 'คณะนิเทศศาสตร์และการออกแบบ'
              ],
              [
                'fac_id'=> '01684',
                'fac_name_th'=> 'คณะนิเทศศาสตร์และนวัตกรรมกการจัดการ'
              ],
              [
                'fac_id'=> '01748',
                'fac_name_th'=> 'คณะบริหารการพัฒนาสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00039',
                'fac_name_th'=> 'คณะบริหารธุรกิจ'
              ],
              [
                'fac_id'=> '80003',
                'fac_name_th'=> 'คณะบริหารธุรกิจ วิทยาเขตชลบุรี'
              ],
              [
                'fac_id'=> '01682',
                'fac_name_th'=> 'คณะบริหารธุรกิจ เศรษฐศาสตร์ และการสื่อสาร'
              ],
              [
                'fac_id'=> '00041',
                'fac_name_th'=> 'คณะบริหารธุรกิจบัณฑิต'
              ],
              [
                'fac_id'=> '01945',
                'fac_name_th'=> 'คณะบริหารธุรกิจเพื่อสังคม'
              ],
              [
                'fac_id'=> '00722',
                'fac_name_th'=> 'คณะบริหารธุรกิจภาคภาษาอังกฤษ'
              ],
              [
                'fac_id'=> '00588',
                'fac_name_th'=> 'คณะบริหารธุรกิจและการจัดการ'
              ],
              [
                'fac_id'=> '01728',
                'fac_name_th'=> 'คณะบริหารธุรกิจและการบัญชี'
              ],
              [
                'fac_id'=> '01837',
                'fac_name_th'=> 'คณะบริหารธุรกิจและเทคโนโลยี'
              ],
              [
                'fac_id'=> '00474',
                'fac_name_th'=> 'คณะบริหารธุรกิจและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '02158',
                'fac_name_th'=> 'คณะบริหารธุรกิจและนิเทศศาสตร์'
              ],
              [
                'fac_id'=> '01704',
                'fac_name_th'=> 'คณะบริหารธุรกิจและรัฐประศาสนศาสตร์'
              ],
              [
                'fac_id'=> '02028',
                'fac_name_th'=> 'คณะบริหารธุรกิจและวิทยาศาสตร์'
              ],
              [
                'fac_id'=> '01064',
                'fac_name_th'=> 'คณะบริหารธุรกิจและศิลปศาสตร์'
              ],
              [
                'fac_id'=> '01772',
                'fac_name_th'=> 'คณะบริหารธุรกิจและอุตสาหกรรมบริการ'
              ],
              [
                'fac_id'=> '01085',
                'fac_name_th'=> 'คณะบริหารรัฐกิจ'
              ],
              [
                'fac_id'=> '01841',
                'fac_name_th'=> 'คณะบริหารและการจัดการ'
              ],
              [
                'fac_id'=> '00809',
                'fac_name_th'=> 'คณะบริหารศาสตร์'
              ],
              [
                'fac_id'=> '00003',
                'fac_name_th'=> 'คณะบัญชี'
              ],
              [
                'fac_id'=> '00042',
                'fac_name_th'=> 'คณะบัญชี การเงินและการธนาคาร'
              ],
              [
                'fac_id'=> '01646',
                'fac_name_th'=> 'คณะบัญชี ธุรกิจและมัลติมีเดีย'
              ],
              [
                'fac_id'=> '80004',
                'fac_name_th'=> 'คณะบัญชี วิทยาเขตชลบุรี'
              ],
              [
                'fac_id'=> '02026',
                'fac_name_th'=> 'คณะบัญชี เศรษฐศาสตร์และการเงิน'
              ],
              [
                'fac_id'=> '01917',
                'fac_name_th'=> 'คณะบัญชีและวิทยาการจัดการ'
              ],
              [
                'fac_id'=> '00043',
                'fac_name_th'=> 'คณะบัณฑิตวิทยาลัย'
              ],
              [
                'fac_id'=> '00044',
                'fac_name_th'=> 'คณะบัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00045',
                'fac_name_th'=> 'คณะโบราณคดี'
              ],
              [
                'fac_id'=> '00046',
                'fac_name_th'=> 'คณะประมง'
              ],
              [
                'fac_id'=> '00998',
                'fac_name_th'=> 'คณะปรัชญาและศาสนา'
              ],
              [
                'fac_id'=> '00047',
                'fac_name_th'=> 'คณะผลิตกรรมการเกษตร'
              ],
              [
                'fac_id'=> '00048',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์'
              ],
              [
                'fac_id'=> '80023',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์ กาญจนบุรี'
              ],
              [
                'fac_id'=> '80025',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์ บุรีรัมย์'
              ],
              [
                'fac_id'=> '80024',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์ วัชรพล'
              ],
              [
                'fac_id'=> '80034',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์ วิทยาเขตปัตตานี'
              ],
              [
                'fac_id'=> '80028',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์เกื้อการุณย์'
              ],
              [
                'fac_id'=> '00049',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์แมคคอร์มิค'
              ],
              [
                'fac_id'=> '00050',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์และคณะศิลปศาสตร์'
              ],
              [
                'fac_id'=> '02047',
                'fac_name_th'=> 'คณะพยาบาลศาสตร์และวิทยาการสุขภาพ'
              ],
              [
                'fac_id'=> '00051',
                'fac_name_th'=> 'คณะพลศึกษา'
              ],
              [
                'fac_id'=> '00190',
                'fac_name_th'=> 'คณะพลังงานและวัสดุ'
              ],
              [
                'fac_id'=> '01996',
                'fac_name_th'=> 'คณะพลังงานและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00918',
                'fac_name_th'=> 'คณะพลังงานสิ่งแวดล้อมและวัสดุ'
              ],
              [
                'fac_id'=> '00637',
                'fac_name_th'=> 'คณะพัฒนาการท่องเที่ยว'
              ],
              [
                'fac_id'=> '00052',
                'fac_name_th'=> 'คณะพัฒนาการเศรษฐกิจ'
              ],
              [
                'fac_id'=> '00800',
                'fac_name_th'=> 'คณะพัฒนาทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '01750',
                'fac_name_th'=> 'คณะพัฒนาธุรกิจและอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00053',
                'fac_name_th'=> 'คณะพัฒนาสังคม'
              ],
              [
                'fac_id'=> '00805',
                'fac_name_th'=> 'คณะพัฒนาสังคมและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00844',
                'fac_name_th'=> 'คณะพาณิชยนาวีนานาชาติ'
              ],
              [
                'fac_id'=> '00054',
                'fac_name_th'=> 'คณะพาณิชยศาสตร์'
              ],
              [
                'fac_id'=> '00570',
                'fac_name_th'=> 'คณะพาณิชยศาสตร์และการจัดการ'
              ],
              [
                'fac_id'=> '00055',
                'fac_name_th'=> 'คณะพาณิชยศาสตร์และการบัญชี'
              ],
              [
                'fac_id'=> '01824',
                'fac_name_th'=> 'คณะพาณิชยศาสตร์และอุตสาหกรรมบริการ'
              ],
              [
                'fac_id'=> '00244',
                'fac_name_th'=> 'คณะพุทธศาสตร์'
              ],
              [
                'fac_id'=> '01672',
                'fac_name_th'=> 'คณะแพทย์แผนไทยและแพทย์ทางเลือก'
              ],
              [
                'fac_id'=> '00056',
                'fac_name_th'=> 'คณะแพทยศาสตร์'
              ],
              [
                'fac_id'=> '00210',
                'fac_name_th'=> 'คณะแพทยศาสตร์โรงพยาบาลรามาธิบดี'
              ],
              [
                'fac_id'=> '02222',
                'fac_name_th'=> 'คณะแพทยศาสตร์และการสาธารณสุข'
              ],
              [
                'fac_id'=> '80027',
                'fac_name_th'=> 'คณะแพทยศาสตร์วชิรพยาบาล'
              ],
              [
                'fac_id'=> '00057',
                'fac_name_th'=> 'คณะแพทยศาสตร์ศิริราชพยาบาล'
              ],
              [
                'fac_id'=> '00417',
                'fac_name_th'=> 'คณะแพทศาสตร์'
              ],
              [
                'fac_id'=> '00252',
                'fac_name_th'=> 'คณะไฟฟ้า'
              ],
              [
                'fac_id'=> '00058',
                'fac_name_th'=> 'คณะภาษาและการสื่อสาร'
              ],
              [
                'fac_id'=> '01580',
                'fac_name_th'=> 'คณะภาษาและวัฒนธรรมจีน '
              ],
              [
                'fac_id'=> '01443',
                'fac_name_th'=> 'คณะภูมิสารสนเทศศาสตร์'
              ],
              [
                'fac_id'=> '00059',
                'fac_name_th'=> 'คณะเภสัชศาสตร์'
              ],
              [
                'fac_id'=> '00201',
                'fac_name_th'=> 'คณะเภสัชศาสตร์และวิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '00060',
                'fac_name_th'=> 'คณะมนุษย์ศาสตร์'
              ],
              [
                'fac_id'=> '00061',
                'fac_name_th'=> 'คณะมนุษยศาสตร์'
              ],
              [
                'fac_id'=> '00062',
                'fac_name_th'=> 'คณะมนุษยศาสตร์ สาขาศิลปศาสตร์'
              ],
              [
                'fac_id'=> '02030',
                'fac_name_th'=> 'คณะมนุษยศาสตร์และนิเทศศาสตร์'
              ],
              [
                'fac_id'=> '00063',
                'fac_name_th'=> 'คณะมนุษย์ศาสตร์และสังคมศาสตร์'
              ],
              [
                'fac_id'=> '00064',
                'fac_name_th'=> 'คณะมนุษยศาสตร์และสังคมศาสตร์'
              ],
              [
                'fac_id'=> '00065',
                'fac_name_th'=> 'คณะมนุษย์ศาสตร์และสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00066',
                'fac_name_th'=> 'คณะมัณฑนศิลป'
              ],
              [
                'fac_id'=> '01087',
                'fac_name_th'=> 'คณะมัลติมีเดียและดิจิทัลอาร์ต'
              ],
              [
                'fac_id'=> '00255',
                'fac_name_th'=> 'คณะโยธา'
              ],
              [
                'fac_id'=> '01835',
                'fac_name_th'=> 'คณะรังสีเทคนิค'
              ],
              [
                'fac_id'=> '00067',
                'fac_name_th'=> 'คณะรัฐประศาสนศาสตร์'
              ],
              [
                'fac_id'=> '01997',
                'fac_name_th'=> 'คณะรัฐประศาสนศาสตร์และสังคมศึกษา '
              ],
              [
                'fac_id'=> '00068',
                'fac_name_th'=> 'คณะรัฐศาสตร์'
              ],
              [
                'fac_id'=> '01004',
                'fac_name_th'=> 'คณะรัฐศาสตร์และนิติศาสตร์'
              ],
              [
                'fac_id'=> '00796',
                'fac_name_th'=> 'คณะรัฐศาสตร์และรัฐประศาสนศาสตร์'
              ],
              [
                'fac_id'=> '01743',
                'fac_name_th'=> 'คณะรัฐศาสตร์และสังคมศาสตร์'
              ],
              [
                'fac_id'=> '01005',
                'fac_name_th'=> 'คณะโลจิสติกส์'
              ],
              [
                'fac_id'=> '02130',
                'fac_name_th'=> 'คณะโลจิสติกส์และดิจิทัลซัพพลายเชน'
              ],
              [
                'fac_id'=> '01916',
                'fac_name_th'=> 'คณะโลจิสติกส์และเทคโนโลยีการบิน'
              ],
              [
                'fac_id'=> '00069',
                'fac_name_th'=> 'คณะวนศาสตร์'
              ],
              [
                'fac_id'=> '01681',
                'fac_name_th'=> 'คณะวัฒนธรรมศาสตร์'
              ],
              [
                'fac_id'=> '01622',
                'fac_name_th'=> 'คณะวัฒนธรรมสิ่งแวดล้อมและการท่องเที่ยวเชิงนิเวศ '
              ],
              [
                'fac_id'=> '00070',
                'fac_name_th'=> 'คณะวารสารและสื่อสารมวลชน'
              ],
              [
                'fac_id'=> '00625',
                'fac_name_th'=> 'คณะวารสารศาสตร์และสื่อสารมวลชน'
              ],
              [
                'fac_id'=> '00071',
                'fac_name_th'=> 'คณะวิจิตรศิลป์'
              ],
              [
                'fac_id'=> '00072',
                'fac_name_th'=> 'คณะวิจิตรศิลป์และประยุกต์ศิลป์'
              ],
              [
                'fac_id'=> '00623',
                'fac_name_th'=> 'คณะวิชาอุตสาหกรรมสิ่งทอ'
              ],
              [
                'fac_id'=> '01774',
                'fac_name_th'=> 'คณะวิทยาการคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '01675',
                'fac_name_th'=> 'คณะวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00073',
                'fac_name_th'=> 'คณะวิทยาการจัดการ'
              ],
              [
                'fac_id'=> '00074',
                'fac_name_th'=> 'คณะวิทยาการจัดการ สาขาบริหารธุรกิจและการจัดการ'
              ],
              [
                'fac_id'=> '01023',
                'fac_name_th'=> 'คณะวิทยาการจัดการและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '01044',
                'fac_name_th'=> 'คณะวิทยาการจัดการและสารสนเทศศาสตร์'
              ],
              [
                'fac_id'=> '01758',
                'fac_name_th'=> 'คณะวิทยาการเรียนรู้และศึกษาศาสตร์'
              ],
              [
                'fac_id'=> '01041',
                'fac_name_th'=> 'คณะวิทยาการและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00075',
                'fac_name_th'=> 'คณะวิทยาการวิชาชีพ'
              ],
              [
                'fac_id'=> '00198',
                'fac_name_th'=> 'คณะวิทยาการสารสนเทศ'
              ],
              [
                'fac_id'=> '00205',
                'fac_name_th'=> 'คณะวิทยาการสื่อสาร'
              ],
              [
                'fac_id'=> '00682',
                'fac_name_th'=> 'คณะวิทยาการสุขภาพและการกีฬา'
              ],
              [
                'fac_id'=> '00076',
                'fac_name_th'=> 'คณะวิทยาลัยดนตรี'
              ],
              [
                'fac_id'=> '00077',
                'fac_name_th'=> 'คณะวิทยาลัยนวัตกรรมสังคม'
              ],
              [
                'fac_id'=> '00246',
                'fac_name_th'=> 'คณะวิทยาลัยนานาชาติ'
              ],
              [
                'fac_id'=> '00078',
                'fac_name_th'=> 'คณะวิทยาลัยประชากรศาสตร์'
              ],
              [
                'fac_id'=> '00079',
                'fac_name_th'=> 'คณะวิทยาลัยแพทยศาสตร์'
              ],
              [
                'fac_id'=> '00080',
                'fac_name_th'=> 'คณะวิทยาลัยวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00081',
                'fac_name_th'=> 'คณะวิทยาศาสตร์'
              ],
              [
                'fac_id'=> '01732',
                'fac_name_th'=> 'คณะวิทยาศาสตร์ พลังงานและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '01667',
                'fac_name_th'=> 'คณะวิทยาศาสตร์ ศรีราชา'
              ],
              [
                'fac_id'=> '00524',
                'fac_name_th'=> 'คณะวิทยาศาสตร์การกีฬา'
              ],
              [
                'fac_id'=> '01584',
                'fac_name_th'=> 'คณะวิทยาศาสตร์การกีฬาและสุขภาพ'
              ],
              [
                'fac_id'=> '01042',
                'fac_name_th'=> 'คณะวิทยาศาสตร์การแพทย์'
              ],
              [
                'fac_id'=> '00580',
                'fac_name_th'=> 'คณะวิทยาศาสตร์เทคโนโลยีและการเกษตร'
              ],
              [
                'fac_id'=> '00082',
                'fac_name_th'=> 'คณะวิทยาศาสตร์ประยุกต์'
              ],
              [
                'fac_id'=> '01712',
                'fac_name_th'=> 'คณะวิทยาศาสตร์ประยุกต์และวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00083',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '01736',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และเทคโนโลยีการกีฬา'
              ],
              [
                'fac_id'=> '01063',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และเทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '01108',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และเทคโนโลยีการประมง'
              ],
              [
                'fac_id'=> '00084',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และเทคโนโลยีประมง'
              ],
              [
                'fac_id'=> '01915',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และเทคโนโลยีสุขภาพ'
              ],
              [
                'fac_id'=> '01126',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00242',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00277',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และศิลปศาสตร์'
              ],
              [
                'fac_id'=> '00085',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และสังคมศาสตร์'
              ],
              [
                'fac_id'=> '01673',
                'fac_name_th'=> 'คณะวิทยาศาสตร์และสาธารณสุขศาสตร์'
              ],
              [
                'fac_id'=> '00853',
                'fac_name_th'=> 'คณะวิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '00750',
                'fac_name_th'=> 'คณะวิทยาศาสตร์สุขภาพและพยาบาลศาสตร์'
              ],
              [
                'fac_id'=> '01990',
                'fac_name_th'=> 'คณะวิเทศธุรกิจ'
              ],
              [
                'fac_id'=> '01120',
                'fac_name_th'=> 'คณะวิเทศศึกษา'
              ],
              [
                'fac_id'=> '01834',
                'fac_name_th'=> 'คณะวิศวกรรมชีวการแพทย์'
              ],
              [
                'fac_id'=> '00086',
                'fac_name_th'=> 'คณะวิศวกรรมและเทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '00087',
                'fac_name_th'=> 'คณะวิศวกรรมและอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '00088',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00522',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์ กำแพงแสน'
              ],
              [
                'fac_id'=> '00806',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์และคณะทรัพยากรชีวภาพและเทคโนโลยี'
              ],
              [
                'fac_id'=> '00089',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00090',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์และเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00174',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์และวิทยาการคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00475',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์และสถาปัตยกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00528',
                'fac_name_th'=> 'คณะวิศวกรรมศาสตร์ศรีราชา'
              ],
              [
                'fac_id'=> '00091',
                'fac_name_th'=> 'คณะเวชศาสตร์เขตร้อน'
              ],
              [
                'fac_id'=> '00238',
                'fac_name_th'=> 'คณะศาสนศาสตร์'
              ],
              [
                'fac_id'=> '00092',
                'fac_name_th'=> 'คณะศาสนศาสตร์แมคกิลวารี'
              ],
              [
                'fac_id'=> '00093',
                'fac_name_th'=> 'คณะศาสนศึกษา'
              ],
              [
                'fac_id'=> '00620',
                'fac_name_th'=> 'คณะศาสนาและปรัชญา'
              ],
              [
                'fac_id'=> '00094',
                'fac_name_th'=> 'คณะศิลปกรรม'
              ],
              [
                'fac_id'=> '01065',
                'fac_name_th'=> 'คณะศิลปกรรมและสถาปัตยกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00823',
                'fac_name_th'=> 'คณะศิลปกรรมและออกแบบอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00095',
                'fac_name_th'=> 'คณะศิลปกรรมศาสตร์'
              ],
              [
                'fac_id'=> '02139',
                'fac_name_th'=> 'คณะศิลปกรรมศาสตร์และวัฒนธรรมศาสตร์'
              ],
              [
                'fac_id'=> '01662',
                'fac_name_th'=> 'คณะศิลปนาฏดุริยางค์'
              ],
              [
                'fac_id'=> '00274',
                'fac_name_th'=> 'คณะศิลปประยุกต์และการออกแบบ'
              ],
              [
                'fac_id'=> '01170',
                'fac_name_th'=> 'คณะศิลปวิจิตร'
              ],
              [
                'fac_id'=> '00096',
                'fac_name_th'=> 'คณะศิลปศาสตร์'
              ],
              [
                'fac_id'=> '80006',
                'fac_name_th'=> 'คณะศิลปศาสตร์ วิทยาเขตชลบุรี'
              ],
              [
                'fac_id'=> '00752',
                'fac_name_th'=> 'คณะศิลปศาสตร์ วิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00215',
                'fac_name_th'=> 'คณะศิลปศาสตร์ประยุกต์'
              ],
              [
                'fac_id'=> '00097',
                'fac_name_th'=> 'คณะศิลปศาสตรรัฐประศาสนศาสตร์'
              ],
              [
                'fac_id'=> '00984',
                'fac_name_th'=> 'คณะศิลปศาสตร์และนิเทศศาสตร์'
              ],
              [
                'fac_id'=> '00098',
                'fac_name_th'=> 'คณะศิลปศาสตร์และมนุษยศาสตร์'
              ],
              [
                'fac_id'=> '00243',
                'fac_name_th'=> 'คณะศิลปศาสตร์และวิทยาการจัดการ'
              ],
              [
                'fac_id'=> '00099',
                'fac_name_th'=> 'คณะศิลปศาสตร์และวิทยาศาสตร์'
              ],
              [
                'fac_id'=> '01685',
                'fac_name_th'=> 'คณะศิลปศาสตร์และศึกษาศาสตร์'
              ],
              [
                'fac_id'=> '00861',
                'fac_name_th'=> 'คณะศิลปศาสตร์และสังคมศาสตร์'
              ],
              [
                'fac_id'=> '01171',
                'fac_name_th'=> 'คณะศิลปศึกษา'
              ],
              [
                'fac_id'=> '00994',
                'fac_name_th'=> 'คณะศิลปะและการออกแบบ'
              ],
              [
                'fac_id'=> '02024',
                'fac_name_th'=> 'คณะศิลปะและการออกแบบดิจิทัล'
              ],
              [
                'fac_id'=> '00100',
                'fac_name_th'=> 'คณะศึกษาศาสตร์'
              ],
              [
                'fac_id'=> '00523',
                'fac_name_th'=> 'คณะศึกษาศาสตร์ กำแพงแสน'
              ],
              [
                'fac_id'=> '00798',
                'fac_name_th'=> 'คณะศึกษาศาสตร์และจิตวิทยา'
              ],
              [
                'fac_id'=> '01959',
                'fac_name_th'=> 'คณะศึกษาศาสตร์และนวัตกรรมการศึกษา'
              ],
              [
                'fac_id'=> '00985',
                'fac_name_th'=> 'คณะศึกษาศาสตร์และพัฒนศาสตร์'
              ],
              [
                'fac_id'=> '01742',
                'fac_name_th'=> 'คณะศึกษาศาสตร์และศิลปศาสตร์'
              ],
              [
                'fac_id'=> '00101',
                'fac_name_th'=> 'คณะเศรษฐศาสตร์'
              ],
              [
                'fac_id'=> '01641',
                'fac_name_th'=> 'คณะเศรษฐศาสตร์ ศรีราชา'
              ],
              [
                'fac_id'=> '00102',
                'fac_name_th'=> 'คณะเศรษฐศาสตร์และบริหารธุรกิจ'
              ],
              [
                'fac_id'=> '02141',
                'fac_name_th'=> 'คณะสถาปัตยกรรม ศิลปะและการออกแบบ'
              ],
              [
                'fac_id'=> '00191',
                'fac_name_th'=> 'คณะสถาปัตยกรรมและการออกแบบ'
              ],
              [
                'fac_id'=> '00180',
                'fac_name_th'=> 'คณะสถาปัตยกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00204',
                'fac_name_th'=> 'คณะสถาปัตยกรรมศาสตร์ ผังเมือง และนฤมิตศิลป์'
              ],
              [
                'fac_id'=> '00291',
                'fac_name_th'=> 'คณะสถาปัตยกรรมศาสตร์ ผังเมืองและนฤมิตศิลป์'
              ],
              [
                'fac_id'=> '01070',
                'fac_name_th'=> 'คณะสถาปัตยกรรมศาสตร์และการผังเมือง'
              ],
              [
                'fac_id'=> '00834',
                'fac_name_th'=> 'คณะสถาปัตยกรรมศาสตร์และการออกแบบสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '08001',
                'fac_name_th'=> 'คณะสถาปัตยกรรมศาสตร์และศิลปกรรมศาสตร์ '
              ],
              [
                'fac_id'=> '00103',
                'fac_name_th'=> 'คณะสถิติประยุกต์'
              ],
              [
                'fac_id'=> '01803',
                'fac_name_th'=> 'คณะสหวิทยาการ'
              ],
              [
                'fac_id'=> '01942',
                'fac_name_th'=> 'คณะสหวิทยาการ เทคโนโลยี และนวัตกรรม'
              ],
              [
                'fac_id'=> '00104',
                'fac_name_th'=> 'คณะสหเวชศาสตร์'
              ],
              [
                'fac_id'=> '00105',
                'fac_name_th'=> 'คณะสังคมวิทยาและมนุษยวิทยา'
              ],
              [
                'fac_id'=> '01447',
                'fac_name_th'=> 'คณะสังคมวิทยาและมานุษยวิทยา'
              ],
              [
                'fac_id'=> '00106',
                'fac_name_th'=> 'คณะสังคมศาสตร์'
              ],
              [
                'fac_id'=> '01714',
                'fac_name_th'=> 'คณะสังคมศาสตร์บูรณาการ'
              ],
              [
                'fac_id'=> '00107',
                'fac_name_th'=> 'คณะสังคมศาสตร์และมนุษย์ศาสตร์'
              ],
              [
                'fac_id'=> '00108',
                'fac_name_th'=> 'คณะสังคมศาสตร์และมนุษยศาสตร์'
              ],
              [
                'fac_id'=> '01637',
                'fac_name_th'=> 'คณะสังคมศาสตร์และศิลปศาสตร์'
              ],
              [
                'fac_id'=> '00109',
                'fac_name_th'=> 'คณะสังคมสงเคราะห์ศาสตร์'
              ],
              [
                'fac_id'=> '00110',
                'fac_name_th'=> 'คณะสังคมสงเคราะห์ศาสตร์ และสวัสดิการสังคม'
              ],
              [
                'fac_id'=> '00111',
                'fac_name_th'=> 'คณะสัตวแพทย์ศาสตร์'
              ],
              [
                'fac_id'=> '00112',
                'fac_name_th'=> 'คณะสัตวแพทยศาสตร์'
              ],
              [
                'fac_id'=> '01127',
                'fac_name_th'=> 'คณะสัตวศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00195',
                'fac_name_th'=> 'คณะสัตวศาสตร์และเทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '00113',
                'fac_name_th'=> 'คณะสาธารณสุขศาสตร์'
              ],
              [
                'fac_id'=> '80021',
                'fac_name_th'=> 'คณะสาธารณสุขศาสตร์และเทคโนโลยีสุขภาพ วิทยาลัยนครราชสีมา'
              ],
              [
                'fac_id'=> '02036',
                'fac_name_th'=> 'คณะสาธารณสุขศาสตร์และสหเวชศาสตร์'
              ],
              [
                'fac_id'=> '00114',
                'fac_name_th'=> 'คณะสาธารณสุขศาสตร์และสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00794',
                'fac_name_th'=> 'คณะสารสนเทศและการสื่อสาร'
              ],
              [
                'fac_id'=> '00245',
                'fac_name_th'=> 'คณะสารสนเทศศาสตร์'
              ],
              [
                'fac_id'=> '80020',
                'fac_name_th'=> 'คณะสารสนเทศศาสตร์ วิทยาคารกรุงเทพฯ วิทยาลัยนครราชสีมา'
              ],
              [
                'fac_id'=> '00181',
                'fac_name_th'=> 'คณะสำนักวิชาพยาบาลศาสตร์'
              ],
              [
                'fac_id'=> '01690',
                'fac_name_th'=> 'คณะสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00119',
                'fac_name_th'=> 'คณะสิ่งแวดล้อมและทรัพยากรศาสตร์'
              ],
              [
                'fac_id'=> '01724',
                'fac_name_th'=> 'คณะสื่อสารมวลชน'
              ],
              [
                'fac_id'=> '00120',
                'fac_name_th'=> 'คณะหลักสูตรรัฐประศาสนศาสตร์'
              ],
              [
                'fac_id'=> '00622',
                'fac_name_th'=> 'คณะอตุสาหกรรมสิ่งทอและออกแบบแฟชั่น'
              ],
              [
                'fac_id'=> '00121',
                'fac_name_th'=> 'คณะอักษรศาสตร์'
              ],
              [
                'fac_id'=> '01006',
                'fac_name_th'=> 'คณะอัญมณี'
              ],
              [
                'fac_id'=> '01644',
                'fac_name_th'=> 'คณะอัญมณีศาสตร์และประยุกต์ศิลป์'
              ],
              [
                'fac_id'=> '01964',
                'fac_name_th'=> 'คณะอาชญาวิทยาและการบริหารงานยุติธรรม'
              ],
              [
                'fac_id'=> '00122',
                'fac_name_th'=> 'คณะอิสลามศึกษา'
              ],
              [
                'fac_id'=> '00123',
                'fac_name_th'=> 'คณะอุตสากรรมเกษตร'
              ],
              [
                'fac_id'=> '00124',
                'fac_name_th'=> 'คณะอุตสาหกรรมการท่องเที่ยวและการบริการ'
              ],
              [
                'fac_id'=> '00943',
                'fac_name_th'=> 'คณะอุตสาหกรรมการโรงแรมและการท่องเที่ยว'
              ],
              [
                'fac_id'=> '00202',
                'fac_name_th'=> 'คณะอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '01922',
                'fac_name_th'=> 'คณะอุตสาหกรรมเกษตรและชีวภาพ'
              ],
              [
                'fac_id'=> '00125',
                'fac_name_th'=> 'คณะอุตสาหกรรมบริการ'
              ],
              [
                'fac_id'=> '01854',
                'fac_name_th'=> 'คณะอุตสาหกรรมบริการนานาชาติ'
              ],
              [
                'fac_id'=> '00828',
                'fac_name_th'=> 'คณะอุตสาหกรรมและเทคโนโลยี'
              ],
              [
                'fac_id'=> '01642',
                'fac_name_th'=> 'คณะอุตสาหกรรมสร้างสรรค์'
              ],
              [
                'fac_id'=> '00890',
                'fac_name_th'=> 'คณะอุตสาหกรรมสิ่งทอ'
              ],
              [
                'fac_id'=> '02014',
                'fac_name_th'=> 'คณะอุตสาหกรรมอาหาร'
              ],
              [
                'fac_id'=> '00730',
                'fac_name_th'=> 'โครงการ PBL'
              ],
              [
                'fac_id'=> '00633',
                'fac_name_th'=> 'โครงการการพัฒนาบ้างโป่ง อันเนื่องมาจากพระราชดำริ'
              ],
              [
                'fac_id'=> '00237',
                'fac_name_th'=> 'โครงการขยายโอกาสอุดมศึกษาแห่งจุฬาลงกรณ์มหาวิทยาลัย'
              ],
              [
                'fac_id'=> '00665',
                'fac_name_th'=> 'โครงการของศูนย์เครื่องมือวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00188',
                'fac_name_th'=> 'โครงการคณะอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '01056',
                'fac_name_th'=> 'โครงการความร่วมมือกับกรมส่งเสริมการปกครองท้องถิ่น'
              ],
              [
                'fac_id'=> '00536',
                'fac_name_th'=> 'โครงการความร่วมมือทางวิชาการฯ'
              ],
              [
                'fac_id'=> '01019',
                'fac_name_th'=> 'โครงการจัดการศึกษาหลักสูตรหมวดวิชาศึกษาทั่วไป'
              ],
              [
                'fac_id'=> '99999',
                'fac_name_th'=> 'โครงการจัดตั้งคณะ'
              ],
              [
                'fac_id'=> '00199',
                'fac_name_th'=> 'โครงการจัดตั้งคณะการท่องเที่ยวและการโรงแรม'
              ],
              [
                'fac_id'=> '00880',
                'fac_name_th'=> 'โครงการจัดตั้งคณะการแพทย์แผนไทย'
              ],
              [
                'fac_id'=> '00186',
                'fac_name_th'=> 'โครงการจัดตั้งคณะเทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '00126',
                'fac_name_th'=> 'โครงการจัดตั้งคณะเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '02194',
                'fac_name_th'=> 'โครงการจัดตั้งคณะนวัตกรรมการเกษตรและประมง'
              ],
              [
                'fac_id'=> '00810',
                'fac_name_th'=> 'โครงการจัดตั้งคณะนิติศาสตร์'
              ],
              [
                'fac_id'=> '00898',
                'fac_name_th'=> 'โครงการจัดตั้งคณะพยาบาลศาสตร์'
              ],
              [
                'fac_id'=> '00260',
                'fac_name_th'=> 'โครงการจัดตั้งคณะแพทยศาสตร์'
              ],
              [
                'fac_id'=> '00234',
                'fac_name_th'=> 'โครงการจัดตั้งคณะวิทยาการสุขภาพและการกีฬา'
              ],
              [
                'fac_id'=> '00897',
                'fac_name_th'=> 'โครงการจัดตั้งคณะวิทยาศาสตร์การกีฬา'
              ],
              [
                'fac_id'=> '00185',
                'fac_name_th'=> 'โครงการจัดตั้งคณะศิลปกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00811',
                'fac_name_th'=> 'โครงการจัดตั้งคณะศิลปประยุกต์และการออกแบบ'
              ],
              [
                'fac_id'=> '00987',
                'fac_name_th'=> 'โครงการจัดตั้งคณะสัตวแพทยศาสตร์และสัตวศาสตร์'
              ],
              [
                'fac_id'=> '00901',
                'fac_name_th'=> 'โครงการจัดตั้งคณะสารสนเทศศาสตร์'
              ],
              [
                'fac_id'=> '00876',
                'fac_name_th'=> 'โครงการจัดตั้งคลีนิคแพทย์แผนไทย'
              ],
              [
                'fac_id'=> '00990',
                'fac_name_th'=> 'โครงการจัดตั้งพิพิธภัณฑ์มหาวิทยาลัยมหาสารคาม'
              ],
              [
                'fac_id'=> '00666',
                'fac_name_th'=> 'โครงการจัดตั้งพิพิธภัณฑ์อารยธรรมลุ่มน้ำโขง'
              ],
              [
                'fac_id'=> '00127',
                'fac_name_th'=> 'โครงการจัดตั้งวิชานิติศาสตร์'
              ],
              [
                'fac_id'=> '00208',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาเขตตรัง'
              ],
              [
                'fac_id'=> '01431',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาเขตนครสวรรค์'
              ],
              [
                'fac_id'=> '00207',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาเขตสุราษฎร์ธานี'
              ],
              [
                'fac_id'=> '01442',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาเขตอำนาจเจริญ'
              ],
              [
                'fac_id'=> '00681',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาลัยดนตรีวิทยาชีพ'
              ],
              [
                'fac_id'=> '00988',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาลัยดุริยางคศิลป์'
              ],
              [
                'fac_id'=> '00812',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาลัยแพทยศาสตร์และการสาธารณสุข'
              ],
              [
                'fac_id'=> '02191',
                'fac_name_th'=> 'โครงการจัดตั้งวิทยาลัยศิลปะและวัฒนธรรม'
              ],
              [
                'fac_id'=> '00631',
                'fac_name_th'=> 'โครงการจัดตั้งศูนย์กล้วยไม้และไม้ดอกไม้ประดับ'
              ],
              [
                'fac_id'=> '00667',
                'fac_name_th'=> 'โครงการจัดตั้งศูนย์ความร่วมมือทางวิชาการฝรั่งเศส-อนุภาคลุ่มน้ำโขง'
              ],
              [
                'fac_id'=> '00634',
                'fac_name_th'=> 'โครงการจัดตั้งศูนย์เทคโนโลยีชีวภาพ'
              ],
              [
                'fac_id'=> '00632',
                'fac_name_th'=> 'โครงการจัดตั้งศูนย์เทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00668',
                'fac_name_th'=> 'โครงการจัดตั้งศูนย์ศึกษาการจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00669',
                'fac_name_th'=> 'โครงการจัดตั้งสถาบันชา'
              ],
              [
                'fac_id'=> '00906',
                'fac_name_th'=> 'โครงการจัดตั้งสถาบันวิจัยและพัฒนาผู้มีความสามารถพิเศษและเด็กที่มีความต้องพิเศษแห่งชาติ'
              ],
              [
                'fac_id'=> '00128',
                'fac_name_th'=> 'โครงการจัดตั้งสำนักวิชาการออกแบบ'
              ],
              [
                'fac_id'=> '00680',
                'fac_name_th'=> 'โครงการจัดตั้งสำนักวิทยบริการ'
              ],
              [
                'fac_id'=> '00670',
                'fac_name_th'=> 'โครงการจัดตั้งหลักสูตรปริญญาโทสำนักวิชาเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00200',
                'fac_name_th'=> 'โครงการจัดตั้งหลักสูตรรัฐประศาสนศาสตรมหาบัณฑิต'
              ],
              [
                'fac_id'=> '00991',
                'fac_name_th'=> 'โครงการจัดตั้งอนุรักษ์ใบลานในภาคตะวันออกเฉียงเหนือ'
              ],
              [
                'fac_id'=> '02295',
                'fac_name_th'=> 'โครงการจัดรูปแบบการบริหารวิชาการด้านเทคโนโลยีดิจิทัลรูปใหม่'
              ],
              [
                'fac_id'=> '00706',
                'fac_name_th'=> 'โครงการทวิปริญญาโททางรัฐประศาสนศาสตร์ฯ'
              ],
              [
                'fac_id'=> '00869',
                'fac_name_th'=> 'โครงการทักษะวิศวเคมี CHEPS'
              ],
              [
                'fac_id'=> '00871',
                'fac_name_th'=> 'โครงการที่ปรึกษาตรวจสอบ'
              ],
              [
                'fac_id'=> '00726',
                'fac_name_th'=> 'โครงการเทคโนโลยีสารสนเทศและการสื่อสาร'
              ],
              [
                'fac_id'=> '00870',
                'fac_name_th'=> 'โครงการบริหารก่อสร้าง'
              ],
              [
                'fac_id'=> '00592',
                'fac_name_th'=> 'โครงการบัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00129',
                'fac_name_th'=> 'โครงการบัณฑิตศึกษาการพัฒนาทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '00130',
                'fac_name_th'=> 'โครงการบัณฑิตศึกษาเทคโนโลยีการบริหาร สำนักฝึกอบรม'
              ],
              [
                'fac_id'=> '00851',
                'fac_name_th'=> 'โครงการปรัชญาดุษฎีบัณฑิตการบริหารการพัฒนา'
              ],
              [
                'fac_id'=> '00705',
                'fac_name_th'=> 'โครงการปรัชญาดุษฎีบัณฑิตทางสังคมศาสตร์'
              ],
              [
                'fac_id'=> '00386',
                'fac_name_th'=> 'โครงการผนึกกำลังปริญญาเอก'
              ],
              [
                'fac_id'=> '00877',
                'fac_name_th'=> 'โครงการพัฒนาครูเพื่อยกระดับคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00630',
                'fac_name_th'=> 'โครงการพัฒนาระบบงบประมาณฯ ลักษณะ 3 มิติ'
              ],
              [
                'fac_id'=> '00731',
                'fac_name_th'=> 'โครงการพัฒนาระบบสุขภาพ'
              ],
              [
                'fac_id'=> '00703',
                'fac_name_th'=> 'โครงการพิเศษ'
              ],
              [
                'fac_id'=> '00704',
                'fac_name_th'=> 'โครงการพิเศษและความร่วมมือ'
              ],
              [
                'fac_id'=> '00852',
                'fac_name_th'=> 'โครงการภาษาศาสตร์'
              ],
              [
                'fac_id'=> '00723',
                'fac_name_th'=> 'โครงการร่วมระหว่างคณะ'
              ],
              [
                'fac_id'=> '00875',
                'fac_name_th'=> 'โครงการโรงงานเครื่องสำอางต้นแบบ'
              ],
              [
                'fac_id'=> '00131',
                'fac_name_th'=> 'โครงการวิทยาลัยการจัดการ'
              ],
              [
                'fac_id'=> '00579',
                'fac_name_th'=> 'โครงการวิทยาลัยนานาชาติ'
              ],
              [
                'fac_id'=> '00922',
                'fac_name_th'=> 'โครงการวิทยาลัยวิทยาการสุขภาพ'
              ],
              [
                'fac_id'=> '01850',
                'fac_name_th'=> 'โครงการศึกษาศาสตร์'
              ],
              [
                'fac_id'=> '00732',
                'fac_name_th'=> 'โครงการศูนย์กีฬาและสุขภาพ'
              ],
              [
                'fac_id'=> '00920',
                'fac_name_th'=> 'โครงการศูนย์บริการสุขภาพทางเทคนิคการแพทย์'
              ],
              [
                'fac_id'=> '00733',
                'fac_name_th'=> 'โครงการศูนย์พัฒนาเด็กปฐมวัย'
              ],
              [
                'fac_id'=> '00874',
                'fac_name_th'=> 'โครงการศูนย์ภาษาอังกฤษ'
              ],
              [
                'fac_id'=> '00921',
                'fac_name_th'=> 'โครงการศูนย์หนังสือ มหาวิทยาลัยวลัยลักษณ์'
              ],
              [
                'fac_id'=> '01017',
                'fac_name_th'=> 'โครงการสวนพฤกษศาสตร์ มหาวิทยาลัยแม่ฟ้าหลวง เฉลิมพระเกียรติ 80 พรรษามหาราชา'
              ],
              [
                'fac_id'=> '00734',
                'fac_name_th'=> 'โครงการสหกิจศึกษาและพัฒนาอาชีพ'
              ],
              [
                'fac_id'=> '00873',
                'fac_name_th'=> 'โครงการหลักสูตรรัฐประศาสนศาสตร์'
              ],
              [
                'fac_id'=> '00540',
                'fac_name_th'=> 'โครงการอนุรักษ์และขยายพันธุ์พืชหายากฯ'
              ],
              [
                'fac_id'=> '00735',
                'fac_name_th'=> 'โครงการอาศรมวัฒนธรรม'
              ],
              [
                'fac_id'=> '00736',
                'fac_name_th'=> 'โครงการอุทยานการศึกษาเฉลิมพระเกียรติ'
              ],
              [
                'fac_id'=> '00398',
                'fac_name_th'=> 'งานการเงิน'
              ],
              [
                'fac_id'=> '00292',
                'fac_name_th'=> 'งานการประชุม'
              ],
              [
                'fac_id'=> '00498',
                'fac_name_th'=> 'งานจัดหารายได้'
              ],
              [
                'fac_id'=> '01021',
                'fac_name_th'=> 'งานชุดที่พักอาศัยบุคลากร'
              ],
              [
                'fac_id'=> '00499',
                'fac_name_th'=> 'งานตรวจสอบภายใน'
              ],
              [
                'fac_id'=> '00500',
                'fac_name_th'=> 'งานประกันคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00293',
                'fac_name_th'=> 'งานประชาสัมพันธ์'
              ],
              [
                'fac_id'=> '00399',
                'fac_name_th'=> 'งานพัสดุ'
              ],
              [
                'fac_id'=> '00334',
                'fac_name_th'=> 'งานยานพาหนะ'
              ],
              [
                'fac_id'=> '00294',
                'fac_name_th'=> 'งานยานยนต์'
              ],
              [
                'fac_id'=> '00295',
                'fac_name_th'=> 'งานรักษาความปลอดภัย'
              ],
              [
                'fac_id'=> '00302',
                'fac_name_th'=> 'งานเลขานุการ'
              ],
              [
                'fac_id'=> '00296',
                'fac_name_th'=> 'งานวางผังแม่บท'
              ],
              [
                'fac_id'=> '00297',
                'fac_name_th'=> 'งานวิจัยและบริการวิชาการ'
              ],
              [
                'fac_id'=> '00298',
                'fac_name_th'=> 'งานวิเทศสัมพันธ์'
              ],
              [
                'fac_id'=> '00299',
                'fac_name_th'=> 'งานศิลปวัฒนธรรมและกิจการพิเศษ'
              ],
              [
                'fac_id'=> '00895',
                'fac_name_th'=> 'งานส่งเสริมการวิจัย'
              ],
              [
                'fac_id'=> '00300',
                'fac_name_th'=> 'งานสภาคณาจารย์'
              ],
              [
                'fac_id'=> '00301',
                'fac_name_th'=> 'งานสารบรรณ'
              ],
              [
                'fac_id'=> '00925',
                'fac_name_th'=> 'งานอาคารสถานที่'
              ],
              [
                'fac_id'=> '00674',
                'fac_name_th'=> 'งานอาคารสถานที่และยานพาหนะ'
              ],
              [
                'fac_id'=> '00407',
                'fac_name_th'=> 'เจ้าหน้าที่ห้องสมุด'
              ],
              [
                'fac_id'=> '00832',
                'fac_name_th'=> 'ชมรมพฤทธาจารย์'
              ],
              [
                'fac_id'=> '01564',
                'fac_name_th'=> 'ดิจิทัลอาร์ต'
              ],
              [
                'fac_id'=> '00400',
                'fac_name_th'=> 'ทะเบียนและวัดผลการศึกษา'
              ],
              [
                'fac_id'=> '00803',
                'fac_name_th'=> 'เทคโนธานี'
              ],
              [
                'fac_id'=> '00406',
                'fac_name_th'=> 'เทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '00401',
                'fac_name_th'=> 'ธุรการ'
              ],
              [
                'fac_id'=> '00193',
                'fac_name_th'=> 'บัณฑิตวิทยาการจัดการและนวัตกรรม'
              ],
              [
                'fac_id'=> '00194',
                'fac_name_th'=> 'บัณฑิตวิทยาร่วมด้านพลังงานและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00132',
                'fac_name_th'=> 'บัณฑิตวิทยาลัย'
              ],
              [
                'fac_id'=> '80007',
                'fac_name_th'=> 'บัณฑิตวิทยาลัย วิทยาเขตชลบุรี'
              ],
              [
                'fac_id'=> '00303',
                'fac_name_th'=> 'บัณฑิตวิทยาลัย สาขาความหลากหลายทางชีวภาพ'
              ],
              [
                'fac_id'=> '00304',
                'fac_name_th'=> 'บัณฑิตวิทยาลัย สาขาวัฒนธรรมศาสตร์'
              ],
              [
                'fac_id'=> '00710',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยการจัดการและนวัตกรรม'
              ],
              [
                'fac_id'=> '01000',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยการศึกษาทางอิเล็กทรอนิกส์'
              ],
              [
                'fac_id'=> '00997',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00996',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยบริหารธุรกิจ'
              ],
              [
                'fac_id'=> '01001',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยภาษาอังกฤษ'
              ],
              [
                'fac_id'=> '01655',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยร่วมด้านพลังงานและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00280',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยและการศึกษานานาชาติ'
              ],
              [
                'fac_id'=> '00269',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยวิศวกรรมศาสตร์นานาชาติสิรินธรไทย-เยอรมัน'
              ],
              [
                'fac_id'=> '01764',
                'fac_name_th'=> 'บัณฑิตวิทยาลัยสหวิทยาการวิทยาศาสตร์ระบบโลกและการจัดการภัยธรรมชาติอันดามัน'
              ],
              [
                'fac_id'=> '00133',
                'fac_name_th'=> 'บัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00529',
                'fac_name_th'=> 'บัณฑิตศึกษาสถาน วิทยาเขตศรีราชา'
              ],
              [
                'fac_id'=> '00758',
                'fac_name_th'=> 'แผนกการตลาด'
              ],
              [
                'fac_id'=> '00759',
                'fac_name_th'=> 'แผนกการบริหาร'
              ],
              [
                'fac_id'=> '00693',
                'fac_name_th'=> 'แผนกคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00690',
                'fac_name_th'=> 'แผนกซ่อมบำรุง'
              ],
              [
                'fac_id'=> '00692',
                'fac_name_th'=> 'แผนกต้อนรับ'
              ],
              [
                'fac_id'=> '00973',
                'fac_name_th'=> 'แผนกนิติการ'
              ],
              [
                'fac_id'=> '00694',
                'fac_name_th'=> 'แผนกยานพาหนะและจัดซื้อ'
              ],
              [
                'fac_id'=> '00691',
                'fac_name_th'=> 'แผนกโสตทัศนศึกษา'
              ],
              [
                'fac_id'=> '00975',
                'fac_name_th'=> 'ฝ่ายการคลัง'
              ],
              [
                'fac_id'=> '00402',
                'fac_name_th'=> 'ฝ่ายการเงิน'
              ],
              [
                'fac_id'=> '00763',
                'fac_name_th'=> 'ฝ่ายการเงินและการบัญชี'
              ],
              [
                'fac_id'=> '00686',
                'fac_name_th'=> 'ฝ่ายการตลาดและพัฒนา'
              ],
              [
                'fac_id'=> '00968',
                'fac_name_th'=> 'ฝ่ายกิจการต่างประเทศ'
              ],
              [
                'fac_id'=> '00471',
                'fac_name_th'=> 'ฝ่ายกิจการนักศึกษา'
              ],
              [
                'fac_id'=> '00764',
                'fac_name_th'=> 'ฝ่ายควบคุมพัสดุ'
              ],
              [
                'fac_id'=> '00765',
                'fac_name_th'=> 'ฝ่ายจัดซื้อ-จัดจ้าง'
              ],
              [
                'fac_id'=> '00977',
                'fac_name_th'=> 'ฝ่ายจัดหาและบริหารทรัพย์สิน'
              ],
              [
                'fac_id'=> '00766',
                'fac_name_th'=> 'ฝ่ายช่างและซ่อมบำรุง'
              ],
              [
                'fac_id'=> '00767',
                'fac_name_th'=> 'ฝ่ายทรัพยากรบุคคล'
              ],
              [
                'fac_id'=> '00688',
                'fac_name_th'=> 'ฝ่ายทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '00768',
                'fac_name_th'=> 'ฝ่ายทะเบียนและประมวลผล'
              ],
              [
                'fac_id'=> '00769',
                'fac_name_th'=> 'ฝ่ายทุนการศึกษา'
              ],
              [
                'fac_id'=> '00770',
                'fac_name_th'=> 'ฝ่ายทุนการศึกษาคณาจารย์'
              ],
              [
                'fac_id'=> '00335',
                'fac_name_th'=> 'ฝ่ายเทคโนโลยีทางการศึกษา'
              ],
              [
                'fac_id'=> '00501',
                'fac_name_th'=> 'ฝ่ายเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00409',
                'fac_name_th'=> 'ฝ่ายแนะแนวสนเทศและบริการอาชีพ'
              ],
              [
                'fac_id'=> '00978',
                'fac_name_th'=> 'ฝ่ายบริการการศึกษาและสวัสดิการ'
              ],
              [
                'fac_id'=> '00916',
                'fac_name_th'=> 'ฝ่ายบริการวิชาการ'
              ],
              [
                'fac_id'=> '00469',
                'fac_name_th'=> 'ฝ่ายบริหาร'
              ],
              [
                'fac_id'=> '00771',
                'fac_name_th'=> 'ฝ่ายบริหารการศึกษาภาคค่ำ'
              ],
              [
                'fac_id'=> '00502',
                'fac_name_th'=> 'ฝ่ายบริหารและธุรกิจ'
              ],
              [
                'fac_id'=> '00772',
                'fac_name_th'=> 'ฝ่ายบริหารสินทรัพย์'
              ],
              [
                'fac_id'=> '00773',
                'fac_name_th'=> 'ฝ่ายบริหารสื่อสารการตลาด'
              ],
              [
                'fac_id'=> '00969',
                'fac_name_th'=> 'ฝ่ายบุคลากร'
              ],
              [
                'fac_id'=> '00305',
                'fac_name_th'=> 'ฝ่ายประกันคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00965',
                'fac_name_th'=> 'ฝ่ายประชาสัมพันธ์'
              ],
              [
                'fac_id'=> '00762',
                'fac_name_th'=> 'ฝ่ายแผนงาน'
              ],
              [
                'fac_id'=> '00307',
                'fac_name_th'=> 'ฝ่ายพัฒนาเขตพื้นที่'
              ],
              [
                'fac_id'=> '00306',
                'fac_name_th'=> 'ฝ่ายพัฒนาคุณภาพการบริการ'
              ],
              [
                'fac_id'=> '00774',
                'fac_name_th'=> 'ฝ่ายพัฒนาทางด้านกายภาพ'
              ],
              [
                'fac_id'=> '00589',
                'fac_name_th'=> 'ฝ่ายพัสดุ'
              ],
              [
                'fac_id'=> '00970',
                'fac_name_th'=> 'ฝ่ายภูมิทัศน์'
              ],
              [
                'fac_id'=> '00775',
                'fac_name_th'=> 'ฝ่ายระบบสารสนเทศเพื่อการบริหารและกลยุทธ์'
              ],
              [
                'fac_id'=> '00980',
                'fac_name_th'=> 'ฝ่ายรับสมัครนักศึกษา'
              ],
              [
                'fac_id'=> '00503',
                'fac_name_th'=> 'ฝ่ายวางแผนและพัฒนา'
              ],
              [
                'fac_id'=> '00953',
                'fac_name_th'=> 'ฝ่ายวิเคราะห์และพัฒนาระบบ'
              ],
              [
                'fac_id'=> '01031',
                'fac_name_th'=> 'ฝ่ายวิจัย'
              ],
              [
                'fac_id'=> '00470',
                'fac_name_th'=> 'ฝ่ายวิชาการ'
              ],
              [
                'fac_id'=> '00857',
                'fac_name_th'=> 'ฝ่ายวิชาการและกิจการนักศึกษา'
              ],
              [
                'fac_id'=> '00599',
                'fac_name_th'=> 'ฝ่ายวิเทศและประชาสัมพันธ์'
              ],
              [
                'fac_id'=> '00776',
                'fac_name_th'=> 'ฝ่ายวิเทศสัมพันธ์'
              ],
              [
                'fac_id'=> '00976',
                'fac_name_th'=> 'ฝ่ายอาคารสถานที่'
              ],
              [
                'fac_id'=> '00777',
                'fac_name_th'=> 'ฝ่ายอาคารสถานที่และยานพาหนะ'
              ],
              [
                'fac_id'=> '00778',
                'fac_name_th'=> 'ฝ่ายอำนวยการกลาง'
              ],
              [
                'fac_id'=> '00974',
                'fac_name_th'=> 'พิพิธภัณฑสถานเครื่องถ้วยเอเชียตะวันออกเฉียงใต้'
              ],
              [
                'fac_id'=> '01697',
                'fac_name_th'=> 'พุทธวิชชาลัย'
              ],
              [
                'fac_id'=> '00737',
                'fac_name_th'=> 'ฟาร์มมหาวิทยาลัย'
              ],
              [
                'fac_id'=> '80026',
                'fac_name_th'=> 'มจร. วิทยาลัยสงฆ์นครน่าน'
              ],
              [
                'fac_id'=> '01643',
                'fac_name_th'=> 'มหาปชาบดีเถรีวิทยาลัย'
              ],
              [
                'fac_id'=> '18504',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตขอนแก่น'
              ],
              [
                'fac_id'=> '18503',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตเชียงใหม่'
              ],
              [
                'fac_id'=> '18505',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตนครราชสีมา'
              ],
              [
                'fac_id'=> '18502',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตนครศรีธรรมราช'
              ],
              [
                'fac_id'=> '18510',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตบาฬีศึกษาพุทธโฆส นครปฐม'
              ],
              [
                'fac_id'=> '18509',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตพะเยา'
              ],
              [
                'fac_id'=> '18507',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตแพร่'
              ],
              [
                'fac_id'=> '18508',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตสุรินทร์'
              ],
              [
                'fac_id'=> '18501',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตหนองคาย'
              ],
              [
                'fac_id'=> '18506',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาเขตอุบลราชธานี'
              ],
              [
                'fac_id'=> '18512',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์นครพนม'
              ],
              [
                'fac_id'=> '18515',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์นครสวรรค์'
              ],
              [
                'fac_id'=> '18518',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์บุรีรัมย์'
              ],
              [
                'fac_id'=> '18519',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์ปัตตานี'
              ],
              [
                'fac_id'=> '18527',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์พิจิตร'
              ],
              [
                'fac_id'=> '18516',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์พุทธชินราช'
              ],
              [
                'fac_id'=> '18514',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์ลำพูน'
              ],
              [
                'fac_id'=> '18513',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์เลย'
              ],
              [
                'fac_id'=> '18528',
                'fac_name_th'=> 'มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย วิทยาลัยสงฆ์สุพรรณบุรีศรีสุวรรณภูมิ'
              ],
              [
                'fac_id'=> '18601',
                'fac_name_th'=> 'มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตมหาวชิราลงกรณราชวิทยาลัย'
              ],
              [
                'fac_id'=> '18602',
                'fac_name_th'=> 'มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตร้อยเอ็ด'
              ],
              [
                'fac_id'=> '18603',
                'fac_name_th'=> 'มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตล้านนา'
              ],
              [
                'fac_id'=> '18604',
                'fac_name_th'=> 'มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตศรีธรรมาโศกราช'
              ],
              [
                'fac_id'=> '18605',
                'fac_name_th'=> 'มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตศรีล้านช้าง'
              ],
              [
                'fac_id'=> '18606',
                'fac_name_th'=> 'มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตสิรินธรราชวิทยาลัย'
              ],
              [
                'fac_id'=> '18607',
                'fac_name_th'=> 'มหาวิทยาลัยมหามกุฏราชวิทยาลัย วิทยาเขตอีสาน'
              ],
              [
                'fac_id'=> '00213',
                'fac_name_th'=> 'มหาวิทยาลัยมหิดล กาญจนบุรี'
              ],
              [
                'fac_id'=> '00268',
                'fac_name_th'=> 'มหาวิทยาลัยมหิดล นครสวรรค์'
              ],
              [
                'fac_id'=> '01302',
                'fac_name_th'=> 'มหาวิทยาลัยแม่โจ้ - ชุมพร'
              ],
              [
                'fac_id'=> '01301',
                'fac_name_th'=> 'มหาวิทยาลัยแม่โจ้ - แพร่ เฉลิมพระเกียรติ'
              ],
              [
                'fac_id'=> '01116',
                'fac_name_th'=> 'มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตปัตตานี'
              ],
              [
                'fac_id'=> '01802',
                'fac_name_th'=> 'มหาวิทยาลัยอุบลราชธานี วิทยาเขตมุกดาหาร'
              ],
              [
                'fac_id'=> '01011',
                'fac_name_th'=> 'มูลนิธิโครงการหลวง'
              ],
              [
                'fac_id'=> '01012',
                'fac_name_th'=> 'มูลนิธิมหาวิทยาลัยเกษตรศาสตร์'
              ],
              [
                'fac_id'=> '00881',
                'fac_name_th'=> 'ร้านสหกรณ์ มจธ.จำกัด (ร้านค้า)'
              ],
              [
                'fac_id'=> '01014',
                'fac_name_th'=> 'ร้านสหกรณ์มหาวิทยาลัยเกษตรศาสตร์ จำกัด'
              ],
              [
                'fac_id'=> '01066',
                'fac_name_th'=> 'โรงพยาบาลธรรมศาสตร์เฉลิมพระเกียรติ'
              ],
              [
                'fac_id'=> '00760',
                'fac_name_th'=> 'โรงพิมพ์มหาวิทยาลัยธุรกิจบัณฑิตย์'
              ],
              [
                'fac_id'=> '01034',
                'fac_name_th'=> 'โรงพิมพ์มหาวิทยาลัยมหาสารคาม'
              ],
              [
                'fac_id'=> '01906',
                'fac_name_th'=> 'โรงเรียนกฎหมายและการเมือง'
              ],
              [
                'fac_id'=> '01639',
                'fac_name_th'=> 'โรงเรียนการท่องเที่ยวและการบริการ'
              ],
              [
                'fac_id'=> '01638',
                'fac_name_th'=> 'โรงเรียนการเรือน'
              ],
              [
                'fac_id'=> '00882',
                'fac_name_th'=> 'โรงเรียนดรุณสิขาลัย'
              ],
              [
                'fac_id'=> '00989',
                'fac_name_th'=> 'โรงเรียนประถมสาธิต'
              ],
              [
                'fac_id'=> '00387',
                'fac_name_th'=> 'โรงเรียนมัธยมสาธิตฯ'
              ],
              [
                'fac_id'=> '01077',
                'fac_name_th'=> 'โรงเรียนสาธิตปทุมวัน'
              ],
              [
                'fac_id'=> '00416',
                'fac_name_th'=> 'โรงเรียนสาธิตมหาวิทยาลัยราชภัฎ'
              ],
              [
                'fac_id'=> '00793',
                'fac_name_th'=> 'โรงเรียนสาธิตอนุบาลละอออุทิศ'
              ],
              [
                'fac_id'=> '00913',
                'fac_name_th'=> 'โรงเรียนสาธิตฯ (ฝ่ายประถม)'
              ],
              [
                'fac_id'=> '00914',
                'fac_name_th'=> 'โรงเรียนสาธิตฯ (ฝ่ายมัธยม)'
              ],
              [
                'fac_id'=> '00558',
                'fac_name_th'=> 'โรงเรียนอนุบาลราชภัฏเชียงราย'
              ],
              [
                'fac_id'=> '00403',
                'fac_name_th'=> 'วางแผนและพัฒนา'
              ],
              [
                'fac_id'=> '00251',
                'fac_name_th'=> 'วิทยาการจัดการและสารสนเทศศาสตร์'
              ],
              [
                'fac_id'=> '00962',
                'fac_name_th'=> 'วิทยาการและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '01191',
                'fac_name_th'=> 'วิทยาเขตกาญจนบุรี'
              ],
              [
                'fac_id'=> '00187',
                'fac_name_th'=> 'วิทยาเขตชุมพร'
              ],
              [
                'fac_id'=> '00308',
                'fac_name_th'=> 'วิทยาเขตนครพนม จังหวัดนครพนม'
              ],
              [
                'fac_id'=> '00577',
                'fac_name_th'=> 'วิทยาเขตปทุมธานี'
              ],
              [
                'fac_id'=> '00216',
                'fac_name_th'=> 'วิทยาเขตแพร่'
              ],
              [
                'fac_id'=> '00652',
                'fac_name_th'=> 'วิทยาเขตสะลวงขี้เหล็ก'
              ],
              [
                'fac_id'=> '00227',
                'fac_name_th'=> 'วิทยาเขตสารสนเทศนครพนม'
              ],
              [
                'fac_id'=> '00249',
                'fac_name_th'=> 'วิทยาเขตสารสนเทศพะเยา'
              ],
              [
                'fac_id'=> '00184',
                'fac_name_th'=> 'วิทยาเขตหนองคาย'
              ],
              [
                'fac_id'=> '80019',
                'fac_name_th'=> 'วิทยาคารกรุงเทพฯ วิทยาลัยนครราชสีมา'
              ],
              [
                'fac_id'=> '80012',
                'fac_name_th'=> 'วิทยาคารนานาชาติหนองคาย'
              ],
              [
                'fac_id'=> '80008',
                'fac_name_th'=> 'วิทยาลัยกฎหมายและการปกครอง'
              ],
              [
                'fac_id'=> '00279',
                'fac_name_th'=> 'วิทยาลัยการขนส่งและโลจิสติกส์'
              ],
              [
                'fac_id'=> '01885',
                'fac_name_th'=> 'วิทยาลัยการคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00611',
                'fac_name_th'=> 'วิทยาลัยการจัดการ'
              ],
              [
                'fac_id'=> '01773',
                'fac_name_th'=> 'วิทยาลัยการจัดการเพื่อการพัฒนา'
              ],
              [
                'fac_id'=> ' 01914',
                'fac_name_th'=> 'วิทยาลัยการจัดการและพัฒนาท้องถิ่น'
              ],
              [
                'fac_id'=> '00727',
                'fac_name_th'=> 'วิทยาลัยการชลประทาน'
              ],
              [
                'fac_id'=> '01790',
                'fac_name_th'=> 'วิทยาลัยการดนตรี'
              ],
              [
                'fac_id'=> '01796',
                'fac_name_th'=> 'วิทยาลัยการท่องเที่ยวนานาชาติ'
              ],
              [
                'fac_id'=> '01721',
                'fac_name_th'=> 'วิทยาลัยการท่องเที่ยวและการบริการ'
              ],
              [
                'fac_id'=> '01025',
                'fac_name_th'=> 'วิทยาลัยการท่องเที่ยวและอุตสาหกรรมบริการ'
              ],
              [
                'fac_id'=> '00256',
                'fac_name_th'=> 'วิทยาลัยการบริหารรัฐกิจ'
              ],
              [
                'fac_id'=> '01024',
                'fac_name_th'=> 'วิทยาลัยการบินนานาชาติ'
              ],
              [
                'fac_id'=> '01801',
                'fac_name_th'=> 'วิทยาลัยการบินและคมนาคม'
              ],
              [
                'fac_id'=> '00956',
                'fac_name_th'=> 'วิทยาลัยการปกครองท้องถิ่น'
              ],
              [
                'fac_id'=> '00472',
                'fac_name_th'=> 'วิทยาลัยการฝึกหัดครู'
              ],
              [
                'fac_id'=> '02012',
                'fac_name_th'=> 'วิทยาลัยการพยาบาล'
              ],
              [
                'fac_id'=> '01818',
                'fac_name_th'=> 'วิทยาลัยการพัฒนาและฝึกอบรมด้านการบิน'
              ],
              [
                'fac_id'=> '00257',
                'fac_name_th'=> 'วิทยาลัยการพาณิชยนาวี'
              ],
              [
                'fac_id'=> '01816',
                'fac_name_th'=> 'วิทยาลัยการแพทย์บูรณาการ'
              ],
              [
                'fac_id'=> '01799',
                'fac_name_th'=> 'วิทยาลัยการแพทย์แผนตะวันออก'
              ],
              [
                'fac_id'=> '01060',
                'fac_name_th'=> 'วิทยาลัยการแพทย์แผนไทย'
              ],
              [
                'fac_id'=> '00596',
                'fac_name_th'=> 'วิทยาลัยการแพทย์แผนไทย อภัยภูเบศ'
              ],
              [
                'fac_id'=> '00915',
                'fac_name_th'=> 'วิทยาลัยการแพทย์แผนไทย อภัยภูเบศร'
              ],
              [
                'fac_id'=> '00541',
                'fac_name_th'=> 'วิทยาลัยการแพทย์พื้นบ้านและการแพทย์ทางเลือก'
              ],
              [
                'fac_id'=> '01679',
                'fac_name_th'=> 'วิทยาลัยการภาพยนตร์ ศิลปะการแสดง และสื่อใหม่'
              ],
              [
                'fac_id'=> '00219',
                'fac_name_th'=> 'วิทยาลัยการเมืองการปกครอง'
              ],
              [
                'fac_id'=> '01109',
                'fac_name_th'=> 'วิทยาลัยการโรงแรมและการท่องเที่ยว'
              ],
              [
                'fac_id'=> '01090',
                'fac_name_th'=> 'วิทยาลัยการศึกษา'
              ],
              [
                'fac_id'=> '01605',
                'fac_name_th'=> 'วิทยาลัยการศึกษาต่อเนื่อง'
              ],
              [
                'fac_id'=> '08003',
                'fac_name_th'=> 'วิทยาลัยการศึกษาต่อเนื่อง'
              ],
              [
                'fac_id'=> '02059',
                'fac_name_th'=> 'วิทยาลัยการศึกษาและการจัดการทางทะเล'
              ],
              [
                'fac_id'=> '00134',
                'fac_name_th'=> 'วิทยาลัยการสาธารณะสุข'
              ],
              [
                'fac_id'=> '01934',
                'fac_name_th'=> 'วิทยาลัยการออกแบบ'
              ],
              [
                'fac_id'=> '00450',
                'fac_name_th'=> 'วิทยาลัยการอาชีพตากใบ'
              ],
              [
                'fac_id'=> '00564',
                'fac_name_th'=> 'วิทยาลัยการอาชีพนาหว้า'
              ],
              [
                'fac_id'=> '00562',
                'fac_name_th'=> 'วิทยาลัยเกษตรและเทคโนโลยี'
              ],
              [
                'fac_id'=> '00451',
                'fac_name_th'=> 'วิทยาลัยเกษตรและเทคโนโลยีนราธิวาส'
              ],
              [
                'fac_id'=> '01822',
                'fac_name_th'=> 'วิทยาลัยครีเอทีฟดีไซน์ แอนด์ เอ็นเตอร์เทนเมนต์เทคโนโลยี'
              ],
              [
                'fac_id'=> '01936',
                'fac_name_th'=> 'วิทยาลัยครูสุริยเทพ'
              ],
              [
                'fac_id'=> '01845',
                'fac_name_th'=> 'วิทยาลัยจัดการระบบสุขภาพ'
              ],
              [
                'fac_id'=> '01009',
                'fac_name_th'=> 'วิทยาลัยชัยบาดาพิพัฒน์'
              ],
              [
                'fac_id'=> '01172',
                'fac_name_th'=> 'วิทยาลัยช่างศิลป'
              ],
              [
                'fac_id'=> '01180',
                'fac_name_th'=> 'วิทยาลัยช่างศิลปนครศรีธรรมราช'
              ],
              [
                'fac_id'=> '01173',
                'fac_name_th'=> 'วิทยาลัยช่างศิลปสุพรรณบุรี'
              ],
              [
                'fac_id'=> '00206',
                'fac_name_th'=> 'วิทยาลัยชุมชนภูเก็ต'
              ],
              [
                'fac_id'=> '01770',
                'fac_name_th'=> 'วิทยาลัยชุมชนเมืองแห่งกรุงเทพมหานคร'
              ],
              [
                'fac_id'=> '01122',
                'fac_name_th'=> 'วิทยาลัยชุมชนสุราษฎ์ธานี'
              ],
              [
                'fac_id'=> '01103',
                'fac_name_th'=> 'วิทยาลัยดุริยศิลป์'
              ],
              [
                'fac_id'=> '00266',
                'fac_name_th'=> 'วิทยาลัยดุริยางคศิลป์'
              ],
              [
                'fac_id'=> '00135',
                'fac_name_th'=> 'วิทยาลัยดุริยางศิลป์'
              ],
              [
                'fac_id'=> '01926',
                'fac_name_th'=> 'วิทยาลัยทันตแพทยศาสตร์'
              ],
              [
                'fac_id'=> '01881',
                'fac_name_th'=> 'วิทยาลัยทันตแพทยศาสตร์นานาชาติ'
              ],
              [
                'fac_id'=> '00563',
                'fac_name_th'=> 'วิทยาลัยเทคนิค'
              ],
              [
                'fac_id'=> '00239',
                'fac_name_th'=> 'วิทยาลัยเทคนิคการสัตวแพทย์'
              ],
              [
                'fac_id'=> '00449',
                'fac_name_th'=> 'วิทยาลัยเทคนิคนราธิวาส'
              ],
              [
                'fac_id'=> '02143',
                'fac_name_th'=> 'วิทยาลัยเทคโนโลยีและนวัตกรรมวัสดุ'
              ],
              [
                'fac_id'=> '01104',
                'fac_name_th'=> 'วิทยาลัยเทคโนโลยีและสหวิทยาการ'
              ],
              [
                'fac_id'=> '01092',
                'fac_name_th'=> 'วิทยาลัยเทคโนโลยีสารสนเทศและการสื่อสาร'
              ],
              [
                'fac_id'=> '00214',
                'fac_name_th'=> 'วิทยาลัยเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '01110',
                'fac_name_th'=> 'วิทยาลัยเทคโนโลยีอุตสาหกรรมและการจัดการ'
              ],
              [
                'fac_id'=> '01586',
                'fac_name_th'=> 'วิทยาลัยเทคโนโลยีอุตสาหกรรมศรีสงคราม'
              ],
              [
                'fac_id'=> '00565',
                'fac_name_th'=> 'วิทยาลัยธาตุพนม'
              ],
              [
                'fac_id'=> '01448',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรม'
              ],
              [
                'fac_id'=> '01032',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมการจัดการ'
              ],
              [
                'fac_id'=> '01288',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมการจัดการข้อมูล'
              ],
              [
                'fac_id'=> '01793',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมการผลิตขั้นสูง'
              ],
              [
                'fac_id'=> '01836',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมเกษตร เทคโนโลยีชีวภาพ และอาหาร'
              ],
              [
                'fac_id'=> '02201',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมเกษตรและเทคโนโลยีอาหาร'
              ],
              [
                'fac_id'=> '01817',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมด้านเทคโนโลยีและวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '02202',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมดิจิทัลเทคโนโลยี'
              ],
              [
                'fac_id'=> '01932',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมดิจิทัลและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00833',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมสื่อสารสังคม'
              ],
              [
                'fac_id'=> '00136',
                'fac_name_th'=> 'วิทยาลัยนวัตกรรมอุดมศึกษา'
              ],
              [
                'fac_id'=> '01174',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลป'
              ],
              [
                'fac_id'=> '01175',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปกาฬสินธุ์'
              ],
              [
                'fac_id'=> '01176',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปจันทบุรี'
              ],
              [
                'fac_id'=> '01177',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปเชียงใหม่'
              ],
              [
                'fac_id'=> '01178',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปนครราชสีมา'
              ],
              [
                'fac_id'=> '01179',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปนครศรีธรรมราช'
              ],
              [
                'fac_id'=> '01235',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปพัทลุง'
              ],
              [
                'fac_id'=> '01236',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปร้อยเอ็ด'
              ],
              [
                'fac_id'=> '01237',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปลพบุรี'
              ],
              [
                'fac_id'=> '01238',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปสุโขทัย'
              ],
              [
                'fac_id'=> '01239',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปสุพรรณบุรี'
              ],
              [
                'fac_id'=> '01240',
                'fac_name_th'=> 'วิทยาลัยนาฏศิลปอ่างทอง'
              ],
              [
                'fac_id'=> '01843',
                'fac_name_th'=> 'วิทยาลัยน่าน'
              ],
              [
                'fac_id'=> '00137',
                'fac_name_th'=> 'วิทยาลัยนานาชาติ'
              ],
              [
                'fac_id'=> '01072',
                'fac_name_th'=> 'วิทยาลัยนานาชาติการท่องเที่ยว'
              ],
              [
                'fac_id'=> '01635',
                'fac_name_th'=> 'วิทยาลัยนานาชาติจีน'
              ],
              [
                'fac_id'=> '01965',
                'fac_name_th'=> 'วิทยาลัยนานาชาตินวัตกรรมดิจิทัล'
              ],
              [
                'fac_id'=> '01446',
                'fac_name_th'=> 'วิทยาลัยนานาชาติปรีดี พนมยงค์'
              ],
              [
                'fac_id'=> '01791',
                'fac_name_th'=> 'วิทยาลัยนานาชาติพระนคร'
              ],
              [
                'fac_id'=> '00911',
                'fac_name_th'=> 'วิทยาลัยนานาชาติเพื่อศึกษาความยั่งยืน'
              ],
              [
                'fac_id'=> '00891',
                'fac_name_th'=> 'วิทยาลัยนานาชาติภูมิภาคลุ่มน้ำโขง'
              ],
              [
                'fac_id'=> '01798',
                'fac_name_th'=> 'วิทยาลัยนานาชาติสังคมศาสตร์และนิเทศศาสตร์'
              ],
              [
                'fac_id'=> '01287',
                'fac_name_th'=> 'วิทยาลัยนาโนเทคโนโลยีพระจอมเกล้าลาดกระบัง'
              ],
              [
                'fac_id'=> '01848',
                'fac_name_th'=> 'วิทยาลัยนิเทศศาสตร์'
              ],
              [
                'fac_id'=> '01943',
                'fac_name_th'=> 'วิทยาลัยบริทิช'
              ],
              [
                'fac_id'=> '01815',
                'fac_name_th'=> 'วิทยาลัยบริหารธุรกิจเชิงนวัตกรรมและการบัญชี'
              ],
              [
                'fac_id'=> '01666',
                'fac_name_th'=> 'วิทยาลัยบริหารรัฐกิจและรัฐศาสตร์'
              ],
              [
                'fac_id'=> '01589',
                'fac_name_th'=> 'วิทยาลัยบริหารและจัดการ'
              ],
              [
                'fac_id'=> '00638',
                'fac_name_th'=> 'วิทยาลัยบริหารศาสตร์'
              ],
              [
                'fac_id'=> '00986',
                'fac_name_th'=> 'วิทยาลัยบัณฑิตศึกษา ศรีราชา'
              ],
              [
                'fac_id'=> '00183',
                'fac_name_th'=> 'วิทยาลัยบัณฑิตศึกษาการจัดการ'
              ],
              [
                'fac_id'=> '01813',
                'fac_name_th'=> 'วิทยาลัยบัณฑิตศึกษาจีน'
              ],
              [
                'fac_id'=> '01591',
                'fac_name_th'=> 'วิทยาลัยบัณฑิตศึกษาด้านการจัดการ'
              ],
              [
                'fac_id'=> '02003',
                'fac_name_th'=> 'วิทยาลัยบูรณาการศาสตร์'
              ],
              [
                'fac_id'=> '00418',
                'fac_name_th'=> 'วิทยาลัยประชากรศาสตร์'
              ],
              [
                'fac_id'=> '01739',
                'fac_name_th'=> 'วิทยาลัยประชาคมอาเซียนศึกษา'
              ],
              [
                'fac_id'=> '01918',
                'fac_name_th'=> 'วิทยาลัยปรัชญาและการศึกษา'
              ],
              [
                'fac_id'=> '00138',
                'fac_name_th'=> 'วิทยาลัยปิโตรเลียมและปิโตรเคมี'
              ],
              [
                'fac_id'=> '01951',
                'fac_name_th'=> 'วิทยาลัยผู้ประกอบการสร้างสรรค์นานาชาติรัตนโกสินทร์'
              ],
              [
                'fac_id'=> '01015',
                'fac_name_th'=> 'วิทยาลัยพยาบาลบรมราชชนนี นพรัตน์วชิระ'
              ],
              [
                'fac_id'=> '21441',
                'fac_name_th'=> 'วิทยาลัยพยาบาลบรมราชชนนี แพร่'
              ],
              [
                'fac_id'=> '01806',
                'fac_name_th'=> 'วิทยาลัยพยาบาลบรมราชชนนีนครพนม'
              ],
              [
                'fac_id'=> '00850',
                'fac_name_th'=> 'วิทยาลัยพยาบาลและสุขภาพ'
              ],
              [
                'fac_id'=> '00964',
                'fac_name_th'=> 'วิทยาลัยพระคริสต์ธรรมแมคกิลวารี'
              ],
              [
                'fac_id'=> '00247',
                'fac_name_th'=> 'วิทยาลัยพลังงานทดแทน'
              ],
              [
                'fac_id'=> '08002',
                'fac_name_th'=> 'วิทยาลัยพลังงานและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '01863',
                'fac_name_th'=> 'วิทยาลัยพัฒนาชุมชนเมือง'
              ],
              [
                'fac_id'=> '01769',
                'fac_name_th'=> 'วิทยาลัยพัฒนามหานคร'
              ],
              [
                'fac_id'=> '00258',
                'fac_name_th'=> 'วิทยาลัยพาณิชยศาสตร์'
              ],
              [
                'fac_id'=> '01852',
                'fac_name_th'=> 'วิทยาลัยพุทธศาสตร์นานาชาติ'
              ],
              [
                'fac_id'=> '01058',
                'fac_name_th'=> 'วิทยาลัยพุทธศาสตร์และปรัชญา'
              ],
              [
                'fac_id'=> '00942',
                'fac_name_th'=> 'วิทยาลัยเพาะช่าง'
              ],
              [
                'fac_id'=> '01709',
                'fac_name_th'=> 'วิทยาลัยเพื่อการค้นคว้าระดับรากฐาน'
              ],
              [
                'fac_id'=> '99002',
                'fac_name_th'=> 'วิทยาลัยเพื่อการค้นคว้าระดับรากฐาน'
              ],
              [
                'fac_id'=> '00799',
                'fac_name_th'=> 'วิทยาลัยแพทย์ทางเลือก'
              ],
              [
                'fac_id'=> '00939',
                'fac_name_th'=> 'วิทยาลัยแพทย์แผนไทยและแพทย์ทางเลือก'
              ],
              [
                'fac_id'=> '00725',
                'fac_name_th'=> 'วิทยาลัยแพทยศาสตร์กรุงเทพมหานครและวชิรพยาบาล'
              ],
              [
                'fac_id'=> '01734',
                'fac_name_th'=> 'วิทยาลัยแพทยศาสตร์นานาชาติจุฬาภรณ์'
              ],
              [
                'fac_id'=> '00275',
                'fac_name_th'=> 'วิทยาลัยแพทยศาสตร์และสาธารณสุข '
              ],
              [
                'fac_id'=> '01549',
                'fac_name_th'=> 'วิทยาลัยโพธิวิชชาลัย'
              ],
              [
                'fac_id'=> '00679',
                'fac_name_th'=> 'วิทยาลัยภูมิปัญญาชุมชน'
              ],
              [
                'fac_id'=> '01928',
                'fac_name_th'=> 'วิทยาลัยเภสัชศาสตร์'
              ],
              [
                'fac_id'=> '00957',
                'fac_name_th'=> 'วิทยาลัยมวยไทยศึกษา'
              ],
              [
                'fac_id'=> '00359',
                'fac_name_th'=> 'วิทยาลัยแม่ฮ่องสอน'
              ],
              [
                'fac_id'=> '01847',
                'fac_name_th'=> 'วิทยาลัยรัฐกิจ'
              ],
              [
                'fac_id'=> '01131',
                'fac_name_th'=> 'วิทยาลัยรัตภูมิ'
              ],
              [
                'fac_id'=> '00139',
                'fac_name_th'=> 'วิทยาลัยราชสุดา'
              ],
              [
                'fac_id'=> '01735',
                'fac_name_th'=> 'วิทยาลัยโลกคดีศึกษา'
              ],
              [
                'fac_id'=> '01737',
                'fac_name_th'=> 'วิทยาลัยโลจิสติกส์และซัพพลายเชน'
              ],
              [
                'fac_id'=> '01756',
                'fac_name_th'=> 'วิทยาลัยโลจิสติกส์และซัพพลายเซน'
              ],
              [
                'fac_id'=> '01694',
                'fac_name_th'=> 'วิทยาลัยโลจิสติกส์และโซ่อุปทาน'
              ],
              [
                'fac_id'=> '99001',
                'fac_name_th'=> 'วิทยาลัยโลจิสติกส์และห่วงโซ่อุปทาน'
              ],
              [
                'fac_id'=> '01451',
                'fac_name_th'=> 'วิทยาลัยวัตกรรมการจัดการ'
              ],
              [
                'fac_id'=> '01826',
                'fac_name_th'=> 'วิทยาลัยวิจัยนวัตกรรมทางการศึกษา'
              ],
              [
                'fac_id'=> '01007',
                'fac_name_th'=> 'วิทยาลัยวิทยาการวิจัยและวิทยาการปัญญา'
              ],
              [
                'fac_id'=> '00278',
                'fac_name_th'=> 'วิทยาลัยวิทยาศาสตร์การกีฬา'
              ],
              [
                'fac_id'=> '01866',
                'fac_name_th'=> 'วิทยาลัยวิทยาศาสตร์การแพทย์เจ้าฟ้าจุฬาภรณ์'
              ],
              [
                'fac_id'=> '00140',
                'fac_name_th'=> 'วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา'
              ],
              [
                'fac_id'=> '01039',
                'fac_name_th'=> 'วิทยาลัยวิทยาศาสตร์สาธารณสุข'
              ],
              [
                'fac_id'=> '01940',
                'fac_name_th'=> 'วิทยาลัยวิศวกรรมชีวการแพทย์'
              ],
              [
                'fac_id'=> '01956',
                'fac_name_th'=> 'วิทยาลัยวิศวกรรมสังคีต'
              ],
              [
                'fac_id'=> '00720',
                'fac_name_th'=> 'วิทยาลัยศาสนศาสตร์'
              ],
              [
                'fac_id'=> '01612',
                'fac_name_th'=> 'วิทยาลัยศาสนศาสตร์ เฉลิมพระเกียรติ กาฬสินธุ์'
              ],
              [
                'fac_id'=> '01614',
                'fac_name_th'=> 'วิทยาลัยศาสนศาสตร์ ยโสธร'
              ],
              [
                'fac_id'=> '00212',
                'fac_name_th'=> 'วิทยาลัยศาสนศึกษา'
              ],
              [
                'fac_id'=> '01920',
                'fac_name_th'=> 'วิทยาลัยศิลปวิทยาและวิทยาศาสตร์เทคโนโลยี'
              ],
              [
                'fac_id'=> '02203',
                'fac_name_th'=> 'วิทยาลัยศิลปศาสตร์'
              ],
              [
                'fac_id'=> '00797',
                'fac_name_th'=> 'วิทยาลัยศิลปะ สื่อ และเทคโนโลยี'
              ],
              [
                'fac_id'=> '01722',
                'fac_name_th'=> 'วิทยาลัยศิลปะการแสดง'
              ],
              [
                'fac_id'=> '01780',
                'fac_name_th'=> 'วิทยาลัยสงฆ์ชัยภูมิ'
              ],
              [
                'fac_id'=> '09010',
                'fac_name_th'=> 'วิทยาลัยสงฆ์เชียงราย'
              ],
              [
                'fac_id'=> '09008',
                'fac_name_th'=> 'วิทยาลัยสงฆ์นครน่าน'
              ],
              [
                'fac_id'=> '09012',
                'fac_name_th'=> 'วิทยาลัยสงฆ์นครลำปาง'
              ],
              [
                'fac_id'=> '01786',
                'fac_name_th'=> 'วิทยาลัยสงฆ์พ่อขุนผาเมือง เพรชรบูรณ์'
              ],
              [
                'fac_id'=> '01782',
                'fac_name_th'=> 'วิทยาลัยสงฆ์พุทธปัญญาศรีทวารวดี'
              ],
              [
                'fac_id'=> '09014',
                'fac_name_th'=> 'วิทยาลัยสงฆ์พุทธโสธร'
              ],
              [
                'fac_id'=> '02020',
                'fac_name_th'=> 'วิทยาลัยสงฆ์เพชรบุรี'
              ],
              [
                'fac_id'=> '02021',
                'fac_name_th'=> 'วิทยาลัยสงฆ์มหาสารคาม'
              ],
              [
                'fac_id'=> '01784',
                'fac_name_th'=> 'วิทยาลัยสงฆ์ร้อยเอ็ด'
              ],
              [
                'fac_id'=> '02017',
                'fac_name_th'=> 'วิทยาลัยสงฆ์ระยอง'
              ],
              [
                'fac_id'=> '01788',
                'fac_name_th'=> 'วิทยาลัยสงฆ์ราชบุรี'
              ],
              [
                'fac_id'=> '09016',
                'fac_name_th'=> 'วิทยาลัยสงฆ์ศรีษะเกษ'
              ],
              [
                'fac_id'=> '02018',
                'fac_name_th'=> 'วิทยาลัยสงฆ์สุราษฎร์ธานี'
              ],
              [
                'fac_id'=> '02019',
                'fac_name_th'=> 'วิทยาลัยสงฆ์อุทัยธานี'
              ],
              [
                'fac_id'=> '01828',
                'fac_name_th'=> 'วิทยาลัยสถาปัตยกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00235',
                'fac_name_th'=> 'วิทยาลัยสหวิทยาการ'
              ],
              [
                'fac_id'=> '01677',
                'fac_name_th'=> 'วิทยาลัยสหเวชศาสตร์'
              ],
              [
                'fac_id'=> '00232',
                'fac_name_th'=> 'วิทยาลัยสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '01079',
                'fac_name_th'=> 'วิทยาลัยสื่อสารการเมือง'
              ],
              [
                'fac_id'=> '00259',
                'fac_name_th'=> 'วิทยาลัยอัญมณี'
              ],
              [
                'fac_id'=> '00141',
                'fac_name_th'=> 'วิทยาลัยอิสลามศึกษา'
              ],
              [
                'fac_id'=> '01827',
                'fac_name_th'=> 'วิทยาลัยอุตสาหกรรมการบินนานาชาติ'
              ],
              [
                'fac_id'=> '01946',
                'fac_name_th'=> 'วิทยาลัยอุตสาหกรรมสร้างสรรค์'
              ],
              [
                'fac_id'=> '00404',
                'fac_name_th'=> 'วิทยาศาสตร์'
              ],
              [
                'fac_id'=> '00248',
                'fac_name_th'=> 'วิทยาศาสตร์การแพทย์'
              ],
              [
                'fac_id'=> '00958',
                'fac_name_th'=> 'ศูนย์กรุงเทพมหานคร'
              ],
              [
                'fac_id'=> '01035',
                'fac_name_th'=> 'ศูนย์กล้วยไม้และไม้ดอกไม้ประดับ'
              ],
              [
                'fac_id'=> '00711',
                'fac_name_th'=> 'ศูนย์การจัดการด้านพลังงานสิ่งแวดล้อมความปลอดภัยและอาชีวอนามัย'
              ],
              [
                'fac_id'=> '00829',
                'fac_name_th'=> 'ศูนย์การแพทย์กาญจนาภิเษก'
              ],
              [
                'fac_id'=> '01073',
                'fac_name_th'=> 'ศูนย์การแพทย์ปัญญานันทภิกขุ ชลประทาน มหาวิทยาลัยศรีนครินทรวิโรฒ'
              ],
              [
                'fac_id'=> '01554',
                'fac_name_th'=> 'ศูนย์การแพทย์สมเด็จพระเทพรัตนราชสุดา ฯ สยามบรมราชกุมารี'
              ],
              [
                'fac_id'=> '80031',
                'fac_name_th'=> 'ศูนย์การศึกษานอกที่ตั้งวิทยาลัยเทคโนโลยีภูเก็ต'
              ],
              [
                'fac_id'=> '80015',
                'fac_name_th'=> 'ศูนย์การศึกษานอกสถานที่ตั้ง ณ โรงเรียนสมุทรสาครบูรณะ'
              ],
              [
                'fac_id'=> '80014',
                'fac_name_th'=> 'ศูนย์การศึกษานอกสถานที่ตั้ง ณ วิทยาลัยเทคโนโลยีมิตรพล'
              ],
              [
                'fac_id'=> '80013',
                'fac_name_th'=> 'ศูนย์การศึกษานอกสถานที่ตั้ง ณ วิทยาลัยพณิชยการเชตุพน'
              ],
              [
                'fac_id'=> '00366',
                'fac_name_th'=> 'ศูนย์การศึกษาพิเศษ'
              ],
              [
                'fac_id'=> '80029',
                'fac_name_th'=> 'ศูนย์การศึกษามหาวิทยาลัยธนบุรี วิทยาลัยเทคโนโลยีศรีวัฒนาบริหารธุรกิจ'
              ],
              [
                'fac_id'=> '80030',
                'fac_name_th'=> 'ศูนย์การศึกษามหาวิทยาลัยธนบุรี วิทยาลัยเทคโนโลยีหมู่บ้านครูภาคเหนือ'
              ],
              [
                'fac_id'=> '09007',
                'fac_name_th'=> 'ศูนย์การศึกษามหาวิทยาลัยราชภัฎจันทรเกษม-ชัยนาท'
              ],
              [
                'fac_id'=> '80016',
                'fac_name_th'=> 'ศูนย์การศึกษามหาวิทยาลัยราชภัฏเลย จังหวัดขอนแก่น'
              ],
              [
                'fac_id'=> '09018',
                'fac_name_th'=> 'ศูนย์การศึกษาเมืองพัทยา'
              ],
              [
                'fac_id'=> '00804',
                'fac_name_th'=> 'ศูนย์กิจการนานาชาติ'
              ],
              [
                'fac_id'=> '00905',
                'fac_name_th'=> 'ศูนย์กีฬา'
              ],
              [
                'fac_id'=> '01557',
                'fac_name_th'=> 'ศูนย์กีฬา มหาวิทยาลัยศรีนครินทรวิโรฒ'
              ],
              [
                'fac_id'=> '00582',
                'fac_name_th'=> 'ศูนย์ข้อมูลลาว'
              ],
              [
                'fac_id'=> '00504',
                'fac_name_th'=> 'ศูนย์ความเป็นเลิศทางการสอน'
              ],
              [
                'fac_id'=> '00576',
                'fac_name_th'=> 'ศูนย์ความเป็นเลิศทางวิชาการ'
              ],
              [
                'fac_id'=> '01647',
                'fac_name_th'=> 'ศูนย์ความเป็นเลิศแห่งชาติด้านการจัดการสิ่งแวดล้อมและของเสียอันตราย'
              ],
              [
                'fac_id'=> '00542',
                'fac_name_th'=> 'ศูนย์ความหลากหลายทางชีวภาพ'
              ],
              [
                'fac_id'=> '00336',
                'fac_name_th'=> 'ศูนย์คอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00369',
                'fac_name_th'=> 'ศูนย์คอมพิวเตอร์กราฟิก'
              ],
              [
                'fac_id'=> '01390',
                'fac_name_th'=> 'ศูนย์คอมพิวเตอร์และสารสนเทศ'
              ],
              [
                'fac_id'=> '00370',
                'fac_name_th'=> 'ศูนย์คอมพิวเตอร์อุตสาหกรรม'
              ],
              [
                'fac_id'=> '00537',
                'fac_name_th'=> 'ศูนย์เครือข่าย สมศ.'
              ],
              [
                'fac_id'=> '01115',
                'fac_name_th'=> 'ศูนย์เครือข่ายงานวิเคราะห์วิจัยและฝึกอบรมการเปลี่ยนแปลงของโลก'
              ],
              [
                'fac_id'=> '00419',
                'fac_name_th'=> 'ศูนย์เครื่องมือวิจัยวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '01607',
                'fac_name_th'=> 'ศูนย์เครื่องมือวิทยาศาสตร์'
              ],
              [
                'fac_id'=> '00642',
                'fac_name_th'=> 'ศูนย์เครื่องมือวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00938',
                'fac_name_th'=> 'ศูนย์จิตตปัญญาศึกษา'
              ],
              [
                'fac_id'=> '00872',
                'fac_name_th'=> 'ศูนย์ชุมชนน่าอยู่กรุงเทพ'
              ],
              [
                'fac_id'=> '01653',
                'fac_name_th'=> 'ศูนย์ดุสิตพาณิชยการ'
              ],
              [
                'fac_id'=> '00543',
                'fac_name_th'=> 'ศูนย์ตรวจสอบและพัฒนาผลิตภัณฑ์ OTOP'
              ],
              [
                'fac_id'=> '00615',
                'fac_name_th'=> 'ศูนย์ตรวจสอบสารต้องห้ามในนักกีฬา'
              ],
              [
                'fac_id'=> '00779',
                'fac_name_th'=> 'ศูนย์เตรียมความพร้อมเพื่อการทำงาน'
              ],
              [
                'fac_id'=> '01020',
                'fac_name_th'=> 'ศูนย์ถ่ายทอดเทคโนโลยีเกษตรกรรมเฉลิมพระเกียรติ (ฟาร์ม)'
              ],
              [
                'fac_id'=> '00972',
                'fac_name_th'=> 'ศูนย์เทคโนโลยีการศึกษา'
              ],
              [
                'fac_id'=> '00527',
                'fac_name_th'=> 'ศูนย์เทคโนโลยีชีวภาพเกษตร'
              ],
              [
                'fac_id'=> '00780',
                'fac_name_th'=> 'ศูนย์เทคโนโลยีทางการศึกษา'
              ],
              [
                'fac_id'=> '00781',
                'fac_name_th'=> 'ศูนย์ธุรกิจวิทยบริการ'
              ],
              [
                'fac_id'=> '00782',
                'fac_name_th'=> 'ศูนย์นวัตกรรมการเรียนการสอน'
              ],
              [
                'fac_id'=> '01030',
                'fac_name_th'=> 'ศูนย์นวัตกรรมการเรียนรู้ตลอดชีวิต'
              ],
              [
                'fac_id'=> '00567',
                'fac_name_th'=> 'ศูนย์นวัตกรรมเทคโนโลยีไทย-ฝรั่งเศส'
              ],
              [
                'fac_id'=> '00309',
                'fac_name_th'=> 'ศูนย์นวัตกรรมไหม'
              ],
              [
                'fac_id'=> '09003',
                'fac_name_th'=> 'ศูนย์นอกที่ตั้ง  ตรัง'
              ],
              [
                'fac_id'=> '09005',
                'fac_name_th'=> 'ศูนย์นอกที่ตั้ง นครนายก'
              ],
              [
                'fac_id'=> '09006',
                'fac_name_th'=> 'ศูนย์นอกที่ตั้ง พิษณุโลก'
              ],
              [
                'fac_id'=> '09004',
                'fac_name_th'=> 'ศูนย์นอกที่ตั้ง ลำปาง'
              ],
              [
                'fac_id'=> '09001',
                'fac_name_th'=> 'ศูนย์นอกที่ตั้ง สุพรรณบุรี'
              ],
              [
                'fac_id'=> '09002',
                'fac_name_th'=> 'ศูนย์นอกที่ตั้ง หัวหิน'
              ],
              [
                'fac_id'=> '00520',
                'fac_name_th'=> 'ศูนย์นานาชาติสิรินธร เพื่อการวิจัยพัฒนา และถ่ายทอดเทคโนโลยี'
              ],
              [
                'fac_id'=> '00783',
                'fac_name_th'=> 'ศูนย์นิเทศศาสตรพัฒนาการแห่งภูมิภาคเอเชียและแปซิฟิก'
              ],
              [
                'fac_id'=> '01050',
                'fac_name_th'=> 'ศูนย์บ่มเพาะวิสาหกิจ'
              ],
              [
                'fac_id'=> '00639',
                'fac_name_th'=> 'ศูนย์บรรณสารและสื่อการศึกษา'
              ],
              [
                'fac_id'=> '01454',
                'fac_name_th'=> 'ศูนย์บรรณสารสนเทศ'
              ],
              [
                'fac_id'=> '01567',
                'fac_name_th'=> 'ศูนย์บริการการกีฬา'
              ],
              [
                'fac_id'=> '00738',
                'fac_name_th'=> 'ศูนย์บริการการศึกษา'
              ],
              [
                'fac_id'=> '00221',
                'fac_name_th'=> 'ศูนย์บริการทางวิชาการจังหวัดร้อยเอ็ด'
              ],
              [
                'fac_id'=> '00224',
                'fac_name_th'=> 'ศูนย์บริการทางวิชาการภายนอกจังหวัดชัยภูมิ'
              ],
              [
                'fac_id'=> '00222',
                'fac_name_th'=> 'ศูนย์บริการทางวิชาการภายนอกจังหวัดนครราชสีมา'
              ],
              [
                'fac_id'=> '00225',
                'fac_name_th'=> 'ศูนย์บริการทางวิชาการภายนอกจังหวัดมุกดาหาร'
              ],
              [
                'fac_id'=> '00226',
                'fac_name_th'=> 'ศูนย์บริการทางวิชาการภายนอกจังหวัดสุรินทร์'
              ],
              [
                'fac_id'=> '00223',
                'fac_name_th'=> 'ศูนย์บริการทางวิชาการภายนอกจังหวัดอุบลราชธานี'
              ],
              [
                'fac_id'=> '01082',
                'fac_name_th'=> 'ศูนย์บริการเทคโนโลยี'
              ],
              [
                'fac_id'=> '00640',
                'fac_name_th'=> 'ศูนย์บริการเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00505',
                'fac_name_th'=> 'ศูนย์บริการวิชาการ'
              ],
              [
                'fac_id'=> '00866',
                'fac_name_th'=> 'ศูนย์บริการสังคม'
              ],
              [
                'fac_id'=> '01435',
                'fac_name_th'=> 'ศูนย์บริหารจัดการความเสี่ยง'
              ],
              [
                'fac_id'=> '00560',
                'fac_name_th'=> 'ศูนย์เบเกอรี่'
              ],
              [
                'fac_id'=> '01053',
                'fac_name_th'=> 'ศูนย์ปฏิบัติการส่งเสริมอาชีพอิสระ (ครัวราชภัฏ)'
              ],
              [
                'fac_id'=> '00672',
                'fac_name_th'=> 'ศูนย์ประกันคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00926',
                'fac_name_th'=> 'ศูนย์ประสานงานการประกันคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00583',
                'fac_name_th'=> 'ศูนย์ประสานงานเขตอุตสาหกรรมซอฟท์เเวร์ภาคตะวันออกเฉียงเหนือ'
              ],
              [
                'fac_id'=> '00545',
                'fac_name_th'=> 'ศูนย์ประสานงานมหาวิทยาลัยราชภัฎเชียงราย ประจำกรุงเทพมหานคร'
              ],
              [
                'fac_id'=> '00544',
                'fac_name_th'=> 'ศูนย์ประสานงานมหาวิทยาลัยราชภัฏเชียงราย ประจำประเทศสาธารณรัฐประชาชนจีน'
              ],
              [
                'fac_id'=> '00845',
                'fac_name_th'=> 'ศูนย์แปลและวิจัยด้านภาษา'
              ],
              [
                'fac_id'=> '00410',
                'fac_name_th'=> 'ศูนย์ฝึกปฏิบัติการวิชาชีพธุรกิจ'
              ],
              [
                'fac_id'=> '01048',
                'fac_name_th'=> 'ศูนย์ฝึกประสบการณ์วิชาชีพทับแก้ว'
              ],
              [
                'fac_id'=> '00371',
                'fac_name_th'=> 'ศูนย์ฝึกอบรมคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00607',
                'fac_name_th'=> 'ศูนย์ฝึกอบรมเทคโนโลยีการพิมพ์แห่งชาติ'
              ],
              [
                'fac_id'=> '01054',
                'fac_name_th'=> 'ศูนย์ฝึกอบรมและวิจัยทางการเกษตร 100 ไร่'
              ],
              [
                'fac_id'=> '00993',
                'fac_name_th'=> 'ศูนย์ฝึกอบรมศาสตร์และศิลป์การเรียนรู้ทางการศึกษา'
              ],
              [
                'fac_id'=> '00506',
                'fac_name_th'=> 'ศูนย์พยากรณ์เศรษฐกิจและธุรกิจ'
              ],
              [
                'fac_id'=> '00372',
                'fac_name_th'=> 'ศูนย์พลพณิชยการ'
              ],
              [
                'fac_id'=> '00220',
                'fac_name_th'=> 'ศูนย์พัฒนาการศึกษาจังหวัดอุดรธานี'
              ],
              [
                'fac_id'=> '00955',
                'fac_name_th'=> 'ศูนย์พัฒนาเด็กเล็ก'
              ],
              [
                'fac_id'=> '00883',
                'fac_name_th'=> 'ศูนย์พัฒนาเด็กเล็ก มจธ.'
              ],
              [
                'fac_id'=> '00546',
                'fac_name_th'=> 'ศูนย์พัฒนาเด็กและสตรี'
              ],
              [
                'fac_id'=> '00310',
                'fac_name_th'=> 'ศูนย์พัฒนาทรัพยากรการศึกษา'
              ],
              [
                'fac_id'=> '00547',
                'fac_name_th'=> 'ศูนย์พัฒนาธุรกิจและสิทธิประโยชน์'
              ],
              [
                'fac_id'=> '00575',
                'fac_name_th'=> 'ศูนย์พัฒนาบุคลากรเพื่ออุตสาหกรรมและปิโตรเคมี'
              ],
              [
                'fac_id'=> '00784',
                'fac_name_th'=> 'ศูนย์พัฒนาบุคลิกภาพและการสื่อสาร'
              ],
              [
                'fac_id'=> '00311',
                'fac_name_th'=> 'ศูนย์พัฒนาภาษา'
              ],
              [
                'fac_id'=> '00519',
                'fac_name_th'=> 'ศูนย์พัฒนาและถ่ายทอดเทคโนโลยีรัฐร่วมเอกชน'
              ],
              [
                'fac_id'=> '00312',
                'fac_name_th'=> 'ศูนย์พัฒนาและประกันคุณภาพ'
              ],
              [
                'fac_id'=> '00908',
                'fac_name_th'=> 'ศูนย์พัฒนาสภาพกายภาพ การจัดการขนส่งและความปลอดภัย'
              ],
              [
                'fac_id'=> '01075',
                'fac_name_th'=> 'ศูนย์พัฒนาอัจฉริยภาพทางดนตรี'
              ],
              [
                'fac_id'=> '00375',
                'fac_name_th'=> 'ศูนย์แฟชั่นไอส์แลนด์'
              ],
              [
                'fac_id'=> '00337',
                'fac_name_th'=> 'ศูนย์ภาษา'
              ],
              [
                'fac_id'=> '01076',
                'fac_name_th'=> 'ศูนย์ภาษามหาวิทยาลัยศรีนครินทรวิโรฒ'
              ],
              [
                'fac_id'=> '00641',
                'fac_name_th'=> 'ศูนย์ภาษาและวัฒนธรรมจีนสิรินธร'
              ],
              [
                'fac_id'=> '00548',
                'fac_name_th'=> 'ศูนย์มวลชนสัมพันธ์'
              ],
              [
                'fac_id'=> '00373',
                'fac_name_th'=> 'ศูนย์รามสแควร์'
              ],
              [
                'fac_id'=> '00785',
                'fac_name_th'=> 'ศูนย์วัฒนธรรม'
              ],
              [
                'fac_id'=> '00867',
                'fac_name_th'=> 'ศูนย์วัฒนธรรมอิสลาม'
              ],
              [
                'fac_id'=> '00786',
                'fac_name_th'=> 'ศูนย์วิจัย'
              ],
              [
                'fac_id'=> '01036',
                'fac_name_th'=> 'ศูนย์วิจัยพลังงาน'
              ],
              [
                'fac_id'=> '00841',
                'fac_name_th'=> 'ศูนย์วิจัยเพื่อเพิ่มผลผลิตทางเกษตร'
              ],
              [
                'fac_id'=> '00892',
                'fac_name_th'=> 'ศูนย์วิจัยมหาวิทยาลัยชิคาโก-มหาวิทยาลัยหอการค้าไทย'
              ],
              [
                'fac_id'=> '00313',
                'fac_name_th'=> 'ศูนย์วิจัยและการศึกษาบรรพชีวินวิทยา'
              ],
              [
                'fac_id'=> '00814',
                'fac_name_th'=> 'ศูนย์วิจัยและฝึกอบรมภูสิงห์'
              ],
              [
                'fac_id'=> '00538',
                'fac_name_th'=> 'ศูนย์วิจัยและพัฒนาผลิตภัณฑ์ท้องถิ่น'
              ],
              [
                'fac_id'=> '00835',
                'fac_name_th'=> 'ศูนย์วิจัยและพัฒนาลำไยแม่โจ้'
              ],
              [
                'fac_id'=> '00894',
                'fac_name_th'=> 'ศูนย์วิจัยโลจิสติกส์'
              ],
              [
                'fac_id'=> '00428',
                'fac_name_th'=> 'ศูนย์วิทยทรัพยากร'
              ],
              [
                'fac_id'=> '00389',
                'fac_name_th'=> 'ศูนย์วิทยบริการ'
              ],
              [
                'fac_id'=> '01046',
                'fac_name_th'=> 'ศูนย์วิทยบริการกรุงเทพมหานคร'
              ],
              [
                'fac_id'=> '00739',
                'fac_name_th'=> 'ศูนย์วิทยบริการมหาวิทยาลัยวลัยลักษณ์ จังหวัดสุราษฎร์ธานี'
              ],
              [
                'fac_id'=> '00935',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดจันทบุรี'
              ],
              [
                'fac_id'=> '00937',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดนครนายก'
              ],
              [
                'fac_id'=> '00928',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดนครศรีธรรมราช'
              ],
              [
                'fac_id'=> '00929',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดนครสวรรค์'
              ],
              [
                'fac_id'=> '00930',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดเพชรบุรี'
              ],
              [
                'fac_id'=> '00936',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดยะลา'
              ],
              [
                'fac_id'=> '00934',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดลำปาง'
              ],
              [
                'fac_id'=> '00931',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดสุโขทัย'
              ],
              [
                'fac_id'=> '00933',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดอุดรธานี'
              ],
              [
                'fac_id'=> '00932',
                'fac_name_th'=> 'ศูนย์วิทยพัฒนามหาวิทยาลัยสุโขทัยธรรมาธิราช จังหวัดอุบลราชธานี'
              ],
              [
                'fac_id'=> '00271',
                'fac_name_th'=> 'ศูนย์วิทยาศาสตร์'
              ],
              [
                'fac_id'=> '01057',
                'fac_name_th'=> 'ศูนย์วิทยาศาสตร์และวิทยาศาสตร์ประยุกต์'
              ],
              [
                'fac_id'=> '00907',
                'fac_name_th'=> 'ศูนย์วิทยาศาสตรศึกษา'
              ],
              [
                'fac_id'=> '00594',
                'fac_name_th'=> 'ศูนย์วิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '00559',
                'fac_name_th'=> 'ศูนย์วิศวกรรมโยธา'
              ],
              [
                'fac_id'=> '00374',
                'fac_name_th'=> 'ศูนย์เวชศึกษาป้องกัน'
              ],
              [
                'fac_id'=> '00338',
                'fac_name_th'=> 'ศูนย์เวชศึกษาป้องกัน  กองกิจการนักศึกษา'
              ],
              [
                'fac_id'=> '00612',
                'fac_name_th'=> 'ศูนย์ศาลายา'
              ],
              [
                'fac_id'=> '01083',
                'fac_name_th'=> 'ศูนย์ศิลปวัฒนธรรม'
              ],
              [
                'fac_id'=> '00507',
                'fac_name_th'=> 'ศูนย์ศึกษาการค้าระหว่างประเทศ'
              ],
              [
                'fac_id'=> '80017',
                'fac_name_th'=> 'ศูนย์ศึกษาการจัดการการท่องเที่ยวแบบบูรณาการ'
              ],
              [
                'fac_id'=> '00508',
                'fac_name_th'=> 'ศูนย์ศึกษาธุรกิจขนาดกลางและขนาดย่อม'
              ],
              [
                'fac_id'=> '01402',
                'fac_name_th'=> 'ศูนย์ศึกษาธุรกิจครอบครัวและSMEs'
              ],
              [
                'fac_id'=> '00509',
                'fac_name_th'=> 'ศูนย์ศึกษาธุรกิจไทย-จีน'
              ],
              [
                'fac_id'=> '00561',
                'fac_name_th'=> 'ศูนย์ศึกษาเพื่อพัฒนาเศรษฐกิจ สังคมและวัฒนธรรมฯ'
              ],
              [
                'fac_id'=> '00549',
                'fac_name_th'=> 'ศูนย์ศึกษาและพัฒนาหม่อนไหม'
              ],
              [
                'fac_id'=> '00510',
                'fac_name_th'=> 'ศูนย์ศึกษาและวิจัยตราสินค้า'
              ],
              [
                'fac_id'=> '01404',
                'fac_name_th'=> 'ศูนย์ศึกษาและวิจัยสื่อมวลชนอาเซียน'
              ],
              [
                'fac_id'=> '01125',
                'fac_name_th'=> 'ศูนย์ส่งเสริมศิลปและวัฒนธรรม'
              ],
              [
                'fac_id'=> '01052',
                'fac_name_th'=> 'ศูนย์ส่งเสริมสุขภาพ'
              ],
              [
                'fac_id'=> '00787',
                'fac_name_th'=> 'ศูนย์สนเทศและหอสมุด'
              ],
              [
                'fac_id'=> '01450',
                'fac_name_th'=> 'ศูนย์สระแก้ว'
              ],
              [
                'fac_id'=> '01189',
                'fac_name_th'=> 'ศูนย์สัตว์ทดลองแห่งชาติ'
              ],
              [
                'fac_id'=> '00673',
                'fac_name_th'=> 'ศูนย์สัมมนาและฝึกอบรม'
              ],
              [
                'fac_id'=> '00411',
                'fac_name_th'=> 'ศูนย์สาธิตการศึกษาปฐมวัย'
              ],
              [
                'fac_id'=> '00671',
                'fac_name_th'=> 'ศูนย์สารสนเทศ'
              ],
              [
                'fac_id'=> '01552',
                'fac_name_th'=> 'ศูนย์สารสนเทศและการประชาสัมพันธ์'
              ],
              [
                'fac_id'=> '00550',
                'fac_name_th'=> 'ศูนย์สิ่งทอ'
              ],
              [
                'fac_id'=> '00702',
                'fac_name_th'=> 'ศูนย์สื่อการสอนทางอิเล็กทรอนิกส์'
              ],
              [
                'fac_id'=> '00551',
                'fac_name_th'=> 'ศูนย์สุขภาพ'
              ],
              [
                'fac_id'=> '00339',
                'fac_name_th'=> 'ศูนย์เสริมสร้างความเข้มแข็งของชุมชน'
              ],
              [
                'fac_id'=> '00967',
                'fac_name_th'=> 'ศูนย์เสริมสร้างทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '00591',
                'fac_name_th'=> 'ศูนย์หนังสือ'
              ],
              [
                'fac_id'=> '00884',
                'fac_name_th'=> 'ศูนย์หนังสือพระจอมเกล้าธนบุรี'
              ],
              [
                'fac_id'=> '00584',
                'fac_name_th'=> 'ศูนย์หัวใจสิริกิติ์ภาคตะวันออกเฉียงเหนือ'
              ],
              [
                'fac_id'=> '00618',
                'fac_name_th'=> 'ศูนย์ให้การศึกษา จ.สุพรรณบุรี'
              ],
              [
                'fac_id'=> '00960',
                'fac_name_th'=> 'ศูนย์ให้การศึกษาเซียร์รังสิต'
              ],
              [
                'fac_id'=> '00617',
                'fac_name_th'=> 'ศูนย์ให้การศึกษาดรุณพิทยา'
              ],
              [
                'fac_id'=> '00619',
                'fac_name_th'=> 'ศูนย์ให้การศึกษาธนบุรี'
              ],
              [
                'fac_id'=> '00391',
                'fac_name_th'=> 'ศูนย์ให้การศึกษาพัทลุง'
              ],
              [
                'fac_id'=> '00392',
                'fac_name_th'=> 'ศูนย์ให้การศึกษาสตูล'
              ],
              [
                'fac_id'=> '00393',
                'fac_name_th'=> 'ศูนย์ให้การศึกษาหาดใหญ่'
              ],
              [
                'fac_id'=> '00961',
                'fac_name_th'=> 'ศูนย์ให้การศึกษาเอกศาสตร์'
              ],
              [
                'fac_id'=> '00390',
                'fac_name_th'=> 'ศูนย์อาหาร'
              ],
              [
                'fac_id'=> '00621',
                'fac_name_th'=> 'ศูนย์อุดมศึกษา แม่สอด'
              ],
              [
                'fac_id'=> '00842',
                'fac_name_th'=> 'สถานปฏิบัติการเภสัชชุมชน'
              ],
              [
                'fac_id'=> '00394',
                'fac_name_th'=> 'สถานีปฏิบัติการพืชไร่'
              ],
              [
                'fac_id'=> '00395',
                'fac_name_th'=> 'สถานีปฏิบัติการเพาะเลี้ยงสัตว์น้ำ'
              ],
              [
                'fac_id'=> '01010',
                'fac_name_th'=> 'สถานีวิทยุ'
              ],
              [
                'fac_id'=> '80011',
                'fac_name_th'=> 'สถาบัน Chinese Business School'
              ],
              [
                'fac_id'=> '00708',
                'fac_name_th'=> 'สถาบันกฎหมายไทย'
              ],
              [
                'fac_id'=> '01449',
                'fac_name_th'=> 'สถาบันกรุงเทพคริสตศาสนศาสตร์'
              ],
              [
                'fac_id'=> '00420',
                'fac_name_th'=> 'สถาบันการขนส่ง'
              ],
              [
                'fac_id'=> '00477',
                'fac_name_th'=> 'สถาบันการฑูตและการต่างประเทศ'
              ],
              [
                'fac_id'=> '02205',
                'fac_name_th'=> 'สถาบันการทูตและการต่างประเทศ'
              ],
              [
                'fac_id'=> '00478',
                'fac_name_th'=> 'สถาบันการบิน'
              ],
              [
                'fac_id'=> '00653',
                'fac_name_th'=> 'สถาบันการเรียนรู้'
              ],
              [
                'fac_id'=> '00701',
                'fac_name_th'=> 'สถาบันการศึกษานานาชาติ'
              ],
              [
                'fac_id'=> '00999',
                'fac_name_th'=> 'สถาบันการศึกษาภาษาอังกฤษ'
              ],
              [
                'fac_id'=> '00992',
                'fac_name_th'=> 'สถาบันขงจื้อ'
              ],
              [
                'fac_id'=> '00878',
                'fac_name_th'=> 'สถาบันขงจื๊อ'
              ],
              [
                'fac_id'=> '00434',
                'fac_name_th'=> 'สถาบันค้นคว้าและพัฒนาผลิตผลทางการเกษตรและอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '00435',
                'fac_name_th'=> 'สถาบันค้นคว้าและพัฒนาผลิตภัณฑ์อาหาร'
              ],
              [
                'fac_id'=> '00436',
                'fac_name_th'=> 'สถาบันค้นคว้าและพัฒนาระบบนิเวศเกษตร'
              ],
              [
                'fac_id'=> '00885',
                'fac_name_th'=> 'สถาบันคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '01093',
                'fac_name_th'=> 'สถาบันจัดการความรู้'
              ],
              [
                'fac_id'=> '00552',
                'fac_name_th'=> 'สถาบันชาติพันธุ์ศึกษา'
              ],
              [
                'fac_id'=> '01188',
                'fac_name_th'=> 'สถาบันชีววิทยาศาสตร์โมเลกุล'
              ],
              [
                'fac_id'=> '01608',
                'fac_name_th'=> 'สถาบันทรัพยากรทะเลชายฝั่ง'
              ],
              [
                'fac_id'=> '01640',
                'fac_name_th'=> 'สถาบันทรัพยากรทะเลและชายฝั่ง'
              ],
              [
                'fac_id'=> '01611',
                'fac_name_th'=> 'สถาบันทรัพยากรธรรมชาติและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00627',
                'fac_name_th'=> 'สถาบันทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '00678',
                'fac_name_th'=> 'สถาบันทักษิณคดีศึกษา'
              ],
              [
                'fac_id'=> '01624',
                'fac_name_th'=> 'สถาบันเทคโนโลยีการบิน'
              ],
              [
                'fac_id'=> '02192',
                'fac_name_th'=> 'สถาบันเทคโนโลยีการบินและอวกาศ'
              ],
              [
                'fac_id'=> '00429',
                'fac_name_th'=> 'สถาบันเทคโนโลยีชีวภาพและวิศวกรรมพันธุศาสตร์'
              ],
              [
                'fac_id'=> '00142',
                'fac_name_th'=> 'สถาบันเทคโนโลยีนานาชาติสิรินธร'
              ],
              [
                'fac_id'=> '00430',
                'fac_name_th'=> 'สถาบันเทคโนโลยีเพื่อการพัฒนาชนบท'
              ],
              [
                'fac_id'=> '00626',
                'fac_name_th'=> 'สถาบันไทยคดีศึกษา'
              ],
              [
                'fac_id'=> '01113',
                'fac_name_th'=> 'สถาบันไทยศึกษา'
              ],
              [
                'fac_id'=> '01967',
                'fac_name_th'=> 'สถาบันนโยบายสาธารณะ'
              ],
              [
                'fac_id'=> '01186',
                'fac_name_th'=> 'สถาบันนวัตกรรมการเรียนรู้'
              ],
              [
                'fac_id'=> '01084',
                'fac_name_th'=> 'สถาบันนวัตกรรมเทคโนโลยี ไทย-ฝรั่งเศส'
              ],
              [
                'fac_id'=> '02015',
                'fac_name_th'=> 'สถาบันนวัตกรรมธุรกิจและการบัญชี'
              ],
              [
                'fac_id'=> '02045',
                'fac_name_th'=> 'สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย'
              ],
              [
                'fac_id'=> '00614',
                'fac_name_th'=> 'สถาบันนวัตกรรมและพัฒนากระบวนการเรียนรู้'
              ],
              [
                'fac_id'=> '00836',
                'fac_name_th'=> 'สถาบันบ่มเพาะวิสาหกิจมหาวิทยาลัยแม่โจ้'
              ],
              [
                'fac_id'=> '00421',
                'fac_name_th'=> 'สถาบันบริการคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00837',
                'fac_name_th'=> 'สถาบันบริการตรวจสอบคุณภาพและมาตรฐานผลิตภัณฑ์'
              ],
              [
                'fac_id'=> '01095',
                'fac_name_th'=> 'สถาบันบริหารการวิจัยและพัฒนา'
              ],
              [
                'fac_id'=> '00143',
                'fac_name_th'=> 'สถาบันบัณฑิตบริหารธุรกิจศศินทร์ แห่งจุฬาลงกรณ์มหาวิทยาลัย'
              ],
              [
                'fac_id'=> '01868',
                'fac_name_th'=> 'สถาบันบัณฑิตศึกษาจุฬาภรณ์'
              ],
              [
                'fac_id'=> '00651',
                'fac_name_th'=> 'สถาบันประมวลข้อมูลเพื่อการศึกษาและพัฒนา'
              ],
              [
                'fac_id'=> '00983',
                'fac_name_th'=> 'สถาบันพระบรมราชชนก'
              ],
              [
                'fac_id'=> '00144',
                'fac_name_th'=> 'สถาบันพัฒนาการท่องเที่ยวเพื่ออนุรักษ์สิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00616',
                'fac_name_th'=> 'สถาบันพัฒนาการสาธารณสุขอาเซียน'
              ],
              [
                'fac_id'=> '00700',
                'fac_name_th'=> 'สถาบันพัฒนาทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '01726',
                'fac_name_th'=> 'สถาบันพัฒนาบุคลากรการบิน'
              ],
              [
                'fac_id'=> '00712',
                'fac_name_th'=> 'สถาบันพัฒนาและฝึกอบรมโรงงานต้นแบบ'
              ],
              [
                'fac_id'=> '01623',
                'fac_name_th'=> 'สถาบันพัฒนาเศษฐกิจและเทคโนโลยีชุมชนแห่งเอเชียย'
              ],
              [
                'fac_id'=> '01185',
                'fac_name_th'=> 'สถาบันพัฒนาสุขภาพอาเซียน'
              ],
              [
                'fac_id'=> '00448',
                'fac_name_th'=> 'สถาบันเพื่อสร้างความเข้มแข็งให้ชุมชน'
              ],
              [
                'fac_id'=> '00788',
                'fac_name_th'=> 'สถาบันภาภัทร-ธุรกิจบัณฑิตย์'
              ],
              [
                'fac_id'=> '00146',
                'fac_name_th'=> 'สถาบันภาษา'
              ],
              [
                'fac_id'=> '00360',
                'fac_name_th'=> 'สถาบันภาษา ศิลปะและวัฒนธรรม'
              ],
              [
                'fac_id'=> '00862',
                'fac_name_th'=> 'สถาบันภาษานานาชาติ'
              ],
              [
                'fac_id'=> '00361',
                'fac_name_th'=> 'สถาบันภาษาและศิลปวัฒนธรรม'
              ],
              [
                'fac_id'=> '00437',
                'fac_name_th'=> 'สถาบันภาษาศาสตร์และวัฒนธรรมศึกษาราชนครินทร์'
              ],
              [
                'fac_id'=> '01187',
                'fac_name_th'=> 'สถาบันโภชนาการ'
              ],
              [
                'fac_id'=> '01620',
                'fac_name_th'=> 'สถาบันยุทธศาสตร์ทางปัญญาและวิจัย'
              ],
              [
                'fac_id'=> '00585',
                'fac_name_th'=> 'สถาบันยุทธศาสตร์เพื่อการพัฒนาภาคตะวันออกเฉียงเหนือ'
              ],
              [
                'fac_id'=> '02042',
                'fac_name_th'=> 'สถาบันรัฐประศาสนศาสตร์และธรรมาภิบาล'
              ],
              [
                'fac_id'=> '02204',
                'fac_name_th'=> 'สถาบันรัฐประศาสนศาสตร์และนโยบายสาธารณะ'
              ],
              [
                'fac_id'=> '00574',
                'fac_name_th'=> 'สถาบันวัฒนธรรมราชมงคลเฉลิมพระเกียรติ'
              ],
              [
                'fac_id'=> '00902',
                'fac_name_th'=> 'สถาบันวัฒนธรรมและศิลปะ'
              ],
              [
                'fac_id'=> '01118',
                'fac_name_th'=> 'สถาบันวัฒนธรรมศึกษากัลยาณิวัฒนา'
              ],
              [
                'fac_id'=> '00699',
                'fac_name_th'=> 'สถาบันวัฒนธรรมฯ'
              ],
              [
                'fac_id'=> '00340',
                'fac_name_th'=> 'สถาบันวิจัย'
              ],
              [
                'fac_id'=> '00573',
                'fac_name_th'=> 'สถาบันวิจัยเคมี'
              ],
              [
                'fac_id'=> '00721',
                'fac_name_th'=> 'สถาบันวิจัยญาณสังวร'
              ],
              [
                'fac_id'=> '00422',
                'fac_name_th'=> 'สถาบันวิจัยทรัพยากรทางน้ำ'
              ],
              [
                'fac_id'=> '00325',
                'fac_name_th'=> 'สถาบันวิจัยทางวิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '01616',
                'fac_name_th'=> 'สถาบันวิจัยเทคโนโลยีเกษตร'
              ],
              [
                'fac_id'=> '00789',
                'fac_name_th'=> 'สถาบันวิจัยนโยบายและแผนอุดมศึกษา'
              ],
              [
                'fac_id'=> '00147',
                'fac_name_th'=> 'สถาบันวิจัยประชากรและสังคม'
              ],
              [
                'fac_id'=> '00148',
                'fac_name_th'=> 'สถาบันวิจัยพฤติกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00423',
                'fac_name_th'=> 'สถาบันวิจัยพลังงาน'
              ],
              [
                'fac_id'=> '01705',
                'fac_name_th'=> 'สถาบันวิจัยพัฒนาและสาธิตการศึกษา'
              ],
              [
                'fac_id'=> '00904',
                'fac_name_th'=> 'สถาบันวิจัยเพื่อการพัฒนาการศึกษาสำหรับผู้ที่มีความสามารถพิเศษด้านทัศนศิลป์และศิลปะการแสดง'
              ],
              [
                'fac_id'=> '00149',
                'fac_name_th'=> 'สถาบันวิจัยภาษาและวัฒนธรรมเพื่อพัฒนาชนบท'
              ],
              [
                'fac_id'=> '01184',
                'fac_name_th'=> 'สถาบันวิจัยภาษาและวัฒนธรรมเอเซีย'
              ],
              [
                'fac_id'=> '00150',
                'fac_name_th'=> 'สถาบันวิจัยโภชนาการ'
              ],
              [
                'fac_id'=> '00889',
                'fac_name_th'=> 'สถาบันวิจัยไม้กลายเป็นหิน'
              ],
              [
                'fac_id'=> '01051',
                'fac_name_th'=> 'สถาบันวิจัยไม้กลายเป็นหินและทรัพยากรธรณี'
              ],
              [
                'fac_id'=> '00473',
                'fac_name_th'=> 'สถาบันวิจัยและพัฒนา'
              ],
              [
                'fac_id'=> '80033',
                'fac_name_th'=> 'สถาบันวิจัยและพัฒนา วิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร'
              ],
              [
                'fac_id'=> '01621',
                'fac_name_th'=> 'สถาบันวิจัยและพัฒนาการศึกษาพิเศษ '
              ],
              [
                'fac_id'=> '00581',
                'fac_name_th'=> 'สถาบันวิจัยและพัฒนาชายแดนภาคใต้'
              ],
              [
                'fac_id'=> '00151',
                'fac_name_th'=> 'สถาบันวิจัยและพัฒนาวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00438',
                'fac_name_th'=> 'สถาบันวิจัยและพัฒนาแห่ง ม.ก.'
              ],
              [
                'fac_id'=> '00516',
                'fac_name_th'=> 'สถาบันวิจัยและพัฒนาแห่งมหาวิทยาลัยเกษตรศาสตร์'
              ],
              [
                'fac_id'=> '01094',
                'fac_name_th'=> 'สถาบันวิจัยและส่งเสริมศิลปวัฒนธรรม'
              ],
              [
                'fac_id'=> '01566',
                'fac_name_th'=> 'สถาบันวิจัยและให้คำปรึกษาแห่งมหาวิทยาลัยธรรมศาสตร์'
              ],
              [
                'fac_id'=> '00427',
                'fac_name_th'=> 'สถาบันวิจัยโลหะและวัสดุ'
              ],
              [
                'fac_id'=> '00314',
                'fac_name_th'=> 'สถาบันวิจัยวลัยรุกขเวช'
              ],
              [
                'fac_id'=> '01008',
                'fac_name_th'=> 'สถาบันวิจัยวัฒนธรรมและศิลปะ'
              ],
              [
                'fac_id'=> '00424',
                'fac_name_th'=> 'สถาบันวิจัยวิทยาศาสตร์การแพทย์'
              ],
              [
                'fac_id'=> '00839',
                'fac_name_th'=> 'สถาบันวิจัยวิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '00315',
                'fac_name_th'=> 'สถาบันวิจัยศิลปะและวัฒนธรรมอีสาน'
              ],
              [
                'fac_id'=> '00425',
                'fac_name_th'=> 'สถาบันวิจัยสภาวะแวดล้อม'
              ],
              [
                'fac_id'=> '00426',
                'fac_name_th'=> 'สถาบันวิจัยสังคม'
              ],
              [
                'fac_id'=> '00790',
                'fac_name_th'=> 'สถาบันวิจัยสังคมและเศรษฐกิจ'
              ],
              [
                'fac_id'=> '01761',
                'fac_name_th'=> 'สถาบันวิจัยสัตว์ในภูมิภาคเขตร้อน'
              ],
              [
                'fac_id'=> '00515',
                'fac_name_th'=> 'สถาบันวิชาการด้านสหกรณ์'
              ],
              [
                'fac_id'=> '00192',
                'fac_name_th'=> 'สถาบันวิทยาการหุ่นยนต์ภาคสนาม'
              ],
              [
                'fac_id'=> '00593',
                'fac_name_th'=> 'สถาบันวิทยาศาสตร์ทางทะเล'
              ],
              [
                'fac_id'=> '00218',
                'fac_name_th'=> 'สถาบันวิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '01969',
                'fac_name_th'=> 'สถาบันวิศวกรรมชีวการแพทย์'
              ],
              [
                'fac_id'=> '00595',
                'fac_name_th'=> 'สถาบันศิลปะและวัฒนธรรม'
              ],
              [
                'fac_id'=> '01112',
                'fac_name_th'=> 'สถาบันศึกษาทรัพยากรธรรมชาติ'
              ],
              [
                'fac_id'=> '01962',
                'fac_name_th'=> 'สถาบันเศรษฐศาสตร์'
              ],
              [
                'fac_id'=> '00261',
                'fac_name_th'=> 'สถาบันสมทบ'
              ],
              [
                'fac_id'=> '01121',
                'fac_name_th'=> 'สถาบันสันติศึกษา'
              ],
              [
                'fac_id'=> '00899',
                'fac_name_th'=> 'สถาบันสิ่งแวดล้อมและทรัพยากร'
              ],
              [
                'fac_id'=> '01767',
                'fac_name_th'=> 'สถาบันสิทธิมนุษยชนและสันติศึกษา'
              ],
              [
                'fac_id'=> '00813',
                'fac_name_th'=> 'สถาบันสุทธิครุศิลป์'
              ],
              [
                'fac_id'=> '00439',
                'fac_name_th'=> 'สถาบันสุวรรณวาจกกสิกิจเพื่อการค้นคว้าและพัฒนาปศุสัตว์'
              ],
              [
                'fac_id'=> '00517',
                'fac_name_th'=> 'สถาบันสุวรรณวาจกกสิกิจเพื่อการค้นคว้าและพัฒนาปศุสัตว์และผลิตภัณฑ์สัตว์'
              ],
              [
                'fac_id'=> '00211',
                'fac_name_th'=> 'สถาบันแห่งชาติเพื่อการพัฒนาเด็กและครอบครัว'
              ],
              [
                'fac_id'=> '00209',
                'fac_name_th'=> 'สถาบันอณูชีววิทยาและพันธุศาสตร์'
              ],
              [
                'fac_id'=> '01096',
                'fac_name_th'=> 'สถาบันอยุธยาศึกษา  '
              ],
              [
                'fac_id'=> '01089',
                'fac_name_th'=> 'สถาบันอัสสลาม'
              ],
              [
                'fac_id'=> '01905',
                'fac_name_th'=> 'สถาบันอาณาบริเวณศึกษา'
              ],
              [
                'fac_id'=> '00440',
                'fac_name_th'=> 'สถาบันอินทรีย์จันทรสถิตย์เพื่อการค้นควาและพัฒนาด้านพืชศาสตร์'
              ],
              [
                'fac_id'=> '00518',
                'fac_name_th'=> 'สถาบันอินทรียจันทรสถิตย์เพื่อการค้นคว้าและพัฒนาด้านพืชศาสตร์'
              ],
              [
                'fac_id'=> '00864',
                'fac_name_th'=> 'สถาบันอิสลามเพื่อการวิจัย'
              ],
              [
                'fac_id'=> '00452',
                'fac_name_th'=> 'สถาบันอิสลามและอาหรับศึกษา'
              ],
              [
                'fac_id'=> '01563',
                'fac_name_th'=> 'สถาบันเอเชียตะวันออกศึกษา'
              ],
              [
                'fac_id'=> '01603',
                'fac_name_th'=> 'สถาบันเอเชียตะวันออกศึกษา'
              ],
              [
                'fac_id'=> '00903',
                'fac_name_th'=> 'สถาบันเอเชียแปซิฟิกศึกษา'
              ],
              [
                'fac_id'=> '00431',
                'fac_name_th'=> 'สถาบันเอเชียศึกษา'
              ],
              [
                'fac_id'=> '00629',
                'fac_name_th'=> 'สถาบันเอเซียตะวันออกศึกษา'
              ],
              [
                'fac_id'=> '00376',
                'fac_name_th'=> 'สนง.ศูนย์บริการการศึกษา(กศ.พท ในสถาบัน)'
              ],
              [
                'fac_id'=> '00396',
                'fac_name_th'=> 'สนามกีฬ่า'
              ],
              [
                'fac_id'=> '01067',
                'fac_name_th'=> 'สภาข้าราชการและสภาอาจารย์'
              ],
              [
                'fac_id'=> '00677',
                'fac_name_th'=> 'สภาคณาจารย์'
              ],
              [
                'fac_id'=> '00553',
                'fac_name_th'=> 'สภาคณาจารย์และข้าราชการ'
              ],
              [
                'fac_id'=> '01593',
                'fac_name_th'=> 'สภาบันวิทยาการสารสนเทศแห่งมหาวิทยาลัยศรีปทุม'
              ],
              [
                'fac_id'=> '00802',
                'fac_name_th'=> 'สภามหาวิทยาลัย'
              ],
              [
                'fac_id'=> '01099',
                'fac_name_th'=> 'สภาวิชาการ'
              ],
              [
                'fac_id'=> '01062',
                'fac_name_th'=> 'สมาคมศิษย์เก่า'
              ],
              [
                'fac_id'=> '00645',
                'fac_name_th'=> 'ส่วนการเงินและบัญชี'
              ],
              [
                'fac_id'=> '00644',
                'fac_name_th'=> 'ส่วนการจัดหางานและฝึกงานของนักศึกษา'
              ],
              [
                'fac_id'=> '00646',
                'fac_name_th'=> 'ส่วนการเจ้าหน้าที่'
              ],
              [
                'fac_id'=> '00740',
                'fac_name_th'=> 'ส่วนกิจการนักศึกษา'
              ],
              [
                'fac_id'=> '00655',
                'fac_name_th'=> 'ส่วนทะเบียนและประมวลผล'
              ],
              [
                'fac_id'=> '00656',
                'fac_name_th'=> 'ส่วนนโยบายและแผน'
              ],
              [
                'fac_id'=> '00657',
                'fac_name_th'=> 'ส่วนบริการงานวิจัย'
              ],
              [
                'fac_id'=> '00649',
                'fac_name_th'=> 'ส่วนประกันคุณภาพการศึกษาและพัฒนาหลักสูตร'
              ],
              [
                'fac_id'=> '00658',
                'fac_name_th'=> 'ส่วนประชาสัมพันธ์'
              ],
              [
                'fac_id'=> '00650',
                'fac_name_th'=> 'ส่วนประสานงานบัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00741',
                'fac_name_th'=> 'ส่วนแผนงาน'
              ],
              [
                'fac_id'=> '00648',
                'fac_name_th'=> 'ส่วนพัฒนาความสัมพันธ์ระหว่างประเทศ'
              ],
              [
                'fac_id'=> '00659',
                'fac_name_th'=> 'ส่วนพัฒนานักศึกษา'
              ],
              [
                'fac_id'=> '00660',
                'fac_name_th'=> 'ส่วนพัสดุ'
              ],
              [
                'fac_id'=> '00661',
                'fac_name_th'=> 'ส่วนรับนักศึกษา'
              ],
              [
                'fac_id'=> '00742',
                'fac_name_th'=> 'ส่วนวิเทศสัมพันธ์'
              ],
              [
                'fac_id'=> '00743',
                'fac_name_th'=> 'ส่วนส่งเสริมวิชาการ'
              ],
              [
                'fac_id'=> '00662',
                'fac_name_th'=> 'ส่วนสารบรรณ อำนวยการและนิติการ'
              ],
              [
                'fac_id'=> '00744',
                'fac_name_th'=> 'ส่วนสารบรรณและอำนวยการ'
              ],
              [
                'fac_id'=> '00663',
                'fac_name_th'=> 'ส่วนอาคารสถานที่'
              ],
              [
                'fac_id'=> '00554',
                'fac_name_th'=> 'สหกรณ์ร้านค้ามหาวิทยาลัยราชภัฏเชียงราย จำกัด'
              ],
              [
                'fac_id'=> '01013',
                'fac_name_th'=> 'สหกรณ์ออมทรัพย์'
              ],
              [
                'fac_id'=> '00152',
                'fac_name_th'=> 'สาขาวิชาการศึกษา'
              ],
              [
                'fac_id'=> '00153',
                'fac_name_th'=> 'สาขาวิชาคหกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00847',
                'fac_name_th'=> 'สาขาวิชาเคมีชีวภาพ'
              ],
              [
                'fac_id'=> '00228',
                'fac_name_th'=> 'สาขาวิชานิติศาสตร์'
              ],
              [
                'fac_id'=> '00229',
                'fac_name_th'=> 'สาขาวิชานิเทศศาสตร์'
              ],
              [
                'fac_id'=> '00230',
                'fac_name_th'=> 'สาขาวิชาพยาบาลศาสตร์'
              ],
              [
                'fac_id'=> '00848',
                'fac_name_th'=> 'สาขาวิชาพิษวิทยา'
              ],
              [
                'fac_id'=> '01097',
                'fac_name_th'=> 'สาขาวิชาพิษวิทยาสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '01117',
                'fac_name_th'=> 'สาขาวิชาพิษวิทยาสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00316',
                'fac_name_th'=> 'สาขาวิชาเภสัชศาสตร์'
              ],
              [
                'fac_id'=> '00927',
                'fac_name_th'=> 'สาขาวิชามนุษยนิเวศศาสตร์'
              ],
              [
                'fac_id'=> '00154',
                'fac_name_th'=> 'สาขาวิชารัฐศาสตร์'
              ],
              [
                'fac_id'=> '00155',
                'fac_name_th'=> 'สาขาวิชาวิทยาการจัดการ'
              ],
              [
                'fac_id'=> '00156',
                'fac_name_th'=> 'สาขาวิชาวิทยาศาสตร์'
              ],
              [
                'fac_id'=> '00846',
                'fac_name_th'=> 'สาขาวิชาวิทยาศาสตร์ชีวภาพ'
              ],
              [
                'fac_id'=> '01098',
                'fac_name_th'=> 'สาขาวิชาวิทยาศาสตร์ชีวภาพประยุกต์'
              ],
              [
                'fac_id'=> '00231',
                'fac_name_th'=> 'สาขาวิชาวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00157',
                'fac_name_th'=> 'สาขาวิชาวิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '00158',
                'fac_name_th'=> 'สาขาวิชาศิลปศาสตร์'
              ],
              [
                'fac_id'=> '00159',
                'fac_name_th'=> 'สาขาวิชาศึกษาศาสตร์'
              ],
              [
                'fac_id'=> '00160',
                'fac_name_th'=> 'สาขาวิชาเศรษฐศาสตร์'
              ],
              [
                'fac_id'=> '00161',
                'fac_name_th'=> 'สาขาวิชาส่งเสริมการเกษตรและสหกรณ์'
              ],
              [
                'fac_id'=> '01768',
                'fac_name_th'=> 'สาขาวิชาสถาปัตยกรรม'
              ],
              [
                'fac_id'=> '00162',
                'fac_name_th'=> 'สายวิชาเกษตรศาตร์'
              ],
              [
                'fac_id'=> '00163',
                'fac_name_th'=> 'สายวิชาช่างอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00164',
                'fac_name_th'=> 'สายวิชาบริหารธุรกิจ ศิลปศาสตร์ คหกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00604',
                'fac_name_th'=> 'สำนักการศึกษาต่อเนื่อง'
              ],
              [
                'fac_id'=> '00165',
                'fac_name_th'=> 'สำนักการศึกษาระบบสารสนเทศ'
              ],
              [
                'fac_id'=> '00355',
                'fac_name_th'=> 'สำนักกิจการนักศึกษา'
              ],
              [
                'fac_id'=> '01284',
                'fac_name_th'=> 'สำนักกิจการนิสิตนักศึกษา'
              ],
              [
                'fac_id'=> '00341',
                'fac_name_th'=> 'สำนักกิจการพิเศษ'
              ],
              [
                'fac_id'=> '00317',
                'fac_name_th'=> 'สำนักกิจการหอพัก'
              ],
              [
                'fac_id'=> '00696',
                'fac_name_th'=> 'สำนักกีฬา'
              ],
              [
                'fac_id'=> '00979',
                'fac_name_th'=> 'สำนักกีฬาและกิจกรรมนักศึกษา'
              ],
              [
                'fac_id'=> '00318',
                'fac_name_th'=> 'สำนักคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00324',
                'fac_name_th'=> 'สำนักคอมพิวเตอร์และเครือข่าย'
              ],
              [
                'fac_id'=> '00566',
                'fac_name_th'=> 'สำนักคอมพิวเตอร์และเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00342',
                'fac_name_th'=> 'สำนักงวางแผน'
              ],
              [
                'fac_id'=> '00343',
                'fac_name_th'=> 'สำนักงส่งเสริมวิชาการ'
              ],
              [
                'fac_id'=> '00319',
                'fac_name_th'=> 'สำนักงาน ปปช.'
              ],
              [
                'fac_id'=> '00713',
                'fac_name_th'=> 'สำนักงาน มจธ.ราชบุรี'
              ],
              [
                'fac_id'=> '00854',
                'fac_name_th'=> 'สำนักงานกองทุนนักศึกษา'
              ],
              [
                'fac_id'=> '00858',
                'fac_name_th'=> 'สำนักงานการคลัง'
              ],
              [
                'fac_id'=> '00856',
                'fac_name_th'=> 'สำนักงานการเงินและทรัพย์สิน'
              ],
              [
                'fac_id'=> '00433',
                'fac_name_th'=> 'สำนักงานการทะเบียนและประมวลผล'
              ],
              [
                'fac_id'=> '00724',
                'fac_name_th'=> 'สำนักงานการศึกษานอกสถาบัน'
              ],
              [
                'fac_id'=> '00951',
                'fac_name_th'=> 'สำนักงานการศึกษาภาคพิเศษ'
              ],
              [
                'fac_id'=> '00466',
                'fac_name_th'=> 'สำนักงานกิจการนักศึกษา'
              ],
              [
                'fac_id'=> '00816',
                'fac_name_th'=> 'สำนักงานคณบดี'
              ],
              [
                'fac_id'=> '01562',
                'fac_name_th'=> 'สำนักงานคณะกรรมการบัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00532',
                'fac_name_th'=> 'สำนักงานโครงการจัดตั้งวิทยาเขตลพบุรี'
              ],
              [
                'fac_id'=> '00534',
                'fac_name_th'=> 'สำนักงานโครงการจัดตั้งวิทยาเขตสารสนเทศกระบี่'
              ],
              [
                'fac_id'=> '00533',
                'fac_name_th'=> 'สำนักงานโครงการจัดตั้งวิทยาเขตสุพรรณบุรี'
              ],
              [
                'fac_id'=> '00643',
                'fac_name_th'=> 'สำนักงานจัดการทรัพย์สินและรายได้'
              ],
              [
                'fac_id'=> '01114',
                'fac_name_th'=> 'สำนักงานจัดการศึกษาทั่วไป'
              ],
              [
                'fac_id'=> '00362',
                'fac_name_th'=> 'สำนักงานตรวจสอบภายใน'
              ],
              [
                'fac_id'=> '00459',
                'fac_name_th'=> 'สำนักงานทรัพย์สิน'
              ],
              [
                'fac_id'=> '00465',
                'fac_name_th'=> 'สำนักงานทะเบียน'
              ],
              [
                'fac_id'=> '00458',
                'fac_name_th'=> 'สำนักงานเทคโนโลยีทางการศึกษา'
              ],
              [
                'fac_id'=> '00718',
                'fac_name_th'=> 'สำนักงานนิด้าสัมพันธ์'
              ],
              [
                'fac_id'=> '00460',
                'fac_name_th'=> 'สำนักงานบริการคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00539',
                'fac_name_th'=> 'สำนักงานบริการที่พักอาศัย'
              ],
              [
                'fac_id'=> '00467',
                'fac_name_th'=> 'สำนักงานบริการและสวัสดิการนักศึกษา'
              ],
              [
                'fac_id'=> '01560',
                'fac_name_th'=> 'สำนักงานบริหารกิจการหอพัก'
              ],
              [
                'fac_id'=> '00910',
                'fac_name_th'=> 'สำนักงานบริหารงานกิจการหอพัก'
              ],
              [
                'fac_id'=> '00586',
                'fac_name_th'=> 'สำนักงานบริหารจัดการทรัพย์สิน'
              ],
              [
                'fac_id'=> '00859',
                'fac_name_th'=> 'สำนักงานบริหารทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '00944',
                'fac_name_th'=> 'สำนักงานบริหารแผนและการคลัง'
              ],
              [
                'fac_id'=> '00729',
                'fac_name_th'=> 'สำนักงานบริหารวิทยาเขตพัทลุง'
              ],
              [
                'fac_id'=> '00728',
                'fac_name_th'=> 'สำนักงานบริหารวิทยาเขตสงขลา'
              ],
              [
                'fac_id'=> '00461',
                'fac_name_th'=> 'สำนักงานบัณฑิตวิทยาลัย'
              ],
              [
                'fac_id'=> '00463',
                'fac_name_th'=> 'สำนักงานบุคคล'
              ],
              [
                'fac_id'=> '01101',
                'fac_name_th'=> 'สำนักงานประกันคุณภาพการศึกษา '
              ],
              [
                'fac_id'=> '00468',
                'fac_name_th'=> 'สำนักงานประชาสัมพันธ์และการตลาด'
              ],
              [
                'fac_id'=> '00887',
                'fac_name_th'=> 'สำนักงานประสานงานโครงการส่งเสริมคุณภาพการศึกษาในโรงเรียนตำรวจตระเวนชายแดนและการพัฒนาท้องถิ่น มหาวิทยาลัยราชภัฏเชียงราย'
              ],
              [
                'fac_id'=> '00698',
                'fac_name_th'=> 'สำนักงานประสานงานสาขาวิทยบริการ'
              ],
              [
                'fac_id'=> '01068',
                'fac_name_th'=> 'สำนักงานประสานศูนย์การศึกษาภูมิภาค'
              ],
              [
                'fac_id'=> '00815',
                'fac_name_th'=> 'สำนักงานผู้อำนวยการ'
              ],
              [
                'fac_id'=> '00624',
                'fac_name_th'=> 'สำนักงานฝ่ายบริการการศึกษา'
              ],
              [
                'fac_id'=> '01045',
                'fac_name_th'=> 'สำนักงานพลังงานและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '00432',
                'fac_name_th'=> 'สำนักงานมหาวิทยาลัย'
              ],
              [
                'fac_id'=> '00807',
                'fac_name_th'=> 'สำนักงานมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี บางขุนเทียน'
              ],
              [
                'fac_id'=> '00865',
                'fac_name_th'=> 'สำนักงานมูลนิธิเพื่อการอุดมศึกษาอิสลามภาคใต้'
              ],
              [
                'fac_id'=> '00676',
                'fac_name_th'=> 'สำนักงานยุทธศาสตร์การพัฒนา'
              ],
              [
                'fac_id'=> '00456',
                'fac_name_th'=> 'สำนักงานรองอธิการบดี'
              ],
              [
                'fac_id'=> '00377',
                'fac_name_th'=> 'สำนักงานเลขานุการ'
              ],
              [
                'fac_id'=> '00457',
                'fac_name_th'=> 'สำนักงานวิจัยและมาตรฐานการศึกษา'
              ],
              [
                'fac_id'=> '00464',
                'fac_name_th'=> 'สำนักงานวิชาการ'
              ],
              [
                'fac_id'=> '00719',
                'fac_name_th'=> 'สำนักงานวิทยาเขต'
              ],
              [
                'fac_id'=> '00959',
                'fac_name_th'=> 'สำนักงานวิทยาเขตกาฬสินธุ์'
              ],
              [
                'fac_id'=> '00441',
                'fac_name_th'=> 'สำนักงานวิทยาเขตกำแพงแสน'
              ],
              [
                'fac_id'=> '01445',
                'fac_name_th'=> 'สำนักงานวิทยาเขตขอนแก่น'
              ],
              [
                'fac_id'=> '01626',
                'fac_name_th'=> 'สำนักงานวิทยาเขตจักรพงษภูวนารถ'
              ],
              [
                'fac_id'=> '00531',
                'fac_name_th'=> 'สำนักงานวิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร'
              ],
              [
                'fac_id'=> '01271',
                'fac_name_th'=> 'สำนักงานวิทยาเขตตรัง'
              ],
              [
                'fac_id'=> '01105',
                'fac_name_th'=> 'สำนักงานวิทยาเขตนครศรีธรรมราช'
              ],
              [
                'fac_id'=> '00941',
                'fac_name_th'=> 'สำนักงานวิทยาเขตวังไกลกังวล'
              ],
              [
                'fac_id'=> '00442',
                'fac_name_th'=> 'สำนักงานวิทยาเขตศรีราชา'
              ],
              [
                'fac_id'=> '00443',
                'fac_name_th'=> 'สำนักงานวิทยาเขตสกลนคร'
              ],
              [
                'fac_id'=> '00145',
                'fac_name_th'=> 'สำนักงานวิทยาเขตสุรินทร์'
              ],
              [
                'fac_id'=> '80022',
                'fac_name_th'=> 'สำนักงานวิทยาเขตอุเทนถวาย'
              ],
              [
                'fac_id'=> '00675',
                'fac_name_th'=> 'สำนักงานวิเทศสัมพันธ์และประชาสัมพันธ์'
              ],
              [
                'fac_id'=> '00344',
                'fac_name_th'=> 'สำนักงานส่งเสริมวิชาการ'
              ],
              [
                'fac_id'=> '00345',
                'fac_name_th'=> 'สำนักงานส่งเสริมวิชาการและงานทะเบียน'
              ],
              [
                'fac_id'=> '00685',
                'fac_name_th'=> 'สำนักงานสภามหาวิทยาลัย'
              ],
              [
                'fac_id'=> '01291',
                'fac_name_th'=> 'สำนักงานสภาสถาบัน'
              ],
              [
                'fac_id'=> '00945',
                'fac_name_th'=> 'สำนักงานสหวิทยาการ การวิจัย และการจัดการความรู้'
              ],
              [
                'fac_id'=> '00697',
                'fac_name_th'=> 'สำนักงานสาขาวิทยบริการเฉลิมพระเกียรติ'
              ],
              [
                'fac_id'=> '00709',
                'fac_name_th'=> 'สำนักงานสาขาวิทยบริการเฉลิมพระเกียรติต่างประเทศ'
              ],
              [
                'fac_id'=> '00455',
                'fac_name_th'=> 'สำนักงานห้องสมุด'
              ],
              [
                'fac_id'=> '01049',
                'fac_name_th'=> 'สำนักงานหอพัก'
              ],
              [
                'fac_id'=> '01018',
                'fac_name_th'=> 'สำนักงานให้คำปรึกษาและช่วยเหลือนักศึกษา'
              ],
              [
                'fac_id'=> '00320',
                'fac_name_th'=> 'สำนักงานอธิการบดี'
              ],
              [
                'fac_id'=> '01609',
                'fac_name_th'=> 'สำนักงานอธิการบดีวิทยาเขตภูเก็ต'
              ],
              [
                'fac_id'=> '01610',
                'fac_name_th'=> 'สำนักงานอธิการบดีวิทยาเขตสุราษฎร์ธานี'
              ],
              [
                'fac_id'=> '00860',
                'fac_name_th'=> 'สำนักงานอาคารและภูมิทัศน์'
              ],
              [
                'fac_id'=> '00462',
                'fac_name_th'=> 'สำนักงานอาคารสถานที่'
              ],
              [
                'fac_id'=> '00346',
                'fac_name_th'=> 'สำนักงานอฺธิการบดี'
              ],
              [
                'fac_id'=> '01059',
                'fac_name_th'=> 'สำนักจัดการทรัพย์สิน'
              ],
              [
                'fac_id'=> '02040',
                'fac_name_th'=> 'สำนักดิจิทัลเทคโนโลยี'
              ],
              [
                'fac_id'=> '00363',
                'fac_name_th'=> 'สำนักตรวจสอบภายใน'
              ],
              [
                'fac_id'=> '00270',
                'fac_name_th'=> 'สำนักทดสอบทางการศึกษาและจิตวิทยา'
              ],
              [
                'fac_id'=> '00707',
                'fac_name_th'=> 'สำนักทดสอบอิเล็กทรอนิกส์'
              ],
              [
                'fac_id'=> '01111',
                'fac_name_th'=> 'สำนักทรัพยากรการเรียนรู้คุณหญิงหลง อรรถกระวีสุนทร'
              ],
              [
                'fac_id'=> '00981',
                'fac_name_th'=> 'สำนักทะเบียนนักศึกษา'
              ],
              [
                'fac_id'=> '01604',
                'fac_name_th'=> 'สำนักทะเบียนและประมวลผล'
              ],
              [
                'fac_id'=> '00378',
                'fac_name_th'=> 'สำนักทะเบียนและวัดผล'
              ],
              [
                'fac_id'=> '00600',
                'fac_name_th'=> 'สำนักเทคโนโลยีการศึกษา'
              ],
              [
                'fac_id'=> '00385',
                'fac_name_th'=> 'สำนักเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00379',
                'fac_name_th'=> 'สำนักนโยบายและแผน'
              ],
              [
                'fac_id'=> '01668',
                'fac_name_th'=> 'สำนักนวัตกรรมการเรียนรู้'
              ],
              [
                'fac_id'=> '01069',
                'fac_name_th'=> 'สำนักนิติการ'
              ],
              [
                'fac_id'=> '00182',
                'fac_name_th'=> 'สำนักนิติศาสตร์'
              ],
              [
                'fac_id'=> '00717',
                'fac_name_th'=> 'สำนักบรรณสารการพัฒนา'
              ],
              [
                'fac_id'=> '00602',
                'fac_name_th'=> 'สำนักบรรณสารสนเทศ'
              ],
              [
                'fac_id'=> '00601',
                'fac_name_th'=> 'สำนักบริการการศึกษา'
              ],
              [
                'fac_id'=> '00444',
                'fac_name_th'=> 'สำนักบริการคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00571',
                'fac_name_th'=> 'สำนักบริการทางวิชาการและทดสอบ'
              ],
              [
                'fac_id'=> '00912',
                'fac_name_th'=> 'สำนักบริการทางวิชาการและทดสอบประเมินผล'
              ],
              [
                'fac_id'=> '00555',
                'fac_name_th'=> 'สำนักบริการเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00321',
                'fac_name_th'=> 'สำนักบริการวิชาการ'
              ],
              [
                'fac_id'=> '00556',
                'fac_name_th'=> 'สำนักบริการวิชาการแก่สังคม'
              ],
              [
                'fac_id'=> '00940',
                'fac_name_th'=> 'สำนักบริการวิชาการชุมชน'
              ],
              [
                'fac_id'=> '00445',
                'fac_name_th'=> 'สำนักบริการวิทยาการ'
              ],
              [
                'fac_id'=> '00454',
                'fac_name_th'=> 'สำนักบริหาร'
              ],
              [
                'fac_id'=> '01387',
                'fac_name_th'=> 'สำนักบริหารงบประมาณและการเงิน'
              ],
              [
                'fac_id'=> '01038',
                'fac_name_th'=> 'สำนักบริหารจัดการสินทรัพย์และวิสาหกิจ'
              ],
              [
                'fac_id'=> '00511',
                'fac_name_th'=> 'สำนักบริหารทรัพยากรมนุษย์'
              ],
              [
                'fac_id'=> '00608',
                'fac_name_th'=> 'สำนักบริหารนนทบุรี'
              ],
              [
                'fac_id'=> '00610',
                'fac_name_th'=> 'สำนักบริหารพระนครศรีอยุธยา วาสุกรี'
              ],
              [
                'fac_id'=> '00684',
                'fac_name_th'=> 'สำนักบริหารรายได้และทรัพย์สิน'
              ],
              [
                'fac_id'=> '01290',
                'fac_name_th'=> 'สำนักบริหารวิชาการ'
              ],
              [
                'fac_id'=> '00609',
                'fac_name_th'=> 'สำนักบริหารสุพรรณบุรี'
              ],
              [
                'fac_id'=> '00606',
                'fac_name_th'=> 'สำนักบัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00654',
                'fac_name_th'=> 'สำนักบัณฑิตศึกษาและกิจการนานาชาติ'
              ],
              [
                'fac_id'=> '00166',
                'fac_name_th'=> 'สำนักบัณฑิตอาสาสมัคร'
              ],
              [
                'fac_id'=> '00412',
                'fac_name_th'=> 'สำนักประกันคุณภาพ'
              ],
              [
                'fac_id'=> '00347',
                'fac_name_th'=> 'สำนักประกันคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00791',
                'fac_name_th'=> 'สำนักผู้ตรวจสอบภายใน'
              ],
              [
                'fac_id'=> '00745',
                'fac_name_th'=> 'สำนักผู้บริหาร'
              ],
              [
                'fac_id'=> '00716',
                'fac_name_th'=> 'สำนักฝึกอบรม'
              ],
              [
                'fac_id'=> '00413',
                'fac_name_th'=> 'สำนักฝึกอบรมและบริการสังคม'
              ],
              [
                'fac_id'=> '01102',
                'fac_name_th'=> 'สำนักพัฒนาคุณภาพ '
              ],
              [
                'fac_id'=> '00843',
                'fac_name_th'=> 'สำนักพัฒนาคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00568',
                'fac_name_th'=> 'สำนักพัฒนาเทคนิคศึกษา'
              ],
              [
                'fac_id'=> '00569',
                'fac_name_th'=> 'สำนักพัฒนาเทคโนโลยีเพื่ออุตสาหกรรม'
              ],
              [
                'fac_id'=> '01741',
                'fac_name_th'=> 'สำนักพัฒนานวัตกรรม'
              ],
              [
                'fac_id'=> '00167',
                'fac_name_th'=> 'สำนักพัฒนาบัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00380',
                'fac_name_th'=> 'สำนักพัฒนาระบบงบประมาณและการเงิน'
              ],
              [
                'fac_id'=> '00388',
                'fac_name_th'=> 'สำนักพัฒนาระบบและการเงิน'
              ],
              [
                'fac_id'=> '00572',
                'fac_name_th'=> 'สำนักพัฒนาและบริการวิชาการ'
              ],
              [
                'fac_id'=> '01455',
                'fac_name_th'=> 'สำนักพัฒนาวิชาการ'
              ],
              [
                'fac_id'=> '01456',
                'fac_name_th'=> 'สำนักพัฒนาวินักศึกษา'
              ],
              [
                'fac_id'=> '00446',
                'fac_name_th'=> 'สำนักพิพิธภัณฑ์และวัฒนธรรมการเกษตร'
              ],
              [
                'fac_id'=> '00603',
                'fac_name_th'=> 'สำนักพิมพ์'
              ],
              [
                'fac_id'=> '00971',
                'fac_name_th'=> 'สำนักพิมพ์มหาวิทยาลัยกรุงเทพ'
              ],
              [
                'fac_id'=> '01033',
                'fac_name_th'=> 'สำนักพิมพ์มหาวิทยาลัยมหาสารคาม'
              ],
              [
                'fac_id'=> '01037',
                'fac_name_th'=> 'สำนักพิมพ์มหาวิทยาลัยแม่โจ้'
              ],
              [
                'fac_id'=> '00838',
                'fac_name_th'=> 'สำนักฟาร์มมหาวิทยาลัย'
              ],
              [
                'fac_id'=> '00381',
                'fac_name_th'=> 'สำนักภาษา - ศิลปวัฒนธรรม'
              ],
              [
                'fac_id'=> '00364',
                'fac_name_th'=> 'สำนักมาตรฐานการศึกษา'
              ],
              [
                'fac_id'=> '01453',
                'fac_name_th'=> 'สำนักมาตรฐานและ จัดการคุณภาพ'
              ],
              [
                'fac_id'=> '80010',
                'fac_name_th'=> 'สำนักมาตรฐานและประกันคุณภาพ'
              ],
              [
                'fac_id'=> '00382',
                'fac_name_th'=> 'สำนักมาตรฐานและประกันคุณภาพการศึกษา'
              ],
              [
                'fac_id'=> '00557',
                'fac_name_th'=> 'สำนักมาตรฐานวิชาการและประกันคุณภาพ'
              ],
              [
                'fac_id'=> '00689',
                'fac_name_th'=> 'สำนักรับนักศึกษาและทะเบียน'
              ],
              [
                'fac_id'=> '01396',
                'fac_name_th'=> 'สำนักรับสมัครและทุนช่วยเหลือการศึกษา'
              ],
              [
                'fac_id'=> '00587',
                'fac_name_th'=> 'สำนักวัฒนธรรม'
              ],
              [
                'fac_id'=> '00414',
                'fac_name_th'=> 'สำนักวางแผน ฯ'
              ],
              [
                'fac_id'=> '00365',
                'fac_name_th'=> 'สำนักวางแผนและพัฒนา'
              ],
              [
                'fac_id'=> '00348',
                'fac_name_th'=> 'สำนักวานแผน'
              ],
              [
                'fac_id'=> '00356',
                'fac_name_th'=> 'สำนักวิจัย'
              ],
              [
                'fac_id'=> '01040',
                'fac_name_th'=> 'สำนักวิจัยนาโนเทคโนโลยีพระจอมเกล้าลาดกระบัง'
              ],
              [
                'fac_id'=> '00578',
                'fac_name_th'=> 'สำนักวิจัยและบริการคอมพิวเตอร์'
              ],
              [
                'fac_id'=> '00349',
                'fac_name_th'=> 'สำนักวิจัยและบริการวิชาการ'
              ],
              [
                'fac_id'=> '00714',
                'fac_name_th'=> 'สำนักวิจัยและบริการวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '01123',
                'fac_name_th'=> 'สำนักวิจัยและพัฒนา'
              ],
              [
                'fac_id'=> '01392',
                'fac_name_th'=> 'สำนักวิจัยและวางแผนพัฒนา'
              ],
              [
                'fac_id'=> '00635',
                'fac_name_th'=> 'สำนักวิจัยและส่งเสริมวิชาการการเกษตร'
              ],
              [
                'fac_id'=> '01078',
                'fac_name_th'=> 'สำนักวิจัยวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '00966',
                'fac_name_th'=> 'สำนักวิจัยสถาบันและประเมินผล'
              ],
              [
                'fac_id'=> '01599',
                'fac_name_th'=> 'สำนักวิชากฎหมาย'
              ],
              [
                'fac_id'=> '00453',
                'fac_name_th'=> 'สำนักวิชาการ'
              ],
              [
                'fac_id'=> '00168',
                'fac_name_th'=> 'สำนักวิชาการจัดการ'
              ],
              [
                'fac_id'=> '01602',
                'fac_name_th'=> 'สำนักวิชาการท่องเที่ยว'
              ],
              [
                'fac_id'=> '00754',
                'fac_name_th'=> 'สำนักวิชาการบัญชี'
              ],
              [
                'fac_id'=> '01971',
                'fac_name_th'=> 'สำนักวิชาการแพทย์บูรณาการ'
              ],
              [
                'fac_id'=> '00950',
                'fac_name_th'=> 'สำนักวิชาเกษตรศาสตร์ ทรัพยากรธรรมชาติและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '01029',
                'fac_name_th'=> 'สำนักวิชาเกษตรศาสตร์ทรัพยากรธรรมชาติ'
              ],
              [
                'fac_id'=> '01598',
                'fac_name_th'=> 'สำนักวิชาคอมพิวเตอร์และเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '01744',
                'fac_name_th'=> 'สำนักวิชาจีนวิทยา'
              ],
              [
                'fac_id'=> '01576',
                'fac_name_th'=> 'สำนักวิชาทรัพยากรการเกษตร'
              ],
              [
                'fac_id'=> '01752',
                'fac_name_th'=> 'สำนักวิชาทันตแพทยศาสตร์'
              ],
              [
                'fac_id'=> '00169',
                'fac_name_th'=> 'สำนักวิชาเทคโนโลยีการเกษตร'
              ],
              [
                'fac_id'=> '00170',
                'fac_name_th'=> 'สำนักวิชาเทคโนโลยีสังคม'
              ],
              [
                'fac_id'=> '00171',
                'fac_name_th'=> 'สำนักวิชาเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00948',
                'fac_name_th'=> 'สำนักวิชาเทคโนโลยีสารสนเทศและการสื่อสาร'
              ],
              [
                'fac_id'=> '00262',
                'fac_name_th'=> 'สำนักวิชาเทคโนโลยีอุตสาหกรรม'
              ],
              [
                'fac_id'=> '01746',
                'fac_name_th'=> 'สำนักวิชานวัตกรรมสังคม'
              ],
              [
                'fac_id'=> '02000',
                'fac_name_th'=> 'สำนักวิชานานาชาติ'
              ],
              [
                'fac_id'=> '00263',
                'fac_name_th'=> 'สำนักวิชานิติศาสตร์'
              ],
              [
                'fac_id'=> '00755',
                'fac_name_th'=> 'สำนักวิชาบริหารธุรกิจ'
              ],
              [
                'fac_id'=> '01600',
                'fac_name_th'=> 'สำนักวิชาบริหารรัฐกิจ'
              ],
              [
                'fac_id'=> '01601',
                'fac_name_th'=> 'สำนักวิชาบัญชี'
              ],
              [
                'fac_id'=> '02038',
                'fac_name_th'=> 'สำนักวิชาบัณฑิตศึกษา'
              ],
              [
                'fac_id'=> '00746',
                'fac_name_th'=> 'สำนักวิชาพยาบาลศาสตร์'
              ],
              [
                'fac_id'=> '01027',
                'fac_name_th'=> 'สำนักวิชาพลังงานและสิ่งแวดล้อม'
              ],
              [
                'fac_id'=> '01086',
                'fac_name_th'=> 'สำนักวิชาพื้นฐานและภาษา'
              ],
              [
                'fac_id'=> '00172',
                'fac_name_th'=> 'สำนักวิชาแพทยศาสตร์'
              ],
              [
                'fac_id'=> '00923',
                'fac_name_th'=> 'สำนักวิชาเภสัชศาสตร์'
              ],
              [
                'fac_id'=> '01862',
                'fac_name_th'=> 'สำนักวิชารัฐศาสตร์และนิติศาสตร์'
              ],
              [
                'fac_id'=> '00173',
                'fac_name_th'=> 'สำนักวิชาวิทยาการจัดการ'
              ],
              [
                'fac_id'=> '01028',
                'fac_name_th'=> 'สำนักวิชาวิทยาการจัดการและสารสนเทศศาสตร์'
              ],
              [
                'fac_id'=> '01776',
                'fac_name_th'=> 'สำนักวิชาวิทยาการพลังงาน'
              ],
              [
                'fac_id'=> '01778',
                'fac_name_th'=> 'สำนักวิชาวิทยาการโมเลกุล '
              ],
              [
                'fac_id'=> '00115',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์'
              ],
              [
                'fac_id'=> '00236',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์การกีฬา'
              ],
              [
                'fac_id'=> '00949',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์การแพทย์'
              ],
              [
                'fac_id'=> '00264',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์เครื่องสำอาง'
              ],
              [
                'fac_id'=> '00947',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์และเทคโนโลยี'
              ],
              [
                'fac_id'=> '01908',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์และเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '01910',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์และวิศวกรรมชีวโมเลกุล'
              ],
              [
                'fac_id'=> '00265',
                'fac_name_th'=> 'สำนักวิชาวิทยาศาสตร์สุขภาพ'
              ],
              [
                'fac_id'=> '00175',
                'fac_name_th'=> 'สำนักวิชาวิศวกรรมศาสตร์'
              ],
              [
                'fac_id'=> '00176',
                'fac_name_th'=> 'สำนักวิชาวิศวกรรมศาสตร์และทรัพยากร'
              ],
              [
                'fac_id'=> '02193',
                'fac_name_th'=> 'สำนักวิชาวิศวกรรมศาสตร์และนวัตกรรม'
              ],
              [
                'fac_id'=> '01016',
                'fac_name_th'=> 'สำนักวิชาเวชศาสตร์ชะลอวัยและฟื้นฟูสุขภาพ'
              ],
              [
                'fac_id'=> '00116',
                'fac_name_th'=> 'สำนักวิชาศิลปศาสตร์'
              ],
              [
                'fac_id'=> '00855',
                'fac_name_th'=> 'สำนักวิชาศึกษาทั่วไป'
              ],
              [
                'fac_id'=> '00909',
                'fac_name_th'=> 'สำนักวิชาศึกษาทั่วไปและวิทยาศาสตร์คณิตศาสตร์พื้นฐาน'
              ],
              [
                'fac_id'=> '01164',
                'fac_name_th'=> 'สำนักวิชาเศรษฐศาสตร์และนโยบายสาธารณะ'
              ],
              [
                'fac_id'=> '00753',
                'fac_name_th'=> 'สำนักวิชาเศรษฐศาสตร์และสังคมศาสตร์'
              ],
              [
                'fac_id'=> '00919',
                'fac_name_th'=> 'สำนักวิชาสถาปัตยกรรมศาสตร์และการออกแบบ'
              ],
              [
                'fac_id'=> '01026',
                'fac_name_th'=> 'สำนักวิชาสหเวชศาสตร์'
              ],
              [
                'fac_id'=> '00117',
                'fac_name_th'=> 'สำนักวิชาสหเวชศาสตร์และสาธารณสุขศาสตร์'
              ],
              [
                'fac_id'=> '01597',
                'fac_name_th'=> 'สำนักวิชาสังคมศาสตร์'
              ],
              [
                'fac_id'=> '01849',
                'fac_name_th'=> 'สำนักวิชาสาธารณสุขศาสตร์'
              ],
              [
                'fac_id'=> '00178',
                'fac_name_th'=> 'สำนักวิชาสารสนเทศศาสตร์'
              ],
              [
                'fac_id'=> '00756',
                'fac_name_th'=> 'สำนักวิชาอุตสาหกรรมการท่องเที่ยวและการบริการ'
              ],
              [
                'fac_id'=> '00179',
                'fac_name_th'=> 'สำนักวิชาอุตสาหกรรมเกษตร'
              ],
              [
                'fac_id'=> '00322',
                'fac_name_th'=> 'สำนักวิทยบริการ'
              ],
              [
                'fac_id'=> '80032',
                'fac_name_th'=> 'สำนักวิทยบริการ วิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร'
              ],
              [
                'fac_id'=> '00530',
                'fac_name_th'=> 'สำนักวิทยบริการ วิทยาเขตศรีราชา'
              ],
              [
                'fac_id'=> '00415',
                'fac_name_th'=> 'สำนักวิทยบริการ ฯ'
              ],
              [
                'fac_id'=> '00350',
                'fac_name_th'=> 'สำนักวิทยบริการและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00605',
                'fac_name_th'=> 'สำนักวิทยพัฒนา'
              ],
              [
                'fac_id'=> '00351',
                'fac_name_th'=> 'สำนักวิทยาบริการและเทคโนโลยีสารสนเทศ'
              ],
              [
                'fac_id'=> '00118',
                'fac_name_th'=> 'สำนักวิทยาศาสตร์'
              ],
              [
                'fac_id'=> '01864',
                'fac_name_th'=> 'สำนักวิทยาศาสตร์และวิศวกรรมชีวโมเลกุล'
              ],
              [
                'fac_id'=> '00383',
                'fac_name_th'=> 'สำนักวิเทศสัมพันธ์'
              ],
              [
                'fac_id'=> '80009',
                'fac_name_th'=> 'สำนักวิเทศสัมพันธ์และการจัดการศึกษานานาชาติ'
              ],
              [
                'fac_id'=> '00352',
                'fac_name_th'=> 'สำนักศิลปวัฒนธรรม'
              ],
              [
                'fac_id'=> '01081',
                'fac_name_th'=> 'สำนักศิลปวัฒนธรรมและพัฒนาชุมชน'
              ],
              [
                'fac_id'=> '00367',
                'fac_name_th'=> 'สำนักศิลปะและวัฒนธรรม'
              ],
              [
                'fac_id'=> '01429',
                'fac_name_th'=> 'สำนักศึกษาทั่วไป'
              ],
              [
                'fac_id'=> '01452',
                'fac_name_th'=> 'สำนักส่งเสริมการ เรียนรู้และบริการวิชาการ'
              ],
              [
                'fac_id'=> '00357',
                'fac_name_th'=> 'สำนักส่งเสริมการเรียนรู้'
              ],
              [
                'fac_id'=> '00863',
                'fac_name_th'=> 'สำนักส่งเสริมการวิจัยและเขียนตำรา'
              ],
              [
                'fac_id'=> '01119',
                'fac_name_th'=> 'สำนักส่งเสริมและการศึกษาต่อเนื่อง'
              ],
              [
                'fac_id'=> '01730',
                'fac_name_th'=> 'สำนักส่งเสริมและบริการวิชาการ'
              ],
              [
                'fac_id'=> '01289',
                'fac_name_th'=> 'สำนักส่งเสริมและบริการวิชาการพระจอมเกล้าลาดกระบัง'
              ],
              [
                'fac_id'=> '00447',
                'fac_name_th'=> 'สำนักส่งเสริมและฝึกอบรม'
              ],
              [
                'fac_id'=> '00525',
                'fac_name_th'=> 'สำนักส่งเสริมและฝึกอบรม กำแพงแสน'
              ],
              [
                'fac_id'=> '00353',
                'fac_name_th'=> 'สำนักส่งเสริมวิชาการ'
              ],
              [
                'fac_id'=> '00354',
                'fac_name_th'=> 'สำนักส่งเสริมวิชาการและงานทะเบียน'
              ],
              [
                'fac_id'=> '00384',
                'fac_name_th'=> 'สำนักส่งเสริมวิชาการและทะเบียนวัดผล'
              ],
              [
                'fac_id'=> '00840',
                'fac_name_th'=> 'สำนักส่งเสริมศิลปวัฒนธรรม'
              ],
              [
                'fac_id'=> '00715',
                'fac_name_th'=> 'สำนักสวนอุตสาหกรรม'
              ],
              [
                'fac_id'=> '00613',
                'fac_name_th'=> 'สำนักสัตว์ทดลองแห่งชาติ'
              ],
              [
                'fac_id'=> '00946',
                'fac_name_th'=> 'สำนักสามัญศึกษา'
              ],
              [
                'fac_id'=> '80018',
                'fac_name_th'=> 'สำนักสิริพัฒนา'
              ],
              [
                'fac_id'=> '00900',
                'fac_name_th'=> 'สำนักสื่อและเทคโนโลยีการศึกษา'
              ],
              [
                'fac_id'=> '00628',
                'fac_name_th'=> 'สำนักเสริมศึกษาและบริการสังคม'
              ],
              [
                'fac_id'=> '00326',
                'fac_name_th'=> 'สำนักหอสมุด'
              ],
              [
                'fac_id'=> '00526',
                'fac_name_th'=> 'สำนักหอสมุด กำแพงแสน'
              ],
              [
                'fac_id'=> '00512',
                'fac_name_th'=> 'สำนักหอสมุดกลาง'
              ],
              [
                'fac_id'=> '00358',
                'fac_name_th'=> 'สำนักอธิการบดี'
              ],
              [
                'fac_id'=> '01398',
                'fac_name_th'=> 'สำนักอำนวยการ'
              ],
              [
                'fac_id'=> '00801',
                'fac_name_th'=> 'สุรสัมมนาคาร'
              ],
              [
                'fac_id'=> '01088',
                'fac_name_th'=> 'หน่วยงานกลาง'
              ],
              [
                'fac_id'=> '00747',
                'fac_name_th'=> 'หน่วยงานช่วยนักบริหาร'
              ],
              [
                'fac_id'=> '01055',
                'fac_name_th'=> 'หน่วยงานผลิตน้ำดื่มทับแก้ว'
              ],
              [
                'fac_id'=> '00535',
                'fac_name_th'=> 'หน่วยงานอิสระ'
              ],
              [
                'fac_id'=> '01061',
                'fac_name_th'=> 'หน่วยจัดการทรัพย์สินทางปัญญาและถ่ายทอดเทคโนโลยีแห่ง มทร.'
              ],
              [
                'fac_id'=> '00590',
                'fac_name_th'=> 'หน่วยจัดการรายได้และสวัสดิการ'
              ],
              [
                'fac_id'=> '00323',
                'fac_name_th'=> 'หน่วยตรวจสอบภายใน'
              ],
              [
                'fac_id'=> '00879',
                'fac_name_th'=> 'หน่วยบ่มเพาะวิสาหกิจ'
              ],
              [
                'fac_id'=> '00792',
                'fac_name_th'=> 'หน่วยบริการปฏิคม'
              ],
              [
                'fac_id'=> '00647',
                'fac_name_th'=> 'หน่วยประสานงานมหาวิทยาลัยแม่ฟ้าหลวง กรุงเทพมหานคร'
              ],
              [
                'fac_id'=> '00748',
                'fac_name_th'=> 'หน่วยประสานงานมหาวิทยาลัยวลัยลักษณ์ กรุงเทพมหานคร'
              ],
              [
                'fac_id'=> '00664',
                'fac_name_th'=> 'หน่วยพัฒนาการเรียนการสอน'
              ],
              [
                'fac_id'=> '00886',
                'fac_name_th'=> 'หน่วยพัฒนาบุคลากร'
              ],
              [
                'fac_id'=> '00749',
                'fac_name_th'=> 'หน่วยพัฒนาองค์กร'
              ],
              [
                'fac_id'=> '00405',
                'fac_name_th'=> 'ห้องสมุด'
              ],
              [
                'fac_id'=> '00695',
                'fac_name_th'=> 'ห้องอาหาร'
              ],
              [
                'fac_id'=> '00687',
                'fac_name_th'=> 'หอพักนักศึกษา'
              ],
              [
                'fac_id'=> '00513',
                'fac_name_th'=> 'หอศิลป์'
              ],
              [
                'fac_id'=> '00982',
                'fac_name_th'=> 'หอศิลปมหาวิทยาลัยกรุงเทพ'
              ],
              [
                'fac_id'=> '01074',
                'fac_name_th'=> 'หอสมุดมหาวิทยาลัยศรีนครินทรวิโรฒ องครักษ์'
              ],
              [
                'fac_id'=> '01190',
                'fac_name_th'=> 'หอสมุดและคลังความรู้ มหาวิทยาลัยมหิดล'
              ]
        ];

        foreach ($faculties as $key => $value) {
            Faculty::create($value);
        }
    }
}
